{
    "Title": "gov-page",
    "BlogPosts": [
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/city-of-joburg_orig.jpg",
            "Href": "https://www.govpage.co.za/city-of-johannesburg-metropolitan-municipality-vacancies-blog/city-of-johannesburg-vacancies8940036",
            "Title": "gov-page: CITY OF JOHANNESBURG VACANCIES",
            "Content": [
                "CITY OF JOHANNESBURG\n \nGroup Corporate & Shared Services: Group Human Capital Management\n6th Floor, B Block Metropolitan Centre, 158 Civic Boulevard, Braamfontein\nPO Box 1049 Johannesburg, South Africa, 2000\nTel +27(0) 11 407 6111 - Fax +27(0) 11 339 1878\nwww.joburg.org.za\n ",
                "VACANCY CIRCULAR 073/2023 \n \nThis Vacancy is open to Employees of the City of Johannesburg and External Applicants \n \n CLOSING DATE: THURSDAY, 19 OCTOBER 2023\n \n WE HAVE EXCITING CAREER OPPORTUNITIES FOR: \nPERMANENT POSITIONS: \nMANAGER: PAYROLL AND ADMINISTRATION \nOFFICER: TRANSACTIONS \n \nAPPLICATION REQUIREMENTS \nComplete the online job application form and attach all relevant and updated documents (Certified Qualification/s/Certificates, ID, and CV). \nApplicants should take note that they can be required to provide proof of original documents during the selection process. \nYou will be requested to provide a brief description of your work experience relating to the vacancy. \nApplicants with membership to professional bodies need to provide a membership number and expiry date. \nIf you are an internal applicant, your employee number will be required. \nApplicants are advised to use Google Chrome when applying for CoJ positions. \n \nDISCLAIMER\nThe City of Johannesburg is currently recruiting and will not demand payment in any form for any job placement. All vacancies are advertised in newspapers and on the CoJ website. \nThe City of Johannesburg applies the principles of employment equity as per the National legislation and policy guidelines and will consider designated groups in line with these requirements. We are an equal-opportunity employer. \nBy submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. \nHowever, registering your CV and/or receipt and acknowledgment of any kind shall not be an indication that your application will be successful and/or lead to employment. \nThe City of Johannesburg shall not be liable for any damage, loss, or liability of whatsoever nature arising from your use of the job opportunity section of this website. \nThe City of Johannesburg reserves the right not to make an appointment. \nAny misrepresentation or failure to disclose material information on the application form or CV will automatically disqualify your application. \n \n \nMANAGER: PAYROLL AND ADMINISTRATION \nDEPARTMENT: Group Corporate & Shared Services \nBRANCH: Group Human Capital Management \nDESIGNATION: Manager: Payroll and Administration \nREMUNERATION: R44 693.36 pm (basic salary, excluding benefits) \nLOCATION: Metropolitan Centre, 158 Civic Boulevard, Braamfontein \n \nMinimum Requirements: \nGrade 12 plus Degree in Human Resources Management (HRM), Human Resources Development (HRD), or Payroll Management related tertiary qualification in the discipline of HRM or Financial Management at NQF level 7; \n5 – 7 years’ experience in Payroll Management and Time Management field value chain either public or private sector. \n \nPrimary Function:\nManage, process, and take full responsibility of the CoJ, Pikitup, Metrobus, Joshco, JPC, and MTC payroll and time management administration as well as compliance with legislation, conditions of service, policies, and procedures through auditing and quality assurance to ensure employee payments on a monthly basis. Measure the Service Level Agreement in terms of time management and payroll management, develop SAP HCM systems configuration, and test the changes and implementation on the system. \n \nKey Performance Areas: \nCoordinate management requirements associated with the Payroll and Time Management functionality; \nManage the productivity and Performance Management of personnel of the payroll and time management application of Field and Transactional personnel; \nDecide on management reports in collaboration with Field Services, and collate and prepare qualitative and quantitative information for inclusion into specific statutory reports for payroll and time management; \nAdministration and operational management of SAP HCM Activities (SAP HCM Configuration, Payroll Processing, Time and Attendance Management, Payroll and Leave Data Maintenance, Manage and quality assure payroll and time management processes and procedures, etc.; \nTraining and development of employees; \nRisk and Data management. \n \nLeading Competencies: \nComputer literacy including MS Office Applications; \nGood communication skills; \nPresentation and facilitation skills; \nAccountability;\nHigh level of confidentiality, coordination, and organisational skills; \nTime Management, working independently, under pressure, and the ability to prioritise. \n \nCore Competencies: \nGood knowledge of SAP ECC System and specifically good working knowledge of Payroll and Time Management Modules; \nGood knowledge of formulation of Vision and Strategy; \nGood knowledge of Payroll and Time Management Policies and processes; \nGood knowledge of the Public Service environment; \nGood knowledge of Bargaining Council Conditions of Service and Basic Conditions of Employment Act; \nGood knowledge of the MFMA and MSA; \nGood knowledge of Administration Procedures; \nGood knowledge of Labour Legislation (LLA, BCEA); \nCollaborative/Teamwork, Values and Integrity, Attention to detail, and quality-focused; \nCustomer and Service Delivery Management (Batho Pele) Ethics, Professionalism; \nImpact and Influence according to City’s protocols, legislation, and standards. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender, and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1dXn3HuzrQfuBeZE3xWbhcgew554\nAPPLY ONLINE VIA THIS LINK: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Regina Hartley \nTel No: 011 407 7191 \nCLOSING DATE: THURSDAY, 19 OCTOBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation and \nEmployment record verification, \nCriminal check, and \nIdentity validation. \n \n \n \nOFFICER: TRANSACTIONS \nDEPARTMENT: Group Corporate & Shared Services \nBRANCH: Group Human Capital Management \nDESIGNATION: Officer: Transactions \nREMUNERATION: R25 422,17pm (basic salary, excluding benefits) \nLOCATION: Metropolitan Centre, 158 Civic Boulevard, Braamfontein \n \nMinimum Requirements: \nGrade 12 or equivalent (NQF level 4); \nNational Diploma or Advance Certificate in Human Resources Management or relevant qualification (NQF level 6); \n1 - 3 years of relevant general experience in Human Resources inclusive of employee benefits and remuneration and payroll aspects as applied in transactions;\nExposure to the SAP Human Capital Management (HCM) system will be an added advantage. \n \nPrimary Function:\nCoordinate, facilitate, and support the recording, updating, and maintenance of information on SAP from regions and assuring checking of accuracy of payment transactions captured with regards to various HR payroll activities related to employee remunerations. \n \nKey Performance Areas: \nProvide administration support in relation to processing and updating of information related to employee remuneration and time management and master data on the SAP HCM system; \nRecord, analyse, and retrieve data concerning Human Resources and Payroll functionality; \nAttend to queries/complaints associated with Human Resources (HR) and Payroll activities; \nPerform specific activities associated with departmental support within Transaction Back Office; \nQuality assurance of captured input. \n \nLeading Competencies: \nGood communication (written and verbal); \nInterpersonal and Conflict resolution skills required; \nComputer literacy including MS Office Applications; \nAccountability;\nHigh level of confidentiality and organisational skills; \nTime Management, working independently, under pressure, and ability to prioritise. \n \nCore Competencies: \nTheoretical knowledge of Payroll and HR functions; \nUnderstanding of the Public Service Environment; \nUnderstanding of HR Processes; \nKnowledge of Conditions of Service and Administration Procedures, payroll, and transactional processes; \nCollaborative/Teamwork, Values and Integrity, Attention to detail, and quality-focused; \nCustomer and Service Delivery Management (Batho Pele) Ethics, Professionalism; \nImpact and Influence according to City’s protocols, legislation, and standards. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1RkhZCGlQQ8-P-CQJEfVbNgew554  \nAPPLY ONLINE VIA THIS LINK: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Tisetso Sydney Kuduza \nTel No: 011 407 7139 \nCLOSING DATE: THURSDAY, 19 OCTOBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation and \nEmployment record verification, \nCriminal check, and Identity validation. \n \n \n \n \n ",
                " \n \n \n \nVACANCY CIRCULAR 072/2023 \n \nThis Vacancy is open to Employees of the City of Johannesburg and External Applicants \n \nCLOSING DATE: WEDNESDAY, 18 OCTOBER 2023\n \n WE HAVE AN EXCITING CAREER OPPORTUNITY FOR: \nPERMANENT POSITION \nSPECIALIST: KNOWLEDGE HUB\n \nAPPLICATION REQUIREMENTS \nComplete the online job application form and attach all relevant and updated documents (Certified Qualification/s/Certificates, ID, and CV). \nApplicants should take note that they can be required to provide proof of original documents during the selection process. \nYou will be requested to provide a brief description of your work experience relating to the vacancy. \nApplicants with membership to professional bodies need to provide a membership number and expiry date. \nIf you are an internal applicant, your employee number will be required. \nApplicants are advised to use Google Chrome when applying for CoJ positions. \n \nDISCLAIMER\nThe City of Johannesburg is currently recruiting and will not demand payment in any form for any job placement. All vacancies are advertised in newspapers and on the CoJ website. \nThe City of Johannesburg applies the principles of employment equity as per the National legislation and policy guidelines and will consider designated groups in line with these requirements. We are an equal opportunity employer. \nBy submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. \nHowever, registering your CV and/or receipt and acknowledgement of any kind shall not be an indication that your application will be successful and/or lead to employment. \nThe City of Johannesburg shall not be liable for any damage, loss or liability of whatsoever nature arising from your use of the job opportunity section of this website. \nThe City of Johannesburg reserves the right not to make an appointment. \nAny misrepresentation or failure to disclose material information on the application form or CV will automatically disqualify your application. \n \n \nSPECIALIST: KNOWLEDGE HUB \nDepartment: Officer of the City Manager \nBranch: Group Strategy, Policy Coordination and Relations \nDesignation: Specialist: Knowledge Hub \nSalary Range: R49 989.72 pm (basic salary excluding benefits) \nLocation: Metropolitan Centre, Braamfontein\n \nMinimum Requirements: \nA relevant tertiary qualification (NQF level 7) in Information Management / Information Technology or any knowledge management related qualification is required; \nCertificate in SharePoint would be an added advantage; \n6 – 8 years relevant experience in SharePoint administration, SharePoint design and structuring knowledge in a well packaged manner; \nKnowledge of windows operating systems as well as SQL server, Power BI, PowerShell and Office 365; \nKnowledge of SharePoint tools including workflows and SharePoint terms for tasks; \nExperience working within a large organisation in either the public or private sector will be advantageous; \nIt is necessary that the successful applicant has management of third party (service providers experience through service level agreements; \nKnowledge of data analysis and evaluation, and the ability to translate data accessible knowledge products for diverse audiences; \nCapacity to initiate or develop innovative solutions to often complex, multifaceted issues and problems. \nPrinciples and practices of project management. \nPrinciples and practices of administration and personnel management. \nPrinciples of supervision, training and performance evaluation; and \nMaintain strong professional and positive demeanour. \n \nPrimary Function: \nTo administer and manage the CoJ central knowledge repository, based on the SharePoint environment, as part of ensuring structure and systematic preservation of the City’s institutional knowledge assets for re-use learning and sharing purposes. This includes the assessment and implementation of new capabilities as well as ensuring easy user access to the main portal and sub-sites. \n \nKey Performance Areas: \nBuild and maintain the City’s Knowledge hub; \nConduct regular maintenance and system health checks; \nProvide technical support; \nConduct business and trend analysis regarding knowledge management tools i.e SharePoint; \nManage and establish partnership with identified external partners on key knowledge management programmes in support of the City’s agenda; \nIdentify the short to medium term objectives of the department’s expenditure through control measure; and \nImplement SLA communication strategies aimed at creating awareness and /or seeking acknowledgement. \n \nLeading Competencies: \nAbility to work partnership with senior official and manage relationships with internal and external stakeholders. \nAbility to engage and support others to contribute to knowledge management framework processes and systems; and \nAbility to handle the demands of various personality types. \n \nCore Competencies: \nAdvance computer literacy skills (Microsoft office suite); \nGood communication skills (written and verbal); \nGood presentation and facilitation skills; \nStakeholder engagement and strategic planning skills; and \nNegotiation skills. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1kMMbboMYRIa0hLq545lU2Aew554  \nAPPLY ONLINE VIA THIS LINK: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Sirelda de Klerk \nTel No: 011 407 7723 \nCLOSING DATE: WEDNESDAY, 18 OCTOBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation and \nEmployment record verification, \nCriminal check, and \nIdentity validation. \n \n \n \n \n ",
                " \n \n \n \nVACANCY CIRCULAR 072/2023 \n \nThis Vacancy is open to Employees of the City of Johannesburg and External Applicants \n \n CLOSING DATE: WEDNESDAY, 18 OCTOBER 2023\n \nWE HAVE AN EXCITING CAREER OPPORTUNITY FOR: \nPERMANENT POSITION: \nSHIFT SUPERVISOR \n \nAPPLICATION REQUIREMENTS \nComplete the online job application form and attach all relevant and updated documents (Certified Qualification/s/Certificates, ID, and CV). \nApplicants should take note that they can be required to provide proof of original documents during the selection process. \nYou will be requested to provide a brief description of your work experience relating to the vacancy. \nApplicants with membership to professional bodies need to provide a membership number and expiry date. \nIf you are an internal applicant, your employee number will be required. \nApplicants are advised to use Google Chrome when applying for CoJ positions. \n \nDISCLAIMER\nThe City of Johannesburg is currently recruiting and will not demand payment in any form for any job placement. All vacancies are advertised in newspapers and on the CoJ website. \nThe City of Johannesburg applies the principles of employment equity as per the National legislation and policy guidelines and will consider designated groups in line with these requirements. We are an equal-opportunity employer. \nBy submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. \nHowever, registering your CV and/or receipt and acknowledgment of any kind shall not be an indication that your application will be successful and/or lead to employment. \nThe City of Johannesburg shall not be liable for any damage, loss, or liability of whatsoever nature arising from your use of the job opportunity section of this website. \nThe City of Johannesburg reserves the right not to make an appointment. \nAny misrepresentation or failure to disclose material information on the application form or CV will automatically disqualify your application. \n \n \nSHIFT SUPERVISOR \nDepartment: Public Safety - JMPD \nBranch: Security Services \nDesignation: Shift Supervisor \nRemuneration: R10 468.65 pm (basic salary, excluding benefits) \nLocation: Metropolitan Centre, 158 Civic Boulevard, Braamfontein \n \nMinimum Requirements \nValid Senior Certificate (Grade 12 Certificate/NQF level 4); \nValid Grade B - A PSIRA accredited certificate. \nValid minimum Code B driver’s license; \nBe able to operate a motor vehicle of the class listed above; \n2 years relevant experience in the security environment; \nKnowledge of minimum Information Security Standards, Physical Security Standards and other relevant security directives legislation and regulations; \nSurveillance System Knowledge (control room operation and CCTV monitoring); \n \nPrimary Function:\nTo provide effective supervision of physical and operational security service at shift level in order to ensure the safety and security of employees, stakeholders/clients, assets, information and buildings/facilities. \n \nKey Performance Areas: \nUndertake the supervision of Security operation, guarding and patrolling services; \nPerforming supervision of all access points; \nSupervise Key control and locking security duties; \nManage the performance of the Security Officers in line with the conditions of Services; \nSupervise security control room operations; \nEngage with identified stakeholder in the area of operation or specialization; \nManage own assets and resources / materials tools /equipment in authority; \n \nLeading Competencies: \nComputer literacy MS Office (Word; Excel, PowerPoint etc.); \nGood Communication, interpersonal and report writing skills; \nGood planning, Organising and coordinating skills. \n \nCore Competencies: \nAbility to deal calm with emergency situations; \nCritical thinking and \nProblem solving; \nHigh level of Honest. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender, and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1JBfL16ueQ8KJghQq-XvUwQew554\nAPPLY ONLINE VIA THIS LINK: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Nadeem Scheepers \nTel No: 011 407 7097 \nCLOSING DATE: WEDNESDAY, 18 OCTOBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation and \nEmployment record verification, \nCriminal check, and \nIdentity validation. \n \n \n \n ",
                " \n \n \n \nVACANCY CIRCULAR 072/2023 \n \nThis Vacancy is open to Employees of the City of Johannesburg and External Applicants \n \n Closing Date: Wednesday, 18 October 2023 \n \nWE HAVE AN EXCITING CAREER OPPORTUNITY FOR: \nPERMANENT POSITION \nSub Unit Head: Social Benefits (Expanded Social Package, Social Work) \n \nAPPLICATION REQUIREMENTS \nComplete the online job application form and attach all relevant and updated documents (Certified Qualification/s/Certificates, ID, and CV). \nApplicants should take note that they can be required to provide proof of original documents during the selection process. \nYou will be requested to provide a brief description of your work experience relating to the vacancy. \nApplicants with membership to professional bodies need to provide a membership number and expiry date. \nIf you are an internal applicant, your employee number will be required. \nApplicants are advised to use Google Chrome when applying for CoJ positions. \n \nDISCLAIMER\nThe City of Johannesburg is currently recruiting and will not demand payment in any form for any job placement. All vacancies are advertised in newspapers and on the CoJ website. \nThe City of Johannesburg applies the principles of employment equity as per the National legislation and policy guidelines and will consider designated groups in line with these requirements. We are an equal opportunity employer. \nBy submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. \nHowever, registering your CV and/or receipt and acknowledgement of any kind shall not be an indication that your application will be successful and/or lead to employment. \nThe City of Johannesburg shall not be liable for any damage, loss or liability of whatsoever nature arising from your use of the job opportunity section of this website. \nThe City of Johannesburg reserves the right not to make an appointment. \nAny misrepresentation or failure to disclose material information on the application form or CV will automatically disqualify your application. \n \n \nSUB UNIT HEAD: SOCIAL BENEFITS (EXPANDED SOCIAL PACKAGE, SOCIAL WORK) PACKAGE SOCIAL WORK \nDepartment: Social Development \nBranch: Social Benefits Unit \nDesignation: Sub-Unit Head: Social Benefits (Expanded Social Package, Social Work) \nRemuneration: R57 490.39 pm (basic salary excluding benefits) \nLocation: 118 Jorissen Street, Braamfontein \n \nMinimum Requirements: \nGrade 12/NQF level 4 plus Degree in Social Work (NQF level 8); \nRegistration with South African Council for Social Service Professions. \n7 - 9 years’ experience working in Social Development field of which six (6) years must be on a management level; \nMust have a valid driver’s license and in possession of a roadworthy vehicle. \nKnowledge of scope of social work practice and associated protocols; \nKnowledge and application of relevant legislation guiding and impacting social work services; \nKnowledge of Local governments environment and regulatory framework; \nKnowledge of Municipal financial management, financial planning and reporting; \nKnowledge of local government performance management systems and reporting. \nValid code 8 driver’s license; and \nSkills required: report writing, ability to work independently, presentation and interpersonal skills. \n \nPrimary Function:\nLead, develop, direct, manage and oversee the implementation of Social Benefits Programmes Citywide. Provides integrated professional inputs and support, supervise, monitor, offers guidance and advise on the management of Social Development policies to ensure that all programmes adhere to legislative and policy framework as well as standards operating procedures aimed at improving access by the poor and vulnerable households to social support mechanisms and safety nets provided by the City. \n \nKey Performance Areas: \nProvide functional planning, support guidance and leadership on professional, social work services within the City; \nLead support and control the financial management, budgeting and forecasting; \nDevelop; support coordinate and enhance social work services and associated compliance matters in line with legislation, regulations, policies and or frameworks that guide scope of social work practice in the municipality; \nImprove, maintain and sustain service delivery and substance abuse care outcomes in terms of the strategic objectives within the City; \nPromote and facilitate social research and in house project establish service trends for analytic program remodelling and influence impactful programs with internal and external clients; \nConduct, coordinate and monitor Expanded Social Package Social Work continued professional development of social workers and training for personnel; \nLead; support, control and participate I the implementation of specific procedures, systems and control associated with a supportive and motivating climate for the incumbents; \nMultidisciplinary team engagement and collaboration for effective service delivery planning, resources mobilization, program implementation. \n \nLeading Competencies: \nLeadership;\nPeople Management; \nProject Management; \nFinancial Management; and \nChange Management. \n \nCore Competencies: \nComputer software application skills and data management; \nProfessional communication; \nAdvocacy and negotiation skills; \nRisk management Skills \nLeadership and people management; \nInter-personal and management skills; \nSocial or clinical research skills \nReport writing skills at senior Management level; \nFinancial Planning; \nHuman Resource Management skills. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1P9zTEjfORfGciIJreaToRAew554\nAPPLY ONLINE VIA: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Refilwe Mokgako \nTel No: 011 407 7472 \nCLOSING DATE: WEDNESDAY, 18 OCTOBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation and \nEmployment record verification, \nCriminal check, and \nIdentity validation. ",
                "VACANCY CIRCULAR 072/2023 \n \nThis Vacancy is open to Employees of the City of Johannesburg and External Applicants \n \nCLOSING DATE: WEDNESDAY, 18 OCTOBER 2023\n \n WE HAVE AN EXCITING CAREER OPPORTUNITY FOR: \n \nPERMANENT POSITION \nMANAGER: TARGETED BENEFICIARIES UNIT \n \nAPPLICATION REQUIREMENTS \nComplete the online job application form and attach all relevant and updated documents (Certified Qualification/s/Certificates, ID, and CV). \nApplicants should take note that they can be required to provide proof of original documents during the selection process. \nYou will be requested to provide a brief description of your work experience relating to the vacancy. \nApplicants with membership to professional bodies need to provide a membership number and expiry date. \nIf you are an internal applicant, your employee number will be required. \nApplicants are advised to use Google Chrome when applying for CoJ positions. \n \nDISCLAIMER\n• The City of Johannesburg is currently recruiting and will not demand payment in any form for any job placement. All vacancies are advertised in newspapers and on the CoJ website. \n• The City of Johannesburg applies the principles of employment equity as per the National legislation and policy guidelines and will consider designated groups in line with these requirements. We are an equal opportunity employer. \n\n• By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. \nHowever, registering your CV and/or receipt and acknowledgement of any kind shall not be an indication that your application will be successful and/or lead to employment. \nAny misrepresentation or failure to disclose material information on the application form or cv will automatically disqualify your application. \nThe City of Johannesburg shall not be liable for any damage, loss or liability of whatsoever nature arising from your use of the job opportunity section of this website.\n• The City of Johannesburg reserves the right not to make an appointment.\n \n \nMANAGER: TARGETED BENEFICIARIES UNIT \nDepartment: Social Development \nBranch: Targeted Beneficiaries Unit \nDesignation: Manager: Targeted Beneficiaries Unit \nRemuneration: R44 693.36 pm (basic salary, excluding benefits) \nLocation: 118 Jorissen Street, Traduna Building, Braamfontein \n \nMinimum Requirements: \nGrade 12 plus BA Degree in Social Sciences / Developmental Studies / Gender Studies (NQF level 7). \n5 – 7 years’ experience working with women and gender programmes of which 2 years should be in managerial position. \nUnderstanding of Social Development process and programmes, management, operation management, Council processes to do Council reports and procurement; \nKnowledge of Community Development and Project management processes. \nKnowledge of Performance Management \nKnowledge of Community Development and Project management processes; \nKnowledge of applicable legislation e.g., Older Persons Act Domestic Violence Act National Youth policy; \nMust have a valid driver’s license. \n \nPrimary Function: \nManage the implementation of programs for Youth, Persons with Disabilities, Ex Combatants, Women and Elderly as well as skills development. \n \nKey Performance Areas: \nProvide strategic support for effective and efficient implementation of development project in the regions targeting the vulnerable groups with special reference to Youth, Person with Disabilities, Ex-combatants, women empowerment/ Elderly and skills Development; \nImplementation and coordination of development programmes by facilitation the implementation of the City’s targeted groups policies; \nMonitoring and evaluation of development programmes by consolidating and analyzing the regional weekly, monthly, quarterly as well as annual reports; \nProductivity /Performance and Personnel management; \nTo forge partnership opportunities targeted group and attract resources both internally and externally; \n \nLeading Competencies: \nComputer literacy (Microsoft Word and Excel); \nGood communication; \nPresentation skills; \nNetworking skills; \nLeadership skills; \n \nCore Competencies: \nTeam player; \nAccountability;\nCollaborative/Teamwork, Values and Integrity, Attention to detail, and quality-focused; \nCustomer and Service Delivery Management (Batho Pele) Ethics, Professionalism; \nImpact and Influence according to City’s protocols, legislation, and standards. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1pt55FwmMRViLoXrY9nqeVwew554\nAPPLY ONLINE VIA: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Johannes Mofokeng \nTel No: 011 407 6736 \nCLOSING DATE: WEDNESDAY, 18 OCTOBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation and \nEmployment record verification, \nCriminal check, and \nIdentity validation."
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/city-of-joburg_orig.jpg",
            "Href": "https://www.govpage.co.za/city-of-johannesburg-metropolitan-municipality-vacancies-blog/city-of-johannesburg-vacancies-re-advertisement-of-short-term-contract-stc-circulars-o-0152023-o-0162023",
            "Title": "gov-page: CITY OF JOHANNESBURG VACANCIES (RE-ADVERTISEMENT OF SHORT-TERM CONTRACT (STC) CIRCULARS: • 015/2023 • 016/2023)",
            "Content": [
                "CITY OF JOHANNESBURG\n \nGroup Corporate & Shared Services: Group Human Capital Management\n6th Floor, B Block Metropolitan Centre, 158 Civic Boulevard, Braamfontein\nPO Box 1049 Johannesburg, South Africa, 2000\nTel +27(0) 11 407 6111 - Fax +27(0) 11 339 1878\nwww.joburg.org.za\n ",
                " \n \nRE-ADVERTISEMENT OF SHORT-TERM CONTRACT (STC) CIRCULARS: \n015/2023\n016/2023\n \nThe City of Johannesburg (CoJ) advertised positions on the above-mentioned STC circulars published on Jozinet, website and social media. Due to the network problems in the past two weeks, CoJ was not able to receive job application forms completed online and attachments of documents. Applicants were also unable to upload the required information as per the job advertisements. \n \nCoJ would like to extend the closing date of all the STC circulars affected. Applicants who applied previously are advised to re-apply. \n \nPLEASE NOTE THAT THE CLOSING DATE OF THE ABOVE CIRCULARS ARE EXTENDED TO19 OCTOBER 2023 \n \nApplicants are advised to use Google Chrome when applying for CoJ positions. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.”\n \nCLOSING DATE: THURSDAY, 19 OCTOBER 2023\n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation, \nEmployment record verification, \nCriminal check, and \nIdentity validation. \n \nThe inconvenience caused is regretted.\n \n \n \n ",
                " \n \n \n \nVACANCY BULLETIN: STC 016/2023 \n \nThis Vacancy is open to Employees of the City of Johannesburg and External Applicants \n \nCLOSING DATE: TUESDAY, 26 SEPTEMBER 2023\n \n WE HAVE EXCITING CAREER OPPORTUNITIES FOR: \nSHORT-TERM CONTRACT POSITIONS \nOFFICER ACCOUNTING PROCUREMENT \nADMIN OFFICER: LOGISTICS AND ADMINISTRATION \n \nAPPLICATION REQUIREMENTS \nComplete the online job application form and attach all relevant and updated documents (Certified Qualification/s/Certificates, ID, and CV). \nApplicants should take note that they can be required to provide proof of original documents during the selection process. \nYou will be requested to provide a brief description of your work experience relating to the vacancy. \nApplicants with membership to professional bodies need to provide a membership number and expiry date. \nIf you are an internal applicant, your employee number will be required. \nApplicants are advised to use Google Chrome when applying for CoJ positions. \n \nDISCLAIMER\nThe City of Johannesburg applies the principles of employment equity as per the National legislation and policy guidelines and will consider designated groups in line with these requirements. We are an equal opportunity employer. \nBy submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. \nHowever, registering your CV and/or receipt and acknowledgement of any kind shall not be an indication that your application will be successful and/or lead to employment. \nThe City of Johannesburg shall not be liable for any damage, loss or liability of whatsoever nature arising from your use of the job opportunity section of this website. \nThe City of Johannesburg reserves the right not to make an appointment. \nAny misrepresentation or failure to disclose material information on the application form or CV will automatically disqualify your application. \n \n \nOFFICER ACCOUNTING PROCUREMENT \nSHORT-TERM CONTRACT POSITION \n(Not exceeding 12 months) \nDepartment: Economic Development \nBranch: Economic Development SMS \nDesignation: Officer Accounting Procurement \nRemuneration: R17 314.75 pm (no benefit) \nLocation: 66 Jorissen Street, Jorissen Place, Braamfontein \n \nMinimum Requirements: \nGrade 12 / NQF level 4 or equivalent; \nNational Diploma in accounting or related field (NQF level 6); \n1 – 3 years’ experience in a financial environment with Supply Chain Management exposure; \nIn-depth understanding of documentation management; \n \nPrimary Function: \nProvide an efficient procurement (supply chain management) function within Economic to ensure that the requirement goods and service are sourced efficiently and in line with Supply Chain policies and procedures under the guidance of the line manager. \n \nKey Performance Areas: \nProcess purchase requisitions inline with the Group strategic Supply Chain Management (GSSCM) policy and procedures when requests are made and when invoices are received; \nProcess purchase orders in line with the GSSCM policies and procedures; \nProcess stock order requests in line with GSSCM policies and procedures when stock is required in the Economic Development; \nCompile, record, consolidate and submit various procurement related reports; \nProvide administrative and support assistance in the finance section; \nRepresent the fiancé section in various finance forums and structures where procurement issues are discussed \n \nLeading Competencies: \nExcellent Computer Literacy – Microsoft Excel, Microsoft Word, SAP and any other Accounting package; \nExcellent Good communication (verbal and written) skills; \nExcellent planning, Organising and Time management skills) \n \nCore Competencies: \nAccountability\nConfidentiality\nTeam Player \nAttention to detail and diligence. \nBatho Pele Principle Ethics. \nProfessionalism.\n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1aoi_5oufTQCA1-4xaqfvMQew554\nAPPLY ONLINE VIA: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Thembelihle Nogemane \nTel No: 011 061 3193 \nCLOSING DATE: TUESDAY, 26 SEPTEMBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record. \nCV validation. \nEmployment record verification. \nCriminal check. \nIdentity validation. \n \n \n \nADMIN OFFICER: LOGISTICS AND ADMINISTRATION \nSHORT-TERM CONTRACT POSITION \n(Not exceeding 12 months) \nDepartment: Economic Development \nBranch: Finance \nDesignation: Admin Officer: Logistics and Administration \nRemuneration: R17 314.75 pm (no benefit) \nLocation: 66 Jorissen Street, Jorissen Place, Braamfontein \n \nMinimum Requirements: \nGrade 12 / NQF level 4 or equivalent; \nTertiary qualification on Logistics, Administration and Supply Chain Management \n1 – 3 years’ experience in Office Administration \nBasic knowledge of Logistics and Administration. \n \nPrimary Function: \nThe provision of an effective administration and Auxiliary Services including (Procurement: capturing of stock orders of goods and services, stationery, refreshment) overseeing of cellphone contract, building and maintenance, overseeing office machines, management of Health and safety. \n \nKey Performance Areas: \nTo ensure effective management of Administration & logistics; \nManagement of Office machines; \nManagement of cellphone contract; \nFacilities management; \n \nLeading Competencies: \nExcellent Computer Literacy – Microsoft Excel, Microsoft Word, SAP and any other Accounting package; \nExcellent Good communication (verbal and written) skills; \nExcellent planning, Organising and Time management skills) \n \nCore Competencies: \nAccountability\nConfidentiality\nTeam Player \nAttention to detail and diligence. \nBatho Pele Principle Ethics. \nProfessionalism.\n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1RVy-JMJVSJSj39kCx1QENwew554\nAPPLY ONLINE VIA: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Thembelihle Nogemane \nTel No: 011 061 3193 \nCLOSING DATE: TUESDAY, 26 SEPTEMBER 2023\n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record. \nCV validation. \nEmployment record verification. \nCriminal check. \nIdentity validation.",
                "VACANCY BULLETIN: STC 015/2023\n \nThis Vacancy is open to Employees of the City of Johannesburg and External Applicants \n \nCLOSING DATE: TUESDAY, 19 SEPTEMBER 2023 \n \nWE HAVE EXCITING CAREER OPPORTUNITIES FOR: \nSHORT-TERM CONTRACT POSITIONS \n• DRIVER \n• OFFICER: ASSETS MANAGEMENT \n \nAPPLICATION REQUIREMENTS \n• Complete the online job application form and attach all relevant and updated documents (Certified Qualification/s/Certificates, ID, and CV). \n• Applicants should take note that they can be required to provide proof of original documents during the selection process. \n• You will be requested to provide a brief description of your work experience relating to the vacancy. \n• Applicants with membership to professional bodies need to provide a membership number and expiry date. \n• If you are an internal applicant, your employee number will be required. \n• Applicants are advised to use Google Chrome when applying for CoJ positions. \n \nDISCLAIMER\n• The City of Johannesburg applies the principles of employment equity as per the National legislation and policy guidelines and will consider designated groups in line with these requirements. We are an equal opportunity employer. \n• By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. \n• However, registering your CV and/or receipt and acknowledgement of any kind shall not be an indication that your application will be successful and/or lead to employment. \n• The City of Johannesburg shall not be liable for any damage, loss or liability of whatsoever nature arising from your use of the job opportunity section of this website. \n• The City of Johannesburg reserves the right not to make an appointment. \n• Any misrepresentation or failure to disclose material information on the application form or CV will automatically disqualify your application. \n \n \nDRIVER\nSHORT-TERM CONTRACT POSITION \n(Not exceeding 12 months) \nDepartment: Economic Development \nBranch: Economic Development SEF \nDesignation: Driver \nRemuneration: R16 427.66 pm (no benefit) \nLocation: 66 Jorissen Street, Jorissen Place, Braamfontein \n \nMinimum Requirements: \n• Grade 12 / NQF level 4 or equivalent; \n• Valid Code EC/EC1 (Code 14) driver’s license; \n• 2 years’ experience operating and maintaining large vehicle plus 1 years’ experience in administrative work environment, dealing with administrative duties and record keeping and asset inventory plus; \n• Knowledge of the City process best practices and policies and procedures on accurate and detailed completion of logbook, trip authorities and any administrative duties associated duties associated with driving; \n• Knowledge of relevant geographical area of the work site and road signs as they relate to the driving practice and processes. \n \nPrimary Function: \nInvolves driving one of the City of Joburg Mobile Bus to Various community outreaches or events and performing variety of administrative support duties as assigned during hours. \nN.B the Mobile unit driver may perform the acts described below only under direct personal supervision of the Opportunity Centre Manager. \n \nKey Performance Areas: \n• Conducts safe driving of the Mobile Bus unit to and from various locations; \n• Coordinate maintenance of the Mobile to endure that all maintenance schedule is timely; \n\n• Plans, organize and monitor administrative systems in place; \n \nLeading Competencies: \n• Computer Literacy – MS Applications; \n• Administrative skills; \n• Coordination and facilitation skills; \n• Good communication skills; \n• Interpersonal relation skills; \n• Time management skills. \n \nCore Competencies: \n• Attention to detail and diligence. \n• Batho Pele Principle Ethics. \n• Professionalism. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1Vj12-G9lRTCTdjkPsVqlFwew554\nAPPLY ONLINE VIA: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Thembelihle Nogemane \nTel No: 011 061 3193 \nCLOSING DATE: TUESDAY, 19 SEPTEMBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \n• Credit Record. \n• CV validation. \n• Employment record verification. \n• Criminal check. \n• Identity validation. \n \n \n \nOFFICER: ASSET MANAGEMENT \nSHORT-TERM CONTRACT POSITION \n(Not exceeding 12 months) \nDepartment: Economic Development \nBranch: Finance \nDesignation: Officer: Assets Management \nRemuneration: R 17 314.75 pm (no benefit) \nLocation: 66 Jorissen Street, Jorissen Place, Braamfontein\n \nMinimum Requirements: \n• Grade 12 / NQF level 4 or equivalent; \n• National Diploma in accounting or related field (NQF level 6); / minimum of Higher Certificate (NQF level 5) Finance \n• 1 – 3 years’ experience in the field of Asset Management’ \n• Knowledge of MFMA requirements related to Assets management; \n• Basic knowledge of Business management / Economics concept and functions; \n• Knowledge of Business management and Economic Development Training processes; \n• SAP R3 (Asset General Ledger and budget module) with be an added advantage; \n• Must have a valid driver’s license. \n \nPrimary Function: \nAssist the Manager Assets & Insurance with the operational; and administrative tasks pertaining to assets and insurance functions, so that the directorates run efficiently and effectively and to ensure that the economic development conforms to the requirements of Council policies and procedures and relevant financial legislation (i.e MFMA and GRAP). \n \nKey Performance Areas: \n• Assist regions and core functions on asset management policy and business process; \n• Maintains the computerized Asset Register n accordance to the laid down procedures; \n• Extracting the Asset history sheet monthly just before depreciation run; \n• Redundant and obsolete movable assets due various economic factors are scrapped as per the prescribed control procedures; \n• Ensure that additions to the asset register are performed as per prescribed business process and control procedures; \n• Ensure that movable assets are moved from one location to the other in a manner that complies to the business process; \n• Render support and assistance various stakeholder requesting Assist management Information; \n• Finalize the asset management functions as required in the year-end guidelines;\n• Perform specific sequences related maintaining electronically based information, data and files and records; \n \nLeading Competencies: \n• Computer Literacy – MS Applications; \n• Good communication skills; \n• Time management skills. \n \nCore Competencies: \n• Team Player \n• Attention to detail and diligence. \n• Batho Pele Principle Ethics. \n• Professionalism. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1xsPEJsjNRdqtRm7CT_4Nrgew554\nAPPLY ONLINE VIA: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Thembelihle Nogemane \nTel No: 011 061 3193 \nCLOSING DATE: TUESDAY, 19 SEPTEMBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \n• Credit Record. \n• CV validation. \n• Employment record verification. \n• Criminal check. \n• Identity validation."
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/ethekwini-logo.jpg?1696896801",
            "Href": "https://www.govpage.co.za/ethekwini-metropolitan-municipality-vacancies-blog/ethekwini-metro-vacancies6669982",
            "Title": "gov-page: ETHEKWINI METRO VACANCIES",
            "Content": [
                " \nETHEKWINI METRO\n \nVACANCY CIRCULAR NUMBER: 558\n ",
                " \nApplications are invited from suitably qualified persons for the vacancies advertised here Applicants who have not been contacted within three months from the closing date should consider themselves unsuccessful.\nAn employee may be deployed to any of the office, depot or workplaces of the Municipality within its area of jurisdiction. Canvassing councillors or officials in respect of these positions will lead to disqualification of the applicants. Applicants may be required to participate in a comprehensive assessment process and must be deemed competent. Work sample and / or psychometrics test’s may be undertaken as part of the selection process. You shall be required to undergo a pre-engagement medical examination to be conducted by a medical officer in the employ of the Municipality.\n \nPlease note Online applicants can direct their queries to the HC Systems Branch helpdesk on 031 322 6050.\nIncomplete applications will not be considered.\n \nTo apply, visit www.durban.gov.za and follow the E-Recruitment link Please Note: To Apply for Vacancies from Grade 10 and above, Go to (Internal) https://durbangov.internal.erecruit.co/ or (External) https://durbangov.erecruit.co/ and click on the link – closing date is Friday, 20/10/2023 at 12:00 (Midday).\n \nFOR VACANCIES FROM GRADE 9 AND BELOW, Applications must be lodged to the following: Hambanathi HC computer Lab: 25 Jiyani Road, Tongaat. Hammersdale HC computer Lab: G7 Shezi Main Road. Clermont HC computer Lab: 1106 Zazi Road, Archie Gumede. KwaDabeka HC Computer Lab: 101 Spinal Road, KwaDabeka. SEDA HC Computer Lab: 127 Johannes Nkosi, Durban: uMnini HC computer Lab: R102 Daganyana Reserves, Umgababa. Pinetown HC computer Lab: 7 Miller Road, Pinetown. Bester Library HC computer Lab: 1826F Ntuzuma Road, Emzomusha, KwaMashu, 4068. Nagina Sizakala HC Computer Lab: 3 Nagina Dr, Mariannhill, Durban, 3604. Mid Way Mall HC computer Lab: A225 Zavala Road, Ntuzuma A, Ntuzuma. Verulam HC computer Lab: 151 Wick Street, Verulam, eThekwini, 4340. KwaMnyandu Sizakala Centre: 341 Griffiths Mxenge Hwy, Umlazi D, Umlazi, 4031. KwaXimba Sizakala Centre: Magayisa, Main Road, KwaXimba, Ximba, 3681. Illovu Sizakala Centre: Lot 10994, 10451 Joe Mnguni Street, Illovu. 16 Maphephetweni Sizakala Centre: Emlanjweni, KwaMashu, 4359. Fredville/Inchanga Sizakala Centre: Michael Gwala Community Centre, Fredville, Cato Ridge, 3700. Umbumbulu Sizakala Centre: 300009 Street, Nsimbini Reserve, Umbumbulu, 40105. Mega City Sizakala Centre: 50 Griffiths Mxenge Hwy, Umlazi V, Umlazi 4060. Magabheni Sizakala Centre: eThekwini Ikhwezi Area, Sidiwya Hwy, Umkomaas, 4170. Lamontville HC Computer Lab: Off Wiggins Road, Lamontville, Durban, 4027. Molweni Sizakala Centre: 415 Inanda Road, Molweni, Durban, 3652. Chesterville Sizakala Centre: 80 Mahlathi Road, Chesterville, Durban, 4091. Sankontshe Sizakala Centre: Sankontshe, Ilanga, 3700. Tongaat HC Computer Lab: 325 Gopalall Hurbans Road, Tongaat, eThekwini, 4400. Main/ Head Office HC computer Lab: 21 Archie Gumede Place, Durban, 4001 or (Telephone Enquires 031 311 3103). or go to (Internal) https://durbangov.internal.erecruit.co/ or (External) https://durbangov.erecruit.co/ and click on the link – closing date is Friday, 20/10/2023 at 12:00 (Midday).\n \nPlease note that Municipality vacancies are NOT FOR SALE!\n \nEThekwini Municipality is guided by the principles of Employment Equity. Women and people with disabilities are encouraged to apply.\n \n ",
                " \n \n \n \nCATALYTIC PROJECT UNIT\n \nPROGRAMME MANAGER\nREF NO: 26000010 / 26000034/ 26000030/ 26000036/ 26000038\nTotal Value of Remuneration Package: R1 133 379.00 / R1 445 084.00 pa\nGrade: 16\n \nJob Purpose: To provide capacity and support to Senior Programme Managers in driving and rolling-out a series of Catalytic Projects within the City regions as part of the spatial transformation agenda informed by various national, provincial, and municipal strategic plans and priorities.\n \nCompetencies: •Socio-Economic / Socio-Political Awareness- The ability to be aware of, and take into account contextual, political, public interest and administration service and development issues and concerns, programs, policies and decisions in the understanding, preparation of and recommendations on information results, outcomes and products. •Planning and Organising- The ability to plan and organise work tasks using goal setting, objectives, targets, creating work schedules and work plans with associated resources and budgets, according to the Municipality’s procedures in order to achieve the tasks, functions, and outcomes / results. •Strategic Planning and Strategy Formulation- Ability to understand the process of strategic planning and contribute effectively to strategy formulation. •Programme and Project Management- Plans, manages, monitors, and evaluates specific activities in order to deliver the desired outputs and outcomes. •Financial Management- Maximises the municipality’s business senses and displays a sound business understanding in applying the most effective management practices to achieve municipal financing goals and objectives. •Information Products and Reporting- The ability to prepare user friendly, customer orientated and accessible information products and reports of a range of types and formats. •Resilience- Continuing to perform effectively when faced with time pressures, adversity, disappointment, or opposition. •Interpersonal Relationships- The ability to establish and maintain productive relationships with people within and outside of the Municipality. •Communication- The capacity to listen attentively, grasp issues, present information in a clear manner and respond appropriately to verbal and written communication of others. •Action Orientation- The display of high work ethic in setting and achieving challenging goals, meeting deadlines, and keeping promises. It manifests itself in one’s ability to stay focused on task, to be energetic, persistent, and reliable. •Accountability and Ethical Conduct- Ability to display and build the highest standards of ethical and moral conduct in order to promote confidence and trust in the public service and to adhere to codes of good corporate governance. •Team Orientation- The capacity to promote a cooperative climate, understand group dynamics and apply appropriate facilitation techniques in working with others to achieve a shared goal.\n \nEssential Requirements: •Bachelor’s Degree (NQF Level 7) in one of the following disciplines: Architecture or Engineering or Town Planning or Property Development or Project and Construction Management or Quantity Surveying or Local Economic Development or Geographic Information Systems or Transport Management or equivalent. •Professional Registration with the relevant Professional Body in any of the above disciplines where applicable. •Valid motor vehicle driving license. •4 Years relevant experience. •Computer Literacy.\n \n \n \n \n \n \nHUMAN CAPITAL UNIT\n \nMANAGER (HC METRICS)\nREF NO: 61001052\nTotal Value of Remuneration Package: R849 196.00 / R1 077 649.00 pa\nGrade: 15\n \nJob Purpose: To conceptualise, plan, develop and implement human capital projects; to develop human capital policies in relation to projects undertaken and facilitate specific training and development programmes and initiatives.\n \nCompetencies: •Organisational Awareness - The ability to understand the key drivers in the sector and the municipality and to apply this understanding to meet the service delivery objectives and challenges. •Consulting - The ability to understand stakeholder needs and dynamics and to build capacity within the target audience through the ability to listen attentively, grasp issues, present information in a clear manner and respond appropriately to verbal and written communication of others. •Planning and Organising - The ability to plan and organise the work unit using goal setting, objectives, targets, creating work schedules and work plans with associated resources and budgets, according to the municipality’s procedures in order to achieve the tasks, functions, results of the work unit. •Monitoring and Control - The ability to monitor the results of delegations, assignments, or projects, considering the skills, knowledge, and experience of the assigned individual and the characteristics of the assignment or project. •Change Management - The ability to facilitate changes in technology, human behaviour and processes with minimal cost and disruption to the department, in a manner that enhances and ensures achievement of departmental objectives. •HC Technology / Information Management - The effective utilisation of technological applications and platforms that makes information both accessible and accurate, providing HC and line management with the knowledge and intelligence required for more effective decision making. •HC Service Delivery – The adequate provision of HC Services meeting the needs of the organization and its employees which enables delivery of organizational goals and targets. •Financial Management – Maximises the municipalities’ business sense and displays a sound business understanding in applying the most effective management practices to achieve municipal and project / programme financing goals and objectives. •Direction Setting - The ability to create a clear sense of common purpose and vision for others with a view to obtaining buy-in and commitment to the goals. •Problem Solving - The ability to gather information, analyse issues and deal with complexity and ambiguity. Shows long-term thinking, follows through in a logical manner, aware of consequences and implications. Is able to see the ‘Bigger Picture’. •Client Orientation and Customer Focus - Understands the service needs of a client/customer (internal or external) and actively focuses on anticipating, meeting, and exceeding the needs in a timely and appropriate manner. •Impact and Influence - The ability to inspire a positive attitude in others and be able to influence others effectively.\n \nEssential Requirements: •Diploma (NQF Level 6) in one of the following: Human Resource Management or Public Management or Business Management or related and equivalent qualification. •Project Management certificate or obtainable within 6 months from date of appointment. •Valid motor vehicle driving license. •4 Years relevant experience.\n \n \n \n \n \n \nOCCUPATIONAL ASSESSMENT OFFICER -INDUSTRIAL/ ORGANISATIONAL PSYCHOLOGIST - SENIOR INDUSTRIAL/ ORGANISATIONAL PSYCHOLOGIST\nREF NO: 61000034 / 61000034B / 61000034C\nTotal Value of Remuneration Package: \nR600 591.00 / R756 880.00 pa Grade: 12 \nR747 543.00 / R945 680.00 pa Grade: 14\nR849 196.00 / R1 077 649.00 pa Grade: 15\n \nOCCUPATIONAL ASSESSMENT OFFICER:\nGrade: 12\n \nJob Purpose: To apply the principles of psychology in the administration, scoring, interpretation and reporting of occupational assessment outcomes in order to provide recommendations regarding the assessed individual/s.\n \nCompetencies: •Organisational Awareness - The ability to understand the key drivers in the sector and the municipality and to apply this understanding to meet the service delivery objectives and challenges. •Consulting - The ability to understand stakeholder needs and dynamics and to build capacity within the target audience through the ability to listen attentively, grasp issues, present information in a clear manner and respond appropriately to verbal and written communication of others. •Planning and Organising - The ability to plan and organise the work unit using goal setting, objectives, targets, creating work schedules and work plans with associated resources and budgets, according to the municipality’s procedures in order to achieve the tasks, functions, results of the work unit. •Oral Communication - The ability to articulate complex concepts in an understandable, convincing manner. •Written Communication - Communication of complex information in a manner that is understandable (language and format) to the specific audience. •Change Management - The ability to facilitate changes in technology, human behaviour and processes with minimal cost and disruption to the department, in a manner that enhances and ensures achievement of departmental objectives. •HC Technology / Information Management - The effective utilisation of technological applications and platforms that makes information both accessible and accurate, providing HC and line management with the knowledge and intelligence required for more effective decision making. •HC Service Delivery – The adequate provision of HC Services meeting the needs of the organization and its employees which enables delivery of organizational goals and targets. •Talent Management - The proactive design and implementation of a talent-driven business strategy directed to attracting, deploying, developing, retaining, and optimising the appropriate talent requirements as identified in the HC Plan and Staffing Strategy of departments. •Interpersonal Relationships - The ability to establish and maintain productive relationships with people within and outside of the Municipality. •Action and Outcome Orientation – The display of high work ethic in setting and achieving challenging goals, meeting deadlines, and keeping promises. It manifests itself in one’s ability to stay focused on task, to be energetic, persistent, and reliable. •Accountability and Ethical Conduct – Ability to display and build the highest standards of ethical and moral conduct in order to promote confidence and trust in the public service and to adhere to codes of good corporate governance.\n \nEssential Requirements: •BPsych Industrial Psychology (Honours) (NQF Level 8). •Registration with the Health Professional Council of South Africa (HPCSA). •Valid motor vehicle driving license. •1 Year relevant experience\n \n \n \nINDUSTRIAL/ ORGANISATIONAL PSYCHOLOGIST:\nGrade: 14\n \nJob Purpose: To analyse, measure, diagnose, intervene, monitor, evaluate and provide feedback and recommendations to relevant stakeholders City-wide on Industrial/Organisational Psychology interventions and projects at an individual, group, and organisational level in an effective and efficient manner through undertaking coaching and mentoring suitably qualified individuals requesting exposure in the Branch with regards to conducting either qualitative or quantitative research.\n \nCompetencies: •Organisational Awareness - The ability to understand the key drivers in the sector and the municipality and to apply this understanding to meet the service delivery objectives and challenges. •Consulting - The ability to understand stakeholder needs and dynamics and to build capacity within the target audience through the ability to listen attentively, grasp issues, present information in a clear manner and respond appropriately to verbal and written communication of others. •Planning and Organising - The ability to plan and organise the work unit using goal setting, objectives, targets, creating work schedules and work plans with associated resources and budgets, according to the municipality’s procedures in order to achieve the tasks, functions, results of the work unit. •Oral Communication - The ability to articulate complex concepts in an understandable, convincing manner. •Written Communication - Communication of complex information in a manner that is understandable (language and format) to the specific audience. •Change Management - The ability to facilitate changes in technology, human behaviour and processes with minimal cost and disruption to the department, in a manner that enhances and ensures achievement of departmental objectives. •HC Technology / Information Management - The effective utilisation of technological applications and platforms that makes information both accessible and accurate, providing HC and line management with the knowledge and intelligence required for more effective decision making. •HC Service Delivery – The adequate provision of HC Services meeting the needs of the organization and its employees which enables delivery of organizational goals and targets. •Talent Management - The proactive design and implementation of a talent-driven business strategy directed to attracting, deploying, developing, retaining, and optimising the appropriate talent requirements as identified in the HC Plan and Staffing Strategy of departments. •Interpersonal Relationships - The ability to establish and maintain productive relationships with people within and outside of the Municipality. •Action and Outcome Orientation – The display of high work ethic in setting and achieving challenging goals, meeting deadlines, and keeping promises. It manifests itself in one’s ability to stay focused on task, to be energetic, persistent, and reliable. •Accountability and Ethical Conduct – Ability to display and build the highest standards of ethical and moral conduct in order to promote confidence and trust in the public service and to adhere to codes of good corporate governance.\n \nEssential Requirements: •Master’s Degree in Industrial/Organisational Psychology (NQF Level 9). •Registration with the Health Professional Council of South Africa (HPCSA). •Valid motor vehicle driving license. •2 Years relevant experience in Industrial/Organisational Psychology.\n \nSpecial Conditions: Maintenance of current registration as an intern Industrial/Organisational Psychologist with the HPCSA. May be required to work outside of normal working hours as and when required in order to meet the exigencies of the service.",
                "SENIOR INDUSTRIAL/ORGANISATIONAL PSYCHOLOGIST:\nGrade: 15\n \nJob Purpose: To analyse, measure, diagnose, intervene, monitor, evaluate and provide feedback and recommendations to relevant stakeholders City-wide especially to Executive Management on occupational assessments and complex Industrial/Organisational Psychology interventions, projects and programmes for eThekwini at an individual, group and organisational level in an effective and efficient manner through undertaking and supervising registered Psychology practitioners in the field of Industrial/Organisational Psychology with respect to conducting mixed method research.\n \nCompetencies: •Organisational Awareness - The ability to understand the key drivers in the sector and the municipality and to apply this understanding to meet the service delivery objectives and challenges. •Consulting - The ability to understand stakeholder needs and dynamics and to build capacity within the target audience through the ability to listen attentively, grasp issues, present information in a clear manner and respond appropriately to verbal and written communication of others. •Planning and Organising - The ability to plan and organise the work unit using goal setting, objectives, targets, creating work schedules and work plans with associated resources and budgets, according to the municipality’s procedures in order to achieve the tasks, functions, results of the work unit. •Oral Communication - The ability to articulate complex concepts in an understandable, convincing manner. •Language Communication - Communication of complex information in a manner that is understandable (language and format) to the specific audience. •Change Management - The ability to facilitate changes in technology, human behaviour and processes with minimal cost and disruption to the department, in a manner that enhances and ensures achievement of departmental objectives. •HC Technology / Information Management - The effective utilisation of technological applications and platforms that makes information both accessible and accurate, providing HC and line management with the knowledge and intelligence required for more effective decision making. •HC Service Delivery – The adequate provision of HC Services meeting the needs of the organization and its employees which enables delivery of organizational goals and targets. •Strategic HC Management – The systematic approach to developing and implementing long term HCM strategies, policies and plans that enable the organization to achieve its objectives. •Interpersonal Relationships - The ability to establish and maintain productive relationships with people within and outside of the Municipality. •Action and Outcome Orientation - The display of high work ethic in setting and achieving challenging goals, meeting deadlines, and keeping promises. It manifests itself in one’s ability to stay focused on task, to be energetic, persistent, and reliable. •Accountability and Ethical Conduct – Ability to display and build the highest standards of ethical and moral conduct in order to promote confidence and trust in the public service and to adhere to codes of good corporate governance.\n \nEssential Requirements: •Master’s Degree in Industrial/Organisational Psychologist (NQF Level 9). •Registration with the Health Professional Council of South Africa (HPCSA) as an Industrial/Organisational Psychologist. •Valid motor vehicle driving license. •4 Years relevant experience in Industrial/Organisational Psychology.\n\n \nSpecial Conditions: •Maintenance of current registration as an intern Industrial/Organisational Psychologist with the HPCSA. •May be required to work outside of normal working hours as and when required in order to meet the exigencies of the service.\n \n \n \n \n \n \nPARKS RECREATION AND CULTURE UNIT\n \nMANAGER (INTEGRATED DEVELOPMENT PLAN)\nREF NO: 44002254\nTotal Value of Remuneration Package: R747 543.00 / R945 680.00 pa\nGrade: 14\n \nJob Purpose: To design and implement interventions which align employees with the strategy of the Municipality, and which facilitate communication between the Unit and its stakeholders in order to deliver services in accordance with the intent of the legislation, and the goals and objectives of Council.\n \nCompetencies: •Organisational Awareness/Political Impact- Drives equitable service delivery considering how political and service issues, programmes, policies, and decisions impact public interest/concerns. •Monitoring and reporting- The ability to monitor the results of delegations, assignments, or projects, considering the skills, knowledge, and experience of the assigned individual and the characteristics of the assignment or project. •Project Management- Plans, manages, monitors, and evaluates specific activities to deliver the desired outputs and outcomes. •Information Management- The ability to prepare user friendly, customer orientated and accessible information products and reports of a range of types and formats. •Service Delivery Orientation- The ability to explore and implement new ways of delivering services that contribute to the improvement of municipal processes in order to achieve municipal goals. •Interpersonal Relationships- The ability to establish and maintain productive relationships with people within and outside of the Municipality. •Client Orientation and Customer Focus- Understands the service needs of a client/customer (internal or external) and actively focuses on anticipating, meeting, and exceeding the needs in a timely and appropriate manner. •Communication - The capacity to listen attentively, grasp issues, present information in a clear manner and respond appropriately to verbal and written communication of others. •Change Readiness- The ability to innovate and challenge the status quo and the ability to cope with change driven by others. •Problem Solving- The ability to gather information, analyse issues and deal with complexity and ambiguity. Shows long-term thinking, follows through in a logical manner, aware of consequences and implications. Is able to see the ‘Bigger Picture’. •Strategic Capability and Leadership- Contributes to determining and articulating the vision, sets the direction for the municipality and/or unit and inspires others to deliver on the municipal mandate. •Coaching and Mentoring- The ability to assess skills, performance, and potential of subordinates and to encourage their development with the view of optimising their talent and potential.\n \nEssential Requirements: •Tertiary qualification (NQF level 6) in Public Administration field or equivalent. •Valid motor vehicle driving license. •4 Years relevant experience.\n \nSpecial Conditions: Must be willing to work outside of normal office hours (nights and weekends), as required.\n \n \n \n \n \n \nPOOL SUPERVISOR (SEASONAL)\nREF NO: 99950128 / VARIOUS\nBasic Salary: R264 549.62 / R343 387.13pa\nGrade: 09\n \nJob Purpose: To provide aquatic safety services and total supervision of the maintenance and development services rendered to all municipal swimming pool facilities and surrounding recreation, leisure facilities within the eThekwini Municipal Area.\n \nEssential Requirements: •An appropriate level of secondary education. •Valid Pool Lifeguard Award Certificate or equivalent. •Valid First Aid Certificate. •2 Years relevant experience in the supervision of staff, able to operate a filtration plant in municipal facilities.\n \nSpecial Conditions: Required to undertake skills and fitness tests and training. Required to wear prescribed uniforms whilst on duty. All Supervisor posts within the department are interchangeable. May be required to work irregular hours and/or overtime. \n \nPhysical Requirements: Must be able to perform all physical requirements of the post. Required to pass departmental fitness test as and when required.\n \n \n \n \n \n \nMOSES MABHIDA STADIUM UNIT\n \nSUPERVISOR (CLEANING & HYGIENE)\nREF NO: 45000268\nBasic Salary: R297 857.87 / R386 635.32 pa\nGrade: 10\n \nJob Purpose: Responsible for coordinating overall hygiene including effective deep cleaning and pest control in line with the environmental, quality and health and safety standards, supervising the cleaning contractor by ensuring that the carry out their duties as per the agreed SLA.\n \nCompetencies: •Attention to Detail- Ability to scrutinise own work and that of others to ensure accuracy and compliance with the relevant municipal standards. •Ethics and Professionalism- The ability to identify and deal with ethical issues and conflicts of interest. •Organisational Awareness- The ability to understand the Municipality’s objectives, and the impact of decisions on the community and the functioning of the department. •Problem Solving- The ability to identify potential problem areas, to break the problem into component parts, generates potential solutions, select an option, and implement it. •Planning and Organising- The ability to plan activities within specific timeframes and then to execute these activities according to plan. •Data Processing & Analysis- Ability to process data and bring out about improvements in the way in which it is processed. •Interpersonal Relationships- The ability to establish and maintain productive relationships with people within and outside of the Municipality. •Communication- The capacity to listen attentively, grasp issues, present information in a clear manner and respond appropriately to verbal and written communication of others. •Action Orientation- The display of high work ethic in setting and achieving challenging goals, meeting deadlines, and keeping promises. It manifests itself in one’s ability to stay focused on tasks, to be energetic, persistent, and reliable. •Cognitive ability- The ability to gather information, analyse issues and deal with complexity and ambiguity. Shows long-term thinking, follows through in a logical manner, aware of consequences and implications. Is able to see the ‘Bigger Picture’. •Direction Setting- The ability to create a clear sense of common purpose and vision for others with a view to obtaining buy-in and commitment to the goals. •Team Orientation- The capacity to promote a cooperative climate, understand group dynamics and apply appropriate facilitation techniques in working with others to achieve a shared goal.\n \nEssential Requirements: •Grade 12 (NQF Level 4) and an Administrative Certificate. •Valid motor vehicle driving license. •3 Years relevant experience.\n \nPhysical Requirements: Good Health.\n \n \n \n \n \n \nSIZAKALA CUSTOMER SERVICE UNIT\n \nPRINCIPAL CLERK\nREF NO: 53000176\nBasic Salary: R208 686.56 / R270 896.51 pa\nGrade: 07\n \nJob Purpose: To provide customer and related services in accordance with the principles of Batho Pele and the unit’s vision to the eThekwini Municipality customers.\n \nCompetencies: •Attention to Detail – Ability to scrutinise own work and that of others to ensure accuracy and compliance with the relevant municipal standards. •Ethics and Professionalism - The ability to identify and deal with ethical issues and conflicts of interest. •Organisational Awareness - The ability to understand the Municipality’s objectives, and the impact of decisions on the community and the functioning of the department. • Planning and Organising – The ability to plan activities within specific timeframes and then to execute these activities according to the plan. •Business Processes - Ability to engage with systems or component processes and make continuous improvements. •Use of Technology – The ability to utilise technology in the workplace to optimise functioning of the Municipality. •Interpersonal Relationships - The ability to establish and maintain productive relationships with people within and outside of the Municipality. •Communication – The capacity to listen attentively, grasp issues, present information in a clear manner and respond appropriately to verbal and written communication of others. •Client Orientation and Customer Focus - Understands the service needs of a client/customer (internal or external) and actively focuses on anticipating, meeting, and exceeding the needs in a timely and appropriate manner. •Action Orientation - The display of high work ethic in setting and achieving challenging goals, meeting deadlines, and keeping promises. It manifests itself in one’s ability to stay focused on task, to be energetic, persistent, and reliable. •Resilience - The ability to respond constructively to pressure/stress situations and the ability to persist with goals despite obstacles and setbacks. •Change Readiness - The ability to innovate and challenge the status quo and the ability to cope with change driven by others.\n \nEssential Requirements: •Grade 12 (NQF Level 4) or equivalent. • 3 years relevant experience. •Computer Literacy.\n \nSpecial Conditions: Posts of Principal Clerk are interchangeable within the department at the discretion of the Head.\n \nPhysical Requirements: Must be physically capable of carrying out the duties of the post."
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/ethekwini-logo.jpg?1696897116",
            "Href": "https://www.govpage.co.za/ethekwini-metropolitan-municipality-vacancies-blog/ethekwini-metro-youth-drivers-licence-programme",
            "Title": "gov-page: ETHEKWINI METRO YOUTH DRIVER’S LICENCE PROGRAMME",
            "Content": [
                " \nETHEKWINI METRO\n \nMAYORAL YOUTH DEVELOPMENT OFFICE\n \nYOUTH DRIVER’S LICENCE PROGRAMME\n \nETHEKWINI MUNICIPALITY INVITES APPLICATIONS FROM UNEMPLOYED YOUTH BETWEEN THE AGES OF 18-35 WITH NO LEARNERS AND DRIVER’S LICENSES TO PARTICIPATE IN A SKILLS PROGRAMME.\n ",
                " \nAPPLICANTS MUST POSSESS THE FOLLOWING: -\ni. Matric or equivalent NQF level 4\nii. South African Identity Document\niii. Proof of Residence (must be attached)\niv. Proof of unemployment (from the Department of Labour)\n \nIMPORTANT INFORMATION FOR APPLICANTS:\n• Applicants interested must be under the age of 35, Not in Employment, Training, and Education,\n• Applicants must be South African citizens.\n• Provide proof of parent’s affordability (pension, no income)\n• Applicants that already benefited from municipality programmes will not be considered.\n• Applicants will be required to undergo a screening process.\n• Successful applicants will be required to sign a contract with the Municipality.\n• Applications must be submitted through the online application system at www.durban.gov.za\n ",
                " \n \nHOW TO APPLY\nOnline Applications process:\nApplications must be submitted online by following the under-mentioned registration process:\nStep 1: Log onto www.durban.gov.za, and click Jobs. Choose Internships & Learnerships. Ensure that you choose the correct option to be able to see the jobs.\n\nStep 2: Create a User Profile by clicking on Sign Up. If you already have a profile, click on Log In.\nStep 3: Once your profile has been created on the system, you will receive an email confirming that you have successfully registered.\nStep 4: Once logged in, you may complete and submit your application\nStep 5: Ensure that all fields are populated\nStep 6: Once you have submitted an application, an email acknowledging your application will be sent to your inbox, so ensure you have a valid e-mail address.\n \nCLOSING DATE: 20 October 2023\n \nENQUIRIES: Nokuthula Hlophe 031-322 9836, Khusela Majikijela 031 322 9838"
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/ethekwini-logo.jpg?1696878351",
            "Href": "https://www.govpage.co.za/ethekwini-metropolitan-municipality-vacancies-blog/ethekwini-metro-database-for-employment-candidates-for-people-with-disabilities",
            "Title": "gov-page: ETHEKWINI METRO DATABASE FOR EMPLOYMENT CANDIDATES FOR PEOPLE WITH DISABILITIES",
            "Content": [
                " \nETHEKWINI METRO\n \nDATABASE FOR EMPLOYMENT CANDIDATES FOR PEOPLE WITH DISABILITIES\n \nRef: ETM/Database/2023/24\n ",
                " \nEThekwini Municipality is in the process of establishing a database of suitably qualified People with Disabilities who can be considered for appointment as employees for Top management, Senior management and Professionally qualified levels when these posts are advertised for filling in terms of employment equity target of the Municipality. The Municipality will attempt to alert the suitable candidates in its database when a post is advertised.\nApplications are hereby invited for suitably qualified People with Disabilities to express an interest in being in the Municipality’s database of potential Top management, Senior management and Professionally qualified service members. A doctor’s report confirming the disability of the candidate should accompany the application.",
                "APPLICATIONS: Application quoting reference number must be sent to Mr. Sbonelo Mseleku via email, Sbonelo.Mseleku@durban.gov.za.\nHand delivered applications must be delivered to the Employment Equity Office, 4th floor Shell House, 221 Anton Lembede Street, Durban 4001.\n \nClosing Date: 27 October 2023\n \nApplicants are required to submit a completed application form obtained from the Centre of Excellence, 21 Archie Gumede Street Durban 4001.\nCertified copies of qualifications, bar coded Identity document, academic records and comprehensive Curriculum Vitae must accompany these forms. Candidates must indicate the number of this circular and the reference number as a reference. Candidates requiring additional information must direct their enquiries telephonically to the person indicated below.\n \nEnquiries: Sbonelo Mseleku 031 311 3160"
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/arc.png?1696897676",
            "Href": "https://www.govpage.co.za/agricultural-research-council-arc-vacancies-blog/agricultural-research-council-arc-vacancies4100622",
            "Title": "gov-page: AGRICULTURAL RESEARCH COUNCIL (ARC) VACANCIES",
            "Content": [
                " \nAGRICULTURAL RESEARCH COUNCIL (ARC)\n ",
                " \n \nThe Agricultural Research Council (ARC) is a premier science institution that conducts research with partners, develops human capital and foster innovation in support of the agricultural sector. It provides diagnostic, laboratory, analytical, agricultural engineering services, post-harvest technology development, agrochemical evaluation, consultation and advisory services, food processing technology services as well as various surveys and training interventions. Through its wider network of research institutes and experimental farms, the ARC provides a strong scientific base and a broadly distributed technology transfer capacity to the entire agricultural industry in South Africa. \n \n \nThe ARC-Onderstepoort Veterinary Research (ARC–OVR) seeks to appoint a highly skilled, experienced and dynamic person to the following position at Onderstepoort, Pretoria: \n \nOCCUPATIONAL HEALTH AND SAFETY OFFICER \n \nKey Performance Areas: \n• Liaise with different authorities, management, and employees to identify operational, organisational and environmental risks in order to eliminate any dangers or risks to the employer, employees and assets. \n• Promote Occupational Health and Safety (OHS) within the Campus. \n• Ensure regular service maintenance of fire extinguishers and fire hydrants. \n• Initiate, write and review standard operating procedures/policies. \n• Manage the day-to-day running of on-site Occupational Health Clinic. \n• Ensure establishment of OHS Committees and Training. \n• Co-ordinate the Campus’s emergency response/preparedness. \n• Compile and manage a sectional budget. \n• Liaise with OHS Compliance Auditors. \n• Assist management with Business Continuity Management (BCM). \n• Assist management in ensuring full compliance with OHS Act regulations. \n \nRequirements: \n• A 3 year’s National Diploma/Bachelor’s degree in Occupational Health and Safety, Safety Management or Environmental Health. \n• Minimum of 5 years’ experience in the field of OHS. \n• Knowledge of the Occupational Health and Safety Act 85 of 1993 and Regulations.\n• Completed courses with SAMTRAC and/ or NOSA. \n• Valid driver’s license. \n \nEnquiries: Mr F Nxumalo, Tel: (012) 529 9128 \n \n \nCLOSING DATE FOR APPLICATIONS: 23 OCTOBER 2023 \n \nCompetitive remuneration package will be congruent with the scope, responsibilities and the stature of the position. The appointment will be subject to a positive security clearance and preference will be given to South African citizens. \nApplications accompanied by covering letter, detailed CV (Including certified copies of certificates, supporting documents, copy of driver’s license) must be e-mailed to OVICV@arc.agric.za\n \nNB: Non-RSA citizens with work permit must attach certified copies as well as the names and particulars of three (3) traceable referees. \n \nSAQA evaluation report must accompany foreign qualifications. Incomplete applications will not be considered. Applicants who do not receive any response four (4) weeks after the closing date must regard their applications as unsuccessful. The Agricultural Research Council is an equal opportunity employer and is committed to the principles and processes of Employment Equity. The company has the right not to appoint.",
                "The Agricultural Research Council (ARC) is a premier science institution that conducts research with partners, develops human capital and foster innovation in support of the agricultural sector. It provides diagnostic, laboratory, analytical, agricultural engineering services, post-harvest technology development, agrochemical evaluation, consultation and advisory services, food processing technology services as well as various surveys and training interventions. Through its wider network of research institutes and experimental farms, the ARC provides a strong scientific base and a broadly distributed technology transfer capacity to the entire agricultural industry in South Africa. \n \nThe ARC-Onderstepoort Veterinary Research (ARC-OVR) seeks to appoint a highly skilled, experienced and dynamic persons to the following positions at Onderstepoort, Pretoria: \n \nRESEARCHER - VACCINE PRODUCTION: TAD \n \nKey Performance Areas: \n• The incumbent will partake in research activities on transboundary animals’ diseases, focusing mainly on foot-and-mouth disease (FMD) and African Swine Fever with specific emphasis on using genetic engineering for the design of effective vaccines. \n• The development of new and improved diagnostic assays. \n• Epidemiology of transboundary animal diseases. \n• Field and laboratory animal experimental work focusing on virus transmission and understanding host immune responses. \n• Perform research, manage data, capture, analyse, interpret results, and make recommendations based on findings. \n• Compile detailed reports and seek approval for final reports. \n• Disseminate research results by presenting oral and poster contributions. \n• Publish popular, semi-scientific and peer-reviewed papers. \n• Seek networking opportunities. \n• Attend scientific gathering and be aware of intellectual property. \n• Management of projects: initiate, manage and contribute to national research projects. \n• Management of human resources: identifies the need for human resources and manages them. \n• To manage project budgets: accountable for compiling and managing project budget. \n\n• Develops business cases for all project expenditure requirements. \n• Writes and submits research proposals: sources new National research opportunities.\n• Plans and co-ordinates research activities within single or multidisciplinary team. \n• Identifies and manages resource needs. \n• Identifies risks and mitigation plans within the research focus area. \n• Maintain and manage assets from research activities. \n• Human capacity development: develops own capacity at an appropriate level. Identifies and participates in own learning opportunities. Supervise or co-supervise students. \n• Performing all research work mainly in a biosafety level 3 (BSL3) laboratory and adhering to all rules and regulations thereof. \n \nRequirements: \n• PhD in Veterinary Virology and Vaccine, Molecular Biology or Diagnostic Development Research or related fields with a minimum of 3 years’ experience post MSc qualification. \n• A tertiary major in Genetics, Microbiology or Biochemistry, will be an advantage. \n• A track record of publications, supervising MSc and PhD students and obtaining research funding would be beneficial. \n \nEnquiries: Dr L Heath, Tel: (012) 529 9501 \n \n \n \n \nRESEARCHER: DIAGNOSTIC SERVICES \n \nKey Performance Areas: \nDiagnostic:\n• Manage all human capital, facilities, finance, supply chain management and public relations matters relating to diagnostic services in the Feed and Food Analysis and General Bacteriology Laboratories. \n• Perform diagnostic and analytical tests in the Feed and Food Analysis and General Bacteriology laboratories. \n \nResearch:\n• Identify research projects, apply for research funding, conduct research, and write research reports. \n• Publish research findings in national and international journals. \n• Present research findings in national and international conferences. \n• Transfer technology to farmers and other interest groups. \n• Mentor students. \n \nBiological Bank, Rules and Regulations: \n• Updating the bio-bank with new bacterial isolates. \n• Maintaining the bio-bank database. \n• Maintain the bio-bank in good working order. \n• Comply with the Animal Ethics Committee; Occupational health and Safety; Institute Biosafety and Biosecurity Committee; and requirements of other institutional rules, regulations, committees and bodies. \n \nRequirements:\n• PhD in Veterinary Science/related Discipline. \n• At least 2 years' experience as a laboratory manager in the diagnostics and research field+ \n• Registration with the South African Veterinary Council (SAVC). \n• A track record of publications, supervising MSc and PhD students and obtaining research funding would be beneficial. \n• Knowledge of Health and Safety regulations. \n• Valid driver’s license. \n• Proficiency in MS Office suite. \n• Good people and analytical skills, report writing and organizations skills. \n \nEnquiries: Dr A Lubisi, Tel: (012) 529 9233 \n \n \n \n \nRESEARCH TECHNICIAN \n(3 YEARS’ FIXED-TERM CONTRACT) \n \nKey Performance Areas: \n• To render a quality analytical/diagnostic service by performing serological tests on veterinary samples in accordance with the requirements of ISO/IEC 17025. These include but not limited to: o Conducts diagnostic tests, conducts tests for research support, and performs other work-related services. \nPerforming B.canis, RBT, SAT, MRT and CFT tests. \n• Registration, receiving and recording of samples details in record books and correctly storing samples. \n• Performs Quality Assurance duties and adheres to quality standards. \n• Recording results in the appropriate results books and LabWare system. \n• Assisting in the improvement and development of new test methods in collaboration with the Head of Laboratory. \n• Providing research support by giving project input regarding technical detail and carrying out assigned technical tasks. \n \nRequirements: \n• National Diploma / B-Tech or BHSc degree in Veterinary Technology. \n• Must be registered with the South African Veterinary Council (SAVC). \n• Knowledge of foodborne bacterial pathogens. \n• Good interpersonal skills. \n• A driver’s license will be an added advantage. \n \n \nEnquiries: Dr I Matle, Tel: (012) 529 9317 \n \n \nCLOSING DATE FOR APPLICATIONS: 20 OCTOBER 2023 \n \nCompetitive remuneration package will be congruent with the scope, responsibilities and the stature of the position. The appointment will be subject to a positive security clearance and preference will be given to South African citizens. \n \nApplications accompanied by covering letter, detailed CV (Including certified copies of certificates, supporting documents, copy of driver’s license) must be e-mailed to OVICV@arc.agric.za\n \nNB: Non-RSA citizens with work permit must attach certified copies as well as the names and particulars of three (3) traceable referees. \n \nSAQA evaluation report must accompany foreign qualifications. Incomplete applications will not be considered. Applicants who do not receive any response four (4) weeks after the closing date must regard their applications as unsuccessful. The Agricultural Research Council is an equal opportunity employer and is committed to the principles and processes of Employment Equity. The company has the right not to appoint."
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/armscor_orig.jpg",
            "Href": "https://www.govpage.co.za/armaments-corporation-of-south-africa-armscor-vacancies-blog/armaments-corporation-of-south-africa-armscor-vacancies6307876",
            "Title": "gov-page: ARMAMENTS CORPORATION OF SOUTH AFRICA (ARMSCOR) VACANCIES",
            "Content": [
                " \nARMAMENTS CORPORATION OF SOUTH AFRICA (ARMSCOR)\n ",
                " \nANALYTICAL CHEMIST\nJOB GRADE: C4\nReference Number: DY23/09/02\n \nThe Armscor Dockyard, Engineering Services Division has a vacancy for an Analytical Chemist. Applications are invited from people meeting the qualifications and experience requirements set out below.\n \nPURPOSE OF THE JOB:\nAn Analytical Chemist is required to provide an effective chemical service to the SA Navy vessels and shore establishments regarding tribology and lubrication engineering, water quality analysis, coolant analysis, polymers identification as well as gas free engineering certification to all ships and submarines.\n \nCRITICAL PERFORMANCE AREAS:\nAssist with identifying gaps and developing appropriate interventions for the Condition Based Maintenance (CBM) to function as required.\nParticipating in monitoring and evaluating program performance to conform to safety and quality requirements.\nPerform scientific functions that require interpretation in the absence of an established framework.\nProvide consultation to the SA Navy, Armscor Dockyard, External Contractors and other Arms of Service with regards to Gas Free Engineering Certification, Condition Based Monitoring, Chemical analysis, Analytical Procedures and identification of materials.\nCertify confined and/or other spaces on-board Naval vessels, shore units and visiting ships free from toxic gasses according to Naval Ordinance 4/2/1993 (E) of 22 June 1993 and in terms of the appropriate Occupational Health and Safety Acts.\nLiaise with technical personnel and other organizations on matters of tribology.\nConsult with Section Manager in the procurement of chemicals, consumables and analytical instrumentation needed by the Condition Based Maintenance Section.\nAnalyze organic and inorganic matter and compile reports according to quality requirements.\nCarry out all adhoc requirements required by the laboratory areas, the Chemistry Manager and the Divisional Manager timeously, efficiently and with the required accuracy and effectiveness.\nPerform all activities with due consideration to biological, mechanical and chemical safety requirements.\nManage safe storage of all hazardous chemicals inside the laboratories and Chemical Store.\nBe responsible for the administration of incoming and out-going samples and sample request sheets.\nAssist with reviews of written Procedures, Work Instructions and Laboratory Accreditation related to the Chemistry Section.\nEnsure Continuous professional development by doing research/literature self-study on engineering technologies and attend work related and accredited courses to improve expertise.\n \nQUALIFICATIONS:\nNational Diploma in Analytical Chemistry\nRegistration with SACNASP or relevant body will be an added advantage. \n \nEXPERIENCE:\nThree (3) years post qualification experience in a Chemistry environment.\nExperience in the following will be an added advantage:\nFourier Transform Infrared Analysis\nOrganic and Inorganic Chemical Analysis\nViscometer\nChromatography\nElemental Analysis\nTribology Analysis\nWater Analysis\nFuel Analysis\n \nSPECIAL PROFICIENCY/SKILLS:\nComputer proficiency – Microsoft packages\nInterpersonal, communication, planning and organizing skills.\nData analysis and report writing, effective communication, and technical problem-solving skills.\n \nSPECIAL REQUIREMENTS:\nMust be physically and medically fit in respect of Confined Space Clearance, Gas Free Engineering Certification and working at heights.\n \n \n ",
                "To apply, use this link Analytical Chemist\nOR\nSend your application to careersdy@armscordy.co.za\n \nNB: All applicants must indicate reference number of the position they are applying for in the subject heading.\n \nShort-listed candidates will be subjected to reference checking, verification of personal data and security clearance as part of the selection process.  In line with Armscor’s commitment to compliance with the Employment Equity Act, preference will be given to suitable candidates from designated groups. \n\n \nThe closing date for applications is 20 October 2023.\nLate applications will not be considered.\n \nEnquiries: Ms Zanele Masiza (021 787 3137)"
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/ccma_orig.jpg",
            "Href": "https://www.govpage.co.za/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies-blog/commission-for-gender-equality-cge-vacancies",
            "Title": "gov-page: COMMISSION FOR GENDER EQUALITY (CGE) VACANCIES",
            "Content": [
                " \nCOMMISSION FOR CONCILIATION, MEDIATION AND ARBITRATION (CCMA) \n ",
                " \nPART-TIME INTERPRETER (INDEPENDENT CONTRACTOR) X1\nGauteng Province – Ekurhuleni Office\nRef: GPEKO10-23\nRate Per Day: R929.03\nThe Gauteng Province – Ekurhuleni Office requests the services of a Part-Time Interpreter.\n\nPurpose: To assist the CCMA Commissioners and structures by providing interpreter services to facilitate successful outcomes of the CCMA activities.\n\nKey Performance Areas:-\n• Verbal interpretations during hearings\n• Administrative support functions.\n\nKey Requirements:\n• Matric Certificate\n• National Diploma in Labour Related Qualification.\n• 1 year experience\n•  Knowledge on latest legislation/ amendments.\n\nLanguages: SePedi, Setswana, Sesotho, isiXhosa and IsiZulu.",
                "CLOSING DATE: 12 OCTOBER 2023\n\nTo respond in confidence, please send your detailed CV, copy of your qualifications, and a covering letter disclosing information that will assist the panel in considering your application to: recruitmenteku@ccma.org.za.\n\n“When responding to the advert please ensure that the position reference Ref: GPEKO10-23 is quoted first on the subject line, as is. And that the application is sent to the email address contained herein. Failure to observe this protocol may result in your application being disqualified.”\n\n\nIf we have not responded within a Month from the closing date, you should regard your application as unsuccessful. Correspondence will only be entered into with short-listed candidates. The CCMA reserves the right not to make an appointment. It is the intention of the CCMA to promote representivity in respect of race, gender and disability through the filling of the posts. Preference will be given to candidate from the designated groups."
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/cge_orig.gif",
            "Href": "https://www.govpage.co.za/commission-for-gender-equality-cge-vacancies-blog/commission-for-gender-equality-cge-vacancies1723796",
            "Title": "gov-page: COMMISSION FOR GENDER EQUALITY (CGE) VACANCIES",
            "Content": [
                " \nCOMMISSION FOR GENDER EQUALITY (CGE)\n ",
                " \n \nIXN 2TERN: NETWORK ADMINISTRATOR (IT UNIT)\n \nDescription\nPosition Summary: The Intern: ICT Technical Support has become available. The intern will actively contribute to meaningful projects and work closely with a mentor and with senior leadership within the ICT business unit. The successful candidate will report to the Manager: Information and Communications Technology.\nThe Network Administrator Intern is a year-round position that will assist in the day to-day administration; support and ongoing enhancement of our client’s network (LAN, WAN, Wireless) infrastructures. Candidates must be able to work in a secure, mission-critical production-computing environment. Applicants will be responsible for assisting the Network Administrators, Sr. Network Engineer, and Network.\n \nResponsibilities\nKey Performance Areas\nAssist with troubleshooting IT hardware, software, network, backups, and provide technical support.\nProvides daily on-site support on the usage of software and hardware to the end-users.\nHelp to ensure that information and communication technology (ICT) equipment is in good working condition and assists with maintenance and minor repairs.\nAssist in the installation of in-house software and related upgrades.\nRespond to end-user needs regarding Email, Microsoft 365, network access.\nSupport equipment inventory and ICT Unit record-keeping.\nAssist in minor administrative tasks.\nPerform other duties as tasked and deemed necessary for the overall delivery of the business unit’s activities.\n \nQualifications\nGrade 12 (NQF level 4).\nNational Diploma or Degree in Computer Science, Information Technology.\nPC Engineering/ A +, Networking, Office 365 and security plus will be an added advantage.\nFamiliar with installation of software, troubleshooting of hardware/laptops, printers.\nBasic understanding of cybersecurity and cloud computing.\nBasic understanding of software development, programming or data analytics concepts.\nExcellent analytical and problem-solving skills.\nAbility to work well with other team members.\nStrong work ethic and attention to detail.\nExcellent written and verbal communication skills.\nOrganised and reliable",
                "Contacts\nEmail a letter of motivation together with certified copies of ID and Qualifications to: recruitment@cge.org.za.\n \nPlease quote the reference number in the subject line of your email. Correspondence will be limited to the short-listed candidates only.\n\n \nApplicants with a foreign qualification must submit a SAQA evaluation report of their qualification. The CGE reserves the right not to fill this advertised position. The CGE is an equal opportunity, affirmative action employer committed to the achievement and maintenance of representivity (race, gender, and disability). All shortlisted candidates will be subjected to background checks. Coloured, White and Indian candidates and people with disabilities are encouraged to apply.\n \nEmployment Type: Intern\nDuration of employment: 12 Months\nJob Location: 2 Kotze Street, Women’s Jail, Constitution Hill, Braamfontein, 2000, Johannesburg, Gauteng\nBase Salary: ZAR 8000\nValid through: 13.10.2023"
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/fic.jpg?1696879573",
            "Href": "https://www.govpage.co.za/financial-intelligence-centre-fic-vacancies-blog/financial-intelligence-centre-fic-vacancies2780114",
            "Title": "gov-page: FINANCIAL INTELLIGENCE CENTRE (FIC) VACANCIES",
            "Content": [
                " \nFINANCIAL INTELLIGENCE CENTRE (FIC)\n ",
                " \n \n \n \n\nCOMPLIANCE SPECIALIST (CMU)\nOrganizational Unit: Financial Intelligence Centre -> Compliance and Prevention\nJob Type: Permanent\nEducation: Bachelor’s Degree or equivalent\nCareer Level: Skilled\nLocation: Pretoria - Centurion, GP 0157 ZA (Primary)\nTravel: 0 - 10%\nDesired Race: Not Applicable\nDesired Gender: Not Applicable\nClosing Date: 27/10/2023\n \nJob Description\nJOB PURPOSE \nProvide guidance and direction on complex financial services, designated non financial businesses and professions and related matters to Supervisory Bodies, regulated institutions and relevant stakeholders in the Financial Services and Non-Financial sectors on matters related to anti-money laundering (AML),counter- terrorism financing(CFT) and counter- proliferation finance(CPF) in accordance with the Financial Intelligence Centre Act,  (FIC Act).\n \nKEY PERFORMANCE AREAS:\n•    Engage with internal and external stakeholders (up to Executive level) to ensure compliance with the FIC Act, exchange information, provide advice, solutions and solve queries, related to highly complex matters which require new compliance solutions where expert knowledge of industry and guidance is requested\n•    Provide written / verbal testimony in administrative and criminal proceedings where required\n•    Respond to highly complex compliance queries where required\n•    Present to stakeholders on highly complex matters e.g. JSE members, and provide expert input into written material\n•    Provide expert advice on highly complex guidance products, including directives, as well as interpretation issues\n•    Identify and provide expert advice and solutions related to the ML,TF and PF risks at the national, industry/sector and entity risk assessment levels\n•    Provide advice on research methodology and lead research in respect of risk based approach and other complex compliance areas\n•    Conceptualise and facilitate the development and implementation of data systems, reporting tools, and the integration of data within the FIC\n•    Engage with external reporters who have complex business systems, to facilitate registration and reporting requirements\n•    Assist with formulation of new solutions related to compliance monitoring \n•    Quality assures departmental output in area of expertise to ensure products are technically correct\n•    Assist the department to develop long term strategy within area of expertise\n \nEDUCATION, SKILLS AND EXPERIENCE:\n•    A Relevant University degree and working towards Post-Graduate (e.g. LLB, BCOM or Information Systems) \n•    Post graduate Compliance Management qualification. (CAMS certification preferred).\n•    Minimum 10 years in a relevant field i.e in application of compliance/ risk  methodologies.\n•    8 years must in the AML/CFT environment.\n\nAPPLY TO THIS JOB\n\n \n \n ",
                " \n \n \n \n\nANALYST: LAW ENFORCEMENT\nOrganizational Unit: Financial Intelligence Centre -> Monitoring and Analysis\nJob Type: Permanent\nEducation: Bachelor’s Degree or equivalent\nCareer Level: skilled and academically qualified\nLocation: Pretoria - Centurion, GP 0157 ZA (Primary)\nTravel: 0 - 10%\nDesired Race: Not Applicable\nDesired Gender: Not Applicable\nClosing Date: 21/10/2023\n \nJob Description\n  Apply analytical approaches, processes, and tools to detect proceeds of crime and specifically instances of money laundering and terror financing.\n• Interpret information from various systems and records and evaluate information in the context of possible crimes being committed.\n• Interact / pursue opportunities with external stakeholders / third parties, when required to discuss findings and obtain information.\n• Conduct analysis of various data sets of standards to medium complexity and add value to information received to establish if there are reasonable grounds for disclosure to relevant stakeholders.\n• Conduct financial analysis to ensure creation of relevant intelligence products.\n• Determine relevance and completeness of information and identify gaps based on experience and judgment.\n• Contextualise information according to clients’ needs and prepare relevant reports, including the creation of charts and graphics, to explain findings in matters where there is a suspicion of proceeds of crime, money laundering or terrorist financing.\n• Interpret the needs of clients to ensure product output which may inform decision making.\n• Generate integrated quality assured products, which are timeous and relevant.\n• Provide technical input in improving the understanding and knowledge of factors that allow, promote and deter money laundering and terror financing.\n• Plan and manage tasking and output under supervision.\n• Assist relevant stakeholders through active involvement in joint operations and assist with technical support in instances of priority coordinated team projects.\n  Prepare basic court-directed documentation and provide factual testimony in a court of law whenever required.\n• Update records and compile statistics related to all tasking.\n• Provide input to assist in updating relevant data bases to support/enhance data analysis and improve data mining.\n \nEDUCATION, SKILLS AND EXPERIENCE\n• Relevant University Degree\n• At least three years' experience in relevant field\n• Sound knowledge in any of the following fields is preferable: financial and information analysis, intelligence, forensics or internal auditing.\n• Working experience in the following fields will be advantageous:\n Intelligence\n Law\n Law enforcement\n Accountancy\n• Sound knowledge and experience using the Microsoft office suite and Excel is a prerequisite.\n• Working knowledge of data analysis applications, tools, and systems will be an advantage.\n• Anti-money laundering training will be an added advantage.\n \nAPPLY TO THIS JOB",
                " \n \n \n \n\nFORENSIC ACCOUNTANT\nOrganizational Unit: Financial Intelligence Centre -> State Forensic Capability\nJob Type: Permanent\nEducation: Honours Degree or equivalent\nCareer Level: skilled and academically qualified\nLocation: Pretoria - Centurion, GP 0157 ZA (Primary)\nTravel: 0 - 10%\nDesired Race: Not Applicable\nDesired Gender: Not Applicable\nClosing Date: 21/10/2023\n \nJob Description\nApply technical expertise in the interpretation and presentation of complex financial information in order to aid criminal investigations, the recovery of proceeds of crime, criminal prosecutions or medium-term decisions\n \nKEY PERFORMANCE AREAS \n•    Analyse, interpret, summarise, and present complex financial information and relevant data in a manner, which is both understandable and properly supported. \n•    Identify and investigate patterns and connections between situations that are not necessarily routine or obviously interlinked and verbalise key findings to the relevant forums. \n•    Determine relevance and completeness of information or evidence and identify gaps.\n•    Perform various calculations including income and losses; transaction summaries; tracing of source and destination of funds, tracing of assets; performing present value calculations utilising appropriate rates. \n•    Utilise computerised applications such as a spreadsheet, database or computer model and utilise charts and graphics to explain findings. \n•    Investigate and contextualise financial information / evidence in support of law enforcement efforts by capturing findings and conclusions in the required reporting format and systems and submit investigation outcomes, trends and recommendations as prescribed by relevant policies and procedure.\n•    Conduct analysis within acceptable quality norms required.\n•    Facilitate the handing over of intelligence / evidence to designated authorities.\n•    Assist in legal proceedings, including testifying in court regarding forensic report findings and prepare visual aids to substantiate findings.\n•    Plan and manage personal outputs with limited supervision and interact with team members.\n•    Execute tasks expeditiously and within set action plans and time frames.\n•    Participate in transfer of skills to team members.\n•    Review and guide the work of team members.  \n•    Assist in compiling reports and case studies for training purposes and benchmarking. \n•    Advises management of financial intelligence issues and challenges as appropriate\n•    Represent the organisation at working groups, meetings, conferences, and seminars when required\n \nEDUCATION, SKILLS AND EXPERIENCE\n•    Honours in BCom accounting or forensic accounting or B Compt \n•    At least six years' experience in a relevant field\n•    Working experience in one of the following industries is preferable:\no    Financial accounting and Information analysis\no    Forensics \no    Internal Auditing\n•    Comprehensive grasp of laws, regulations, and legal precedents pertaining to evidence.\n•    Extensive knowledge of accounting and auditing standards, facilitating proficient financial investigations.\n•    Proficient in utilizing a diverse range of investigative techniques to gather vital information.\n•    Familiarity with principles and methodologies of forensic investigations across different contexts.\n•    Thorough understanding of pertinent legislation, encompassing Criminal Law, Criminal Procedure Law of Evidence, and associated statutes.\n•    Sound understanding of the legal framework within the public sector, including PFMA, MFMA, Treasury Regulations, and other applicable Treasury Directives.\n•    Required experience in the collection, application, and use of relevant information in order to substantiate deductions and findings will be an advantage.  \n•    Working knowledge of data analysis applications, tools, and systems. \n\n•    Sound knowledge and experience using the Microsoft office suite and Excel is a prerequisite. \n•    Anti-Money laundering training will be an added advantageous. \n•    Analytical, investigative, and problem-solving skills.\n•    Reporting and presentation skills\n \nTECHNICAL COMPETENCIES \n•    Data Governance, Compliance and Ethics \n•    Data Literacy \n•    Data Collection and Analysis\n•    Insights and Reporting \n•    Data Quality \n•    Data Requirements Identification\n•    Data Stewardship \n•    Data Visualisation and Presentation \n \nAPPLY TO THIS JOB",
                "PROJECT MANAGER - SAMLIT\nOrganizational Unit: Financial Intelligence Centre -> Monitoring and Analysis\nJob Type: Permanent\nEducation: Bachelors Degree or equivalent\nCareer Level: Manager\nLocation: Pretoria - Centurion, GP 0157 ZA (Primary)\nTravel: 0 - 10%\nDesired Race: Not Applicable\nDesired Gender: Not Applicable\nClosing Date: 21/10/2023\n \nJob Description\nTo manage the activities and output related to multi-disciplinary projects associated with Investigation Support Services using appropriate Project Management methodologies to support financial intelligence products and services aligned with the Financial Intelligence Centre’s mandate.\n \nKEY PERFORMANCE AREAS \n \nTECHNICAL COMPETENCIES\n•    Structure the business case for the project concepts identified and conduct general cost/benefit analysis, if required.\n•    Develop a project charter and establish a high-level roadmap to deliver on the project vision as well as a detailed project plan using sound project management methodologies and processes. \n•    Drive the performance of the project, provide active management of project components/work streams and resolve project quality and design issues. \n•    Manage the project constraints to ensure quality delivery on time and within budget.\n•    Integrate the various design components of the project (process, people, technology dimensions) and apply the project and business analysis methodologies and practices in an appropriate manner. \n•    Empower project stakeholders through project information and feedback to make judicious project decisions at the required level and ensure effective team management within discretion, policy, procedure and legislative powers to ensure output of a variety of highly complex, timely and quality financial products/services.\n•    Provide a single point of focus for all project issues, governance, escalation of risks and consideration of alternative project options and work in conjunction with stakeholders to ensure access to appropriate information and actions to support project output and outcome within legislative parameters.\n•    Monitor, control and communicate project progress using the reporting standards (status reports, etc) and advise and update management and stakeholders on project progress, obstacles and offer solutions to align output with project desired outcome/predefined plans.\n•    Ensure changes to improve performance and reduce risks and anticipate and resolve problems to achieve deadlines and standards - Monitor project risks and establish prevention and mitigation procedures, as required. \n•    Conduct presentations of highly technical nature to informed audiences and present the organisation at designated working groups, meetings etc to contribute towards informed decision making.\n•    Establish mechanisms to assess the eventual realisation of benefits committed to in the business case. \n•    Ensure efficient management of project resources, review and quality assure work of team and engage with multiple and diverse stakeholders so that expectations are managed, and the project is delivered successfully.\n•    Perform project close out activities.\n•    Ensure that all aspects of a project are managed visibly including the following methodologies and deliverables: project management, change management, system development life cycle and business analysis. \n \nEDUCATION, SKILLS, AND EXPERIENCE\n•    An undergraduate university degree or equivalent\n•    Postgraduate qualification in project management\n•    Minimum six (6) years of broad-based information systems and business experience\n•    Minimum six (6) years of project management experience \n•    Business analysis experience desirable\n•    Strong PC skills including Microsoft Project, Microsoft Excel, Microsoft Word\n•    Ability to organise, delegate and leverage resources to accomplish objectives.\n•    Excellent time management skills.\n•    Management skills including financial and accounting operations management and program/project management skills and experience.\n•    Professional development skills such as oral and written communications, personal credibility, teamwork and collaboration, work planning, and estimating.\n•    Strategic skills such as business diagnosis and assessment, business case development\n•    Supervisory skills and the ability to leverage support from other parts of the organisation.\n•    Ensure that the project team follows all quality assurance processes, including periodic reviews and transitions.\n•    Accredited certification in project management an added advantage\n•    PMP preferred certification an added advantage\n\nAPPLY TO THIS JOB",
                "SENIOR DATABASE DEVELOPER\nOrganizational Unit: Financial Intelligence Centre -> Corporate Services -> Information and Communication Technology\nJob Type: Permanent\nEducation: Bachelor’s Degree or equivalent\nCareer Level: Professional\nLocation: Pretoria - Centurion, GP 0157 ZA (Primary)\nTravel: 0 - 10%\nDesired Race: Not Applicable\nDesired Gender: Not Applicable\nClosing Date: 13/10/2023\n \nJob Description\nJOB PURPOSE\nDesign, develop and maintain high performance scalable and secure database solution in order to ensure successful and efficient database solutions meeting the business requirements. \n \nKEY PERFORMANCE AREAS:\n•    Requirements gathering – through engagement with business i.e., collect, document, and review business requirements.\n•    Database design and implementation – design, implement manage complex databases and data structures that meet business requirements, taking scalability, reliability and performance into consideration.\n•    Database modelling – understanding of data modelling concepts and create logical and physical data models to support database design. create and maintain data models and data structures, ensuring data consistency and accuracy.\n•    SQL development - develop SQL scripts and optimise database performance using techniques like indexing, partitioning, and query optimization. including writing complex queries, stored procedures and triggers to support business operations.\n•    Data migration – migrate data from one data source to another, ensuring data integrity and accuracy during the migration process.\n•    Data management –manage and maintain large amounts of data and ensure data quality, accuracy, and security. Reviewing reports and performance indicators  \n•    Data quality assurance – ensuring the integrity and accuracy of data through well-defined verification and validation models\n•    Reporting and dashboarding - develop reports and dashboards providing a view on trends, patterns, focus and prediction based on relevant data sets\n•    Data Warehousing - develop data warehousing solutions, including data integration, data cleaning, and data warehousing design.\n•    Technical writing – develop and maintain comprehensive technical documentation and specifications and related technical specifications\n•    Project management – adhere to project management standards and techniques in the line of work\n•    Data Governance - implement data governance processes and policies to ensure data integrity and security.\n•    Mentoring – guide and support junior resources on data related tasks\n \nEDUCATION, SKILLS AND EXPERIENCE:\n•    A relevant ICT degree  or equivalent qualification\n•    Requirements gathering - minimum five (6) year experience\n•    Project management - minimum five (6) year experience\n•    Technical  writing – minimum five (6) year experience\n•    Database design and implementation - minimum five (6) year experience\n•    SQL development - minimum five (6) year experience in developing data solutions on MSSQL platform\n•    Reporting and dashboarding - minimum five (6)) year experience developing reports and dashboard using PowerBI, SRSS and MSSQL\n•    Data quality assurance - minimum five (6) year experience\n•    Data management - minimum three (3) year experience\n•    Data migrations - minimum three (3) year experience\n•    Data Warehousing – minimum three (3) year experience\n•    Data modelling - minimum three (3) year experience\n•    Data Governance – minimum two (2) year experience\n•    Requirements gathering - minimum two (2) years experience in gathering and translating requirements into technical designs and solutions\n•    Mentoring – experience in providing mentoring to junior resources\n•    Working experience in developing cloud database solutions with databases and platforms in Azure cloud environments is an advantage\n \nAPPLY TO THIS JOB"
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/financial-sector-conduct-authority-fsca_orig.png",
            "Href": "https://www.govpage.co.za/financial-sector-conduct-authority-fsca-vacancies-blog/financial-sector-conduct-authority-fsca-vacancies3635942",
            "Title": "gov-page: FINANCIAL SECTOR CONDUCT AUTHORITY (FSCA) VACANCIES",
            "Content": [
                " \nFINANCIAL SECTOR CONDUCT AUTHORITY (FSCA)\n ",
                " \n \nFACILITIES AND MAINTENANCE SUPERVISOR - FACILITIES DEPARTMENT (PRETORIA)\nReference Number: FSCA89\n \nDescription\nPurpose of the Job:\nTo maintain standard of the FSCA’s buildings, equipment and facilities services that also provides a safe environment for the FSCA’s employees.\n\nKey Performance Areas:\nThe Facilities Supervisor is responsible for maintaining building/s, assets, equipment, and grounds as well as overseeing the provision of services across the organisation relating to cleaning, hygiene, safety and security landscaping through the scheduling and management of contractors.\nMaintains, reviews and records a variety of reports, including daily activity reports, work orders, work requests, monthly statistical reports, and other reports and records as required.\nReviews vendor/contractor invoices and proposals and recommends payment upon receipt of material/completion of work.\nSupervises and participates in the investigation, trouble shooting, repair and maintenance of buildings and equipment.\nCoordinates the organization, staffing, and operation activities for assigned maintenance and operations programs; directs, coordinates, and reviews the work plan for assigned maintenance and operations services and activities; assigns work activities and projects; monitors workflow; reviews and evaluates work products, methods, and procedures; meets with staff to identify and resolve problems.\nPlans, organizes, controls, integrates, and evaluates the activities and operations related to the construction, maintenance and repair of office buildings and the various features such as HVAC, plumbing, electrical, fleet management, administration and security.\nProvides staff assistance to the Facilities and Maintenance Manager; conducts a variety of studies and investigations; develops and recommends modifications to assigned maintenance and operations programs, policies, and procedures as appropriate.\nMay perform all functions of the Facility Manager and Maintenance Manager.\n \nOther Key Competencies:\n\nThe candidate must demonstrate the following skills and attributes: Good interpersonal and communication skills; ability to carry out various types of routine inspections in the boardrooms, training rooms, meeting rooms and kitchens; service and customer orientated; leadership skills; ability to deal with complaints and problem solving; meticulous; accurate; methodical and systematic. The candidate also must be computer literate.\n\nThe candidate will be subjected to competency assessment and integrity checks before an appointment is made.  \n \n ",
                "FSCA is committed towards increasing the representation of marginalised groups in line with its Employment Equity Plan. Persons with disabilities are encouraged to apply.\n\nPlease note that correspondence and communication will only be conducted with short listed candidates and that the FSCA reserves the right not to appoint if a suitable candidate is not identified.\n \nClosing Date: 13 October 3023\n\n \nRequirements\n\nNational Diploma in Facilities Management or Property Management or built environment. SAFMA accreditation. 5+ years good technical experience of facilities maintenance and soft services practices with 3 years of experience being in a supervisory capacity. This position will report directly to the Maintenance Manager.\n \nWork Level: Mid-Level\nJob Type: Permanent\nSalary: Market Related\nEE Position: Yes\nLocation: Pretoria\n \nPLEASE APPLY HERE"
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/gems-logo_orig.jpg",
            "Href": "https://www.govpage.co.za/government-employees-medical-scheme-gems-vacancies-blog/government-employees-medical-scheme-gems-vacancies6936503",
            "Title": "gov-page: GOVERNMENT EMPLOYEES MEDICAL SCHEME (GEMS) VACANCIES",
            "Content": [
                " \nGOVERNMENT EMPLOYEES MEDICAL SCHEME (GEMS)\n ",
                " \n \nEXECUTIVE ASSISTANT - EXECUTIVE MANAGER: OPO OPO2304\nType: Permanent \nSalary: The total remuneration package will be based on qualifications and experience. \nClosing date: 21 October\n \nAPPLY\n \nThe position of Executive Assistant – Executive Manager: Office of the Principal Officer (EM: OPO) vacant. The Executive Assistant – Executive Manager: OPO role will report directly to the Executive Manager: OPO and forms part of the Office of the Principal Officer Division. The position is permanent and will be based at GEMS Head Office.\nThe total remuneration package for this position is negotiable based on qualifications and experience.\n \nThe Executive Assistant – Executive Manager: OPO will be required to provide support to the Executive Manager: OPO through the implementation of the following Key Performance Areas (KPAs):\nDiary management\nOrganise detailed travel plans, itineraries and agendas.\nBooking attendance of event, conferences, and seminars both domestic and internationally\nCoordination of divisional meetings including preparation, tracking and circulation of meeting documents, minutes and actions\nCirculation of office communication and coordination of delivery of services\nDrafting and circulation of communication on behalf of Executive Manager: OPO\nSupport key OPO divisional projects\nCoordinate Office of the Principal Officers Events calendar\nChange Management Agent for the Office of the Principal Officer Division\nCommunication and roll-out of outreach activities\nSupport Executive Manager: OPO intervention towards driving integration across the Scheme\n \nQualification Requirements:\nMinimum two (2) year qualification in Administration or Secretarial Studies, or equivalent NQF Level 5\nA diploma/degree in strategy/business administration/project management or a related field will an added advantage\nAt least 2 years’ experience in an Executive/ Personal Assistant role\nExperience within a strategy and/or project management environment would be advantageous\nSkills\nProficient in computer software such as Microsoft Office (Outlook, Word, Excel, and Power Point), Adobe Acrobat\nExperience with office administrative systems e.g. HR/ Procurement Systems\nExcellent written English and the ability to communicate at all levels\n \nBehavioural Competencies:\nRespect the need for confidentiality and sensitive information\nTo work under pressure to agreed deadlines and adapt to change\nBe organised and have good time management skills\nAttention to detail to ensure high quality work\nTo work in a flexible manner including out of hours as and when required\nHave the ability to work well as part of a team\nBe responsible and reliable\nSelf-Motivated and pro-active\n \nDesirable\nHave an understanding of medical schemes industry\nExperience in the Healthcare Industry would be advantageous\n \nShould you be interested, please apply here \n \nThe closing date for applications is 17 October 2023. Should you not hear from us by 31 December 2023, please consider your application unsuccessful. \n \n*** GEMS employs people with the highest level of integrity – submission to the appropriate pre-employment assessment is obligatory to be considered for the position.\n*** Kindly note that the information provided on application of the position may be shared with a third party for vetting purposes and will be stored by GEMS for a period of 5 years.\n*** Kindly note that information is required for Employment Equity Purposes and information gathered is strictly used according to the intended purpose of collection, unless there is a legal need or permission is granted from the applicant themselves to make use of it for other purpose\n*** Should you wish to have your information removed from the GEMS database, kindly send a request in writing to jobs@gems.gov.za.\n*** GEMS adopts a hybrid work model\n***GEMS is guided by the principles of employment equity. Preference will be given to groups who are underrepresented in accordance with GEMS employment equity plan.\n \n \n \n ",
                "EXECUTIVE ASSISTANT - EXECUTIVE MANAGER: OPO OPO2304\nType: Permanent \nSalary: The total remuneration package will be based on qualifications and experience. \nClosing date: 14 October\n \nAPPLY\n \nThe position of Medical Advisor: Clinical Healthcare Policy is vacant. The Medical Advisor: Clinical Healthcare Policy will report directly to the Senior Manager Medical Advisory Services and forms part of the Healthcare Management Division. The position is based at Head Office in Pretoria.\nThe total remuneration package for this position is negotiable based on qualifications and experience.\n\n\n\nThe Medical Advisor: Clinical Healthcare Policy will be required to assist and support the Senior Manager Medical Advisory through the implementation of the following Key Performance Areas (KPAs):\nManage the administrative function in the Medical Advisory Services business unit\n Manage and coordinate the conducting of systemic reviews of good clinical practice guidelines and health technology assessments; to ensure that Scheme funding decisions are based on best practice. This activity aims to ensure these elements are sound and compliant with the Medical Schemes Act and Regulations and the Scheme Rules.\nContribute to and conduct targeted research into local and international clinical guidelines and funding policies.\nCritical review and analysis of current cost drivers and trends and compare with those of local and international sources for best practice.\nAssist in critically analysing medical literature and use of evidence-based principles to review and generate enhancements in funding protocols.\nAssist in the management and monitoring of clinical cost targets\nAssist in developing and maintaining adequate knowledge of data handling and interpretation of information translating interventions.\nSupport the Medical Advisory Services Unit in the Scheme’s Ex gratia ratification cases in researching evidence-based medicine\nSupport the Medical Advisory Services Unit in the Scheme’s product development and benefit design activities\nManage the review of the Scheme’s funding policies, protocols and formularies\nManage the Scheme’s Maternity Benefit Programme\nChair and coordinate monthly SPN meetings\nPerform Service Level Agreement quarterly site visits\nSupport in the management and monitoring SPN's to implement and give results within set targets\nSupport in the management of the divisional budget in line with budget allocation\nAssist in improving member value\nMonitor project/programme in conjunction with the internal Project Management unit of the Scheme\nEnsure that all relevant projects are carried out and finalised\nLiaise with GEMS SPNs on operational matters\nRepresent the Healthcare Management Division at SPN and Stakeholder Engagements\nRepresent the Healthcare Management division in internal forum\nSupport the Scheme’s Clinical Advisory Expert Panels\nAssist in the process for development and maintenance of Medical Advisory Services standard operating procedures and policies.\nAssist the Medical Advisory Services in providing clinical support to Healthcare Management and the Scheme’s other divisions\nAssist in providing clinical support the Scheme’s Disease Risk Management Programmes\nAssess and mitigate risk with the Medical Advisory Services Unit\nManage relationship building with key stakeholders\nMonitor and evaluate clinical cost targets\nManage and assist staff in developing Personal Development Plans, Training Plan and succession plan in accordance to HR policy Diary management\n \nQualification Requirements:\nMinimum MBChB\nQualifications in Health Technology Assessment or Evidence-Based Medicine would be advantageous\nAt least 5 years work experience in the healthcare funding / medical scheme industry with at least 2 years at manager/supervisor level\nPrevious experience in a Health Policy Unit will be advantageous\nExperience in the evaluation of health technology assessments would be advantageous\nMust have experience in the development and presentation of management reports\nA good understanding of coding (Nappi, Tariffs, ICD10, CPT4, UPFS and more)\nA good understanding of the South African Healthcare Industry\nA good understanding of the Medical Schemes Act\nThe ability to conduct research using a variety of academic and market-related resources\n \n \nShould you be interested, please apply here \n \nThe closing date for applications is 13 October 2023. Should you not hear from us by 31 December 2023, please consider your application unsuccessful. \n \n*** GEMS employs people with the highest level of integrity – submission to the appropriate pre-employment assessment is obligatory to be considered for the position.\n*** Kindly note that the information provided on application of the position may be shared with a third party for vetting purposes and will be stored by GEMS for a period of 5 years.\n*** Kindly note that information is required for Employment Equity Purposes and information gathered is strictly used according to the intended purpose of collection, unless there is a legal need or permission is granted from the applicant themselves to make use of it for other purpose\n*** Should you wish to have your information removed from the GEMS database, kindly send a request in writing to jobs@gems.gov.za.\n*** GEMS adopts a hybrid work model\n***GEMS is guided by the principles of employment equity. Preference will be given to groups who are underrepresented in accordance with GEMS employment equity plan."
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/gepf_orig.png",
            "Href": "https://www.govpage.co.za/government-employees-pension-fund-gepf-vacancies-blog/government-employees-pension-fund-gepf-vacancies4616696",
            "Title": "gov-page: GOVERNMENT EMPLOYEES PENSION FUND (GEPF) VACANCIES",
            "Content": [
                " \nGOVERNMENT EMPLOYEES PENSION FUND (GEPF)\n ",
                "With more than 1.2 million active members and around 500 000 pensioners and beneficiaries as well as assets worth more than R2.3 trillion, the Government Employees Pension Fund is a defined benefit fund that manages pensions and related benefits on behalf of government employees in South Africa. It is the largest pension fund in South Africa and Africa. The GEPF is currently seeking to appoint a suitably qualified individual with the relevant experience to fill the below role within the Office of the Principal Executive Officer, in Pretoria. \n \n \nPERSONAL ASSISTANT - OFFICE OF THE PEO \nPurpose of the Role: To provide an efficient and professional secretarial and administrative support function to the Office of the PEO \n \nKey Responsibilities: • Secretarial Support - Manage the diary of the PEO and Business Manager, manage emails, screen calls and take messages, manage visitors, draft and review documents, address stakeholder queries, manage adhoc tasks, arrange venues and catering, arrange meetings, take minutes and transcribe audio • Administration: Manage office supplies, manage expenditure and invoices, manage stakeholder database, maintain filing, record management and track documents, track expenditure, general administrative support • Travel Administration: Manage travel administration, prepare itinerary, manage travel payments, liaise with service providers to ensure all travel arrangements are confirmed. \n \nQualifications, Experience, Knowledge and Skills: • National Diploma in Secretarial / Administration (NQF 6) • 6 years’ experience in a Personal Assistant role for an Executive • Experience in report writing, report consolidation, minute taking and making local & international travel arrangements • Proficient in MS office packages • Understanding of the Government Employee Pension Fund and/or Pension Fund Industry • Knowledge of operating standard office equipment • Administrative and clerical procedures. \n \n \nThe GEPF is an equal opportunity employer, committed to employment equity in the organization. \n \nThe principles as set out in the GEPF’’s employment equity policy will apply \n \nTo apply for the above vacancy, email your CV to: recruit8@sixsense.co.za\n\n \nThe position will also be advertised on the following websites: \nwww.gepf.co.za & www.sixsense.co.za\n \nThe closing date is: 17th October 2023\n\n\nNo late applications will be considered. It is the applicant’s responsibility to have foreign qualifications evaluated by the South African Qualification Authority (SAQA) prior to the selection process. Communication will be with short-listed applicants only.",
                "The Government Employees Pension Fund (GEPF) is the largest pension fund in Africa, with more than 1.2 million active members and around 500 000 pensioners and beneficiaries as well as assets worth more than R2.3 trillion. \n \nBUSINESS MANAGER\nThe successful candidate will provide strategic business support to the Principal Executive Officer (PEO) to enable focused attention by the PEO on strategic deliverables of the Fund and all associated functions. Embed strategy development, monitoring and evaluation by all departments in support of the PEO. Responsible for implementing the monthly and quarterly reporting with a focus on delivery on strategy by the Heads of Departments, as well as preparation for reporting to the Board and its committees. Manage internal and external stakeholder relationships.\n \nQualifications and Experience: • Relevant Post Graduate qualification • MBA preferred • Senior level experience in Business Manager/Finance role • 5 years’ financial analysis, general management and management of diverse stakeholders experience.\nA competitive, market related remuneration package will be negotiated with the successful candidate. The GEPF is an equal opportunity employer, committed to employment equity.\n \nContact person: Courtney Chikowore, e-mail: Courtney@warriortalent.co.za tel. (011) 058 0030\n \nCLOSING DATE FOR APPLICATIONS IS TUESDAY, 17 OCTOBER 2023."
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/hda-jpeg_orig.jpg",
            "Href": "https://www.govpage.co.za/housing-development-agency-hda-vacancies-blog/housing-development-agency-hda-vacancies8468132",
            "Title": "gov-page: HOUSING DEVELOPMENT AGENCY (HDA) VACANCIES",
            "Content": [
                " \nHOUSING DEVELOPMENT AGENCY (HDA)\n ",
                " \n \nThe Housing Development Agency (HDA) is a National Public sector development agency that inter alia has the mandate to identify, acquire, prepare and develop suitable land for human settlements. The agency also undertakes the programme and project management for development of housing and human settlements. The HDA carries out its functions in partnership with a range of stakeholders including national, provincial and local government and municipalities, as well as with communities, developers and financiers. Established in 2009, the Agency was established by an Act of Parliament in 2008 and is accountable through its Board to the Minister of Human Settlements.\nFor more information about the HDA, please visit our website: www.thehda.co.za.\n \nThe HDA has the following positions: Six (6) Months Temporary Fixed Term contract position:\n \nTEMPORARY COMPLIANCE OFFICER\nLocation: Head Office – Johannesburg\nReporting Line: Chief Audit Executive\nRef: COFF23\n \nMain Purpose: To ensure that the agency complies with its outside regulatory and legal requirements as well as internal policies and bylaws.\n \nKey Performance Areas:\n1. Compliance management\n• Implement a comprehensive compliance programme aligned to organisational planning process.\n• Assist management in the design, development and implementation of compliance frameworks.\n• Assist in the design, development and delivery of compliance awareness and training interventions.\n• Develop or review, advise and create awareness of the role and responsibility descriptions.\n• Ensure compliance through best fit compliance practice aligned to regulatory requirements and create awareness with stakeholders to embed a compliance culture.\n• Identify, assess and prioritise all the applicable regulatory requirements that the Agency is required to comply with.\n• Develop and implement a compliance monitoring plan using accepted standards, methodologies and tools.\n• Assist and provide input for the identification, prioritisation and management of compliance risk by developing a compliance monitoring plan.\n• Present the monitoring plan to management and governance stakeholders for approval using appropriate monitoring methodologies.\n• Determine the governance requirements relating to compliance reporting.\n• Determine the compliance reporting requirements to stakeholders and/or supervisors in terms of regulatory organisation requirements.\n• Build and maintain communication channels and liaison with stakeholders and regulators.\n• Draft policies and procedures to address the management of the relationship with regulators and management.\n \n2. Risk Management:\n• Perform effective risk and control assessments periodically.\n• Work together with the Manager to conduct risk assessments, analyses risks and assist with the enterprise risk management function.\n• To provide continuous support to Business Units on risk and internal control related matters.\n• To promote and institutionalise risk awareness culture and compliance in the organisation.\n• Develop and track the fraud recommendation action plan to mitigate identified fraud risks of the HDA.\n \n3. Governance:\n•Develop, review, coordinate and facilitate approval protocol and implement policies and procedures within area of responsibility.\n•Monitor and report on compliance with contract SLA’s.\n•Work with Audit Manager to drive initiatives aimed at eliminating waste, improve productivity and reduce operating costs within the area of responsibility.\n•Comply with all legislative requirements, PFMA, Treasury Regulations, BAS, DORA.\n•Ensure sound administrative and governance services.\n•Assist with training and awareness to improve the organisation culture & ethics.\n \n4. Reporting:\n• Assist with the preparation of Internal Audit reports with recommendations to communicate audit results in line with the IIA standards.\n• Assist with the preparation of the quarterly audit & risk reports for presentation and adoption by the EXCO, Risk and Audit Committee and Board.\n• Assist with the reporting of internal audit, risk and compliance reports.\n\n• Report on progress towards implementation of compliance.\n \nQualifications and Experience:\n• Degree or NQF 6 qualification in Law/Internal Audit/BCom/Risk Management/related qualification\n• A minimum of 3-5 years’ experience in Compliance\n• Certification in Compliance will be added as advantage.\n• Experience in a PFMA Public Entities will be added advantage.\n• Relevant membership with a professional body will be added advantage.\n \n \nRemuneration: R 37 441 – R 56 666 per month (all-inclusive package)\nPeriod: Six months\n \nClosing date for applications is 13 October 2023.\n \nTo submit your application, please send an email HDARecruitCEO@thehda.co.za\n \nWhen submitting your application for a position, please adhere to the following:\n1. CVs received after the closing date will NOT be considered.\n2. The Job Title and Reference number for the relevant position must appear in the subject line of your application.\n3. The CV must be in PDF format.\n4. Copies of all qualifications must be provided.\n5. Copies of identity document must be provided.\n6. Two contactable references.\n \n \nKindly take note if you have not been contacted within twenty-one (21) working days of the closing date; please consider your application unsuccessful. Should you not comply with the above requirements your application will NOT be considered.\n \nConditions of service: ● The HDA is an equal opportunity employer ● Appointments will be made in accordance with the HDA Employment Equity policy and priority given to people living with disabilities and females ● The HDA reserves the right not to make an appointment.\n \nWe thank all applicants for their interest.\n \nCommunication will be conducted with short-listed applicants only.\n \nThe HDA operates in accordance with the Protection of Personal Information Act 3 of 2013 (“POPI Act”), and by submitting your personal information to the HDA (by way of application and/or providing any other documentation as may be required during the recruitment process), you agree that the HDA may utilise and process your personal information in accordance with the POPI Act.\n \n \n \n ",
                "The Housing Development Agency (HDA) is a national public sector development agency that acquires and prepares land as well as develops the land and project manages the development of housing and human settlements. We carry out our activities in partnership with a range of stakeholders including national, provincial, and local government and municipalities, as well as with communities, developers, financiers, and other affected parties. Established in 2009, the Agency was established by an Act of Parliament in 2008 and is accountable through its Board to the Minister of Human Settlements. \nFor more information about the HDA, please visit our website: www.thehda.co.za.\n \nThe HDA has the following Five (5)- Months Fixed term contract position:\nLEGAL SPECIALIST\nLocation: Head Office – Johannesburg\nReporting Line: Manager Corporate Legal \nRef: LS 004\n \nMain Purpose:\n• To provide the HDA with accurate and relevant legal, compliance support and advice to minimise risks and ensure effective contractual arrangements and statutory compliance.\n \nKey Performance Areas:\n•Draft all contracts for the HDA including but not limited to:\n•Review and interpret relevant documentation, statutes and information in order to determine the appropriate HDA position\n \n1. Contract Management\no Employment contracts\no Service provider contracts\no Land purchase and disposal contracts\no Land and building management contracts\no Service level agreements\no Project management\no Memoranda of Understanding\no Intergovernmental relationships\n• Review all contracts signed by the HDA\n• Provide input and advice on appropriateness of contracts and recommended or required amendments\n• Guide the development of strategic contracting and contract management approaches\n• Recommend all contracts for signature or amendments to the authorized HDA signatories\n \n2. Legal Management Support and Litigation\n•Provide legal advice to all HDA management as required\n•Review legal and contractual environment and identify potential risks\n•Provide advice on any disputes, litigation or arbitration related matters\n•Represent HDA in litigation and dispute resolution processes and procedures as appropriate\n•Manage service providers providing advice or legal representation to HAD\n•Represent the HDA in providing legal support and specialist advice to stakeholders and partners\n•Participate in and contribute to the IGR legal forum\n \n3. Service Provider Management\n•Instruct and manage legal service providers with consultation and approval from Legal Manager\n•Monitor performance in line with briefs provided\n•Manage all litigation undertaken by service providers\n•Manage legal expenditure on service providers in line with the approved budgets and in consultation with Legal Manager\n•Ensure that the HDA regulations are relevant and updated to enable the HDA to carry out its mandate as per HDA act\n \n4. Statutory Compliance and Governance\n•Review statutes and policies to ensure alignment to legislation and regulations.\n•Ensure HDA compliance with relevant legislation\n•Develop relevant policies and review statutes and policies aligned to all legislation and regulations as and when required.\n•Interpret statues and potential implications for the HDA\n•Development and review of policies and procedures to ensure legal compliance\n•Advise the HDA on governance issues in accordance with the PFMA / King III / HDA Act and all relevant legislation\n•Assist with Board Administration (if required)\n•Support with management of all legal actives within the HDA\n•Knowledge of OSH\n•Support and manage IR matters\n•Knowledge of Land Legal matters and able to support the Land and other departments\n•Knowledge of Contract Management\n \nQualification & Experience:\n• Legal degree (LLB) and Admission as an Attorney or Advocate.\n• A minimum of 5 with experience in contract law or commercial law and labour law\n• Extensive experience in PFMA and Treasury Regulation, Directive and Practice Notes\n• Experience in carrying out investigations and leading evidence in disciplinary cases\n• Experience in commercial litigation.\n• Knowledge, insight and experience of the public and private sector human settlement environments would be preferable\n \n \nRemuneration Scale: R 47 541 – R61 825 per month (all-inclusive package)\n \nClosing date for applications is 13 October 2023.\n \nTo submit your application, please send an email HDARecruiteCSHR@thehda.co.za\n \nWhen submitting your application for a position, please adhere to the following:\n1. CVs received after the closing date will NOT be considered.\n2. The Job Title and Reference number for the relevant position must appear in the subject line of your application.\n3. The CV must be in PDF format.\n4. Copies of all qualifications must be provided.\n5. Copy of identity document must be provided.\n6. Two contactable references.\n \nKindly take note if you have not been contacted within twenty-one (21) working days of the closing date; please consider your application unsuccessful. Should you not comply with the above requirements your application will NOT be considered.\n \nConditions of service: The HDA is an equal opportunity employer ● Appointments will be made in accordance with the HDA Employment Equity policy ● The HDA reserves the right not to make an appointment. We thank all applicants for their interest.\nCommunication will be conducted with short-listed applicants only.\n \nThe HDA operates in accordance with the Protection of Personal Information Act 3 of 2013 (“POPI Act”), and by submitting your personal information to the HDA (by way of application and/or providing any other documentation as may be required during the recruitment process), you agree that the HDA may utilise and process your personal information in accordance with the POPI Act."
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/irba_orig.jpg",
            "Href": "https://www.govpage.co.za/independent-regulatory-board-for-auditors-irba-vacancies-blog/independent-regulatory-board-for-auditors-irba-vacancies4746245",
            "Title": "gov-page: INDEPENDENT REGULATORY BOARD FOR AUDITORS (IRBA) VACANCIES",
            "Content": [
                " \nINDEPENDENT REGULATORY BOARD FOR AUDITORS (IRBA)\n ",
                " \nFACILITIES SUPERVISOR\nDepartment: Operations Department\nClosing Date: 13 October 2023\n \nQUALIFICATIONS AND EXPERIENCE\n A matric certificate or an equivalent;\n A post-matric certificate/diploma/degree, which would be advantageous;\n A valid driver’s licence;\n At least five years’ experience in building supervision;\n Experience in facilities management as well as occupational health and safety (OHS);\n Technical knowledge in the electrical, plumbing, building and facilities management fields;\n Knowledge of the importance of environmental sustainability in facilities management, including:\no Awareness of the differences between the strategic and operational functions of facilities management;\no An understanding of the pros and cons of insourcing versus outsourcing the facilities management functions; and\no A recognition of the relationship between organisational culture and facilities management.\n Knowledge of drafting and implementing a facilities management strategy and communication thereof through policies and processes;\n Knowledge of facilities management maintenance, lifecycles and budgeting;\n Experience in managing projects, internal staff and external service providers;\n\n Experience in facilities management tendering and contract management processes; and\n An understanding of technology, facilities management business continuity and facilities risk management.\n \nATTRIBUTES\n A team player who is prepared to assist others, as the need arises.\n Good people skills and the ability to communicate effectively, both verbally and in writing.\n Unquestionable integrity and objectivity.\n Data management knowledge.\n Good project and time management skills.\n Creative problem-solving skills and critical/assimilated thinking.\n \nJOB REQUIREMENTS\n Manage general building maintenance.\n Oversee contracts for facilities-related service providers, including the building lease agreement.\n Manage OHS matters and compliance with relevant legislation.\n Supervise and control the facilities-related inventory.\n Oversee and co-ordinate the occupational health, safety and security of staff in their use of the building.\n Manage the Facilities Unit staff, including the contractors and the carwash scheme.\n Act as the project manager for IRBA events that are held onsite.\n Manage the internal events held at the IRBA.\n Prepare and submit monthly reports and other financial information that relates to facilities management.\n Assess the training needs of the Facilities staff and recommend training for them.",
                "Kindly email applications and curriculum vitae (CVs) to hr@irba.co.za.\n \nThe IRBA is an employment equity employer. To comply with our equity plans, preference for this position will be given to candidates from designated race groups (particularly Indian candidates and those with disabilities). Correspondence will be limited to just the shortlisted candidates. Only candidates who meet the requirements should apply. The IRBA reserves the right not to make an appointment. By applying, the applicant gives the IRBA permission to perform background, security, credit and reference checks, and to verify documents and qualifications. As this position requires trust and honesty, in addition to the handling of cash and duties that relate to finances, relevant credit checks will be performed on candidates. Shortlisted applicants may be asked to complete a psychometric assessment before a final appointment is made.\n \nTo consider any application for employment, we will have to process each applicant’s personal information. The Protection of Personal Information Act 4 of 2013 provides that when one processes another’s personal information, such collection, retention, dissemination and use of that person’s personal information must be done in a lawful and transparent manner. Therefore, to give effect to this, the IRBA is under a duty to provide you with various details pertaining to the processing of any applicant’s or their representative’s personal information. These details are housed under the HR Processing Notice that can be accessed and viewed on the IRBA website at https://www.irba.co.za/library/popi-act; and we request that you kindly download and read this notice prior to responding to this job advert.\n \nOnly CVs received directly from individual candidates or recruitment agencies appointed by the IRBA will be considered. So, all suitable candidates who are not registered with IRBA-appointed recruitment agencies are encouraged to apply for this position directly, for them to be considered."
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/mintek.jpg?1696880335",
            "Href": "https://www.govpage.co.za/mintek-vacancies-blog/mintek-vacancies2140372",
            "Title": "gov-page: MINTEK VACANCIES",
            "Content": [
                " \nMINTEK\n ",
                " \n \nHR INTERN\nListing reference: minte_000150\nListing status: Online\nApply by: 18 October 2023\n \nPosition summary\nIndustry: Scientific, Research & Development\nJob category: Recruitment and Selection\nLocation: Randburg\nContract: Internship\nRemuneration: Market Related\nEE position: Yes\nIntroduction\nMintek offers an exciting opportunity to suitable graduates for potential placement within our Human Resource Division at our Randburg Offices.\nJob description\nHR Intern\nRef: HRIN/01/HRD\n \nHUMAN RESOURCES DIVISION\n \nKEY PERFORMANCE INDICATORS:\nResponsible for recruitment process administration \nResponsible for the entire recruitment process of junior positions \nSend, receive and record employment applications and ensure that they are complete\nAssist division to provide an effective service in relation to pre-interview screening, testing and assessment\nEnsure all candidates are legally compliant i.e. have the right to work in RSA\nSupport HRBP's by conducting and facilitating pre and post interview briefings/feedback\nEnsure all interview feedback is recorded and relayed to the relevant parties\nAdminister competency/psychometric assessments as appropriate\nConduct reference checks\nPre-screen applicants and arrange interviewing panel and schedule the interviews for HRBPs\nTimely and efficient completion of all recruitment and new joiner documentation including employment contracts\nOrganise pre-employment occupational health assessments\nProvide support and advice to staff as appropriate\nDemonstrate through behaviour the values and vision of Mintek\n \nJOB KNOWLEDGE AND EXPERIENCE:\nExperience within HR Operations in an HR Administrator role will be an added advantage\nKnowledge of and a good understanding of various labour legislation.\nProficiency in MS Office, knowledge of SAP HR will be an added advantage\nCompetent knowledge of current trends and best practices in human resources management\n \nQUALIFICATIONS:\n B.Com Hons/B Admin Hons in HR / Industrial Psychology or equivalent (preferred)\n Ideal: Masters\n \nBEHAVIOURAL COMPETENCIES:\nA strong focus on the delivery of HR operational excellence\nAbility to use influence and persuasion to further HR goals\n Attention to detail, ability to follow up and take initiative\nExcellent organising, administration and communication skills. \n \nMinimum requirements\n  B.Com Hons/B Admin Hons in HR / Industrial Psychology or equivalent\nIdeal :Masters\n \n \nSALARY PACKAGE: NEGOTIABLE\n \nCLOSING DATE:18 OCTOBER 2023\n \nThe above-mentioned vacancy is also available on the Mintek website at www.mintek.co.za\nShould you not hear from us within one (1) month of the closing date, consider your application to be unsuccessful.\n \nMintek is an equal opportunity, affirmative action employer, whose aim is to promote representivity in all levels of occupational categories\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \nCANDIDATE SCIENTIST/ENGINEER: PROCESS CONTROL - MAC\nListing reference: minte_000149\nListing status: Online\nApply by: 17 October 2023\n \nPosition summary\nIndustry: Scientific, Research & Development\nJob category: Other: Mining\nLocation: Randburg\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nMintek is seeking a graduate engineer to conduct research into advanced control systems and optimisation strategies for minerals processing and metallurgical plants. This individual will contribute to the development of world-leading advanced process control solutions that are deployed in the industry, both in South Africa and globally.\n \nJob description\nKEY PERFORMANCE INDICATORS:\n \n        Conduct research into advanced process control solutions, including modelling complex processes.\n        Identify opportunities for technology development and commercialization;\n        Play a support role in research projects and the development of products from that research;\n        Ensure that projects are executed on time and within budget;\n        Ensure that SHEQ procedures are strictly adhered to and that project work is executed with maximum overall technical efficiency;\n        Actively participate in training, guidance and motivation supplied to junior staff. Participate in team debates and technical discussions;\n        Produce professional reports, papers and presentations at local and international conferences;\n        Conceptualise, design, execute, analyse and troubleshoot with guidance from senior personnel;\n        Keep up-to-date at a professional level with technology and business developments that are relevant to the division’s interests\n \nMinimum requirements\nQUALIFICATIONS AND EXPERIENCE\nEngineer: B.Eng. Chemical, Mechanical or Electrical, or B.Sc Honours in an applicable field, e.g. physics or applied mathematics. Candidates must be willing to study further towards an M.Eng/M.Sc and PhD in a field aligned with Mintek’s research. An M.Sc or PhD in a field related to this post is preferred.\nMust be familiar with MATLAB or Python (prototyping of algorithms)\nThe following skills/knowledge will be advantageous:\nComputer programming in C , C# or VB.NET\nNumerical analysis, solving differential equations\nModelling of complex systems including mechanical, chemical and/or thermodynamic aspects.\n \nCOMPETENCIES:\nCommunication and presentation skills (expected to produce journal articles and conference papers)\nNumerical and quantitative skills\nSelf-driven\nPeople skills\nAbility to multi task\nAbility to get things done\nAbility to lead by example\nAdvanced Process Control\nProcess Modelling\n \n \nSALARY PACKAGE: negotiable\n \nCLOSING DATE: October 2023\n \nThe above-mentioned vacancy is also available on the Mintek website at www.mintek.co.za\n \nShould you not hear from us within one (1) month of the closing date, consider your application to be unsuccessful.\n \nMintek is an equal opportunity, affirmative action employer, whose aim is to promote representivity in all levels of occupational categories\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \nSCIENTIST/ENGINEER: PROCESS CONTROL - MAC\nListing reference: minte_000148\nListing status: Online\nApply by: 17 October 2023\n \nPosition summary\nIndustry: Scientific, Research & Development\nJob category: Other: Mining\nLocation: Randburg\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nMintek is seeking an individual who is experienced in the field of advanced process control systems and/or modelling to conduct research into advanced control systems and optimisation strategies for minerals processing and metallurgical plants. This individual will contribute to the development of world-leading advanced process control solutions that are deployed in the industry, both in South Africa and globally.\n \nJob description\nKEY PERFORMANCE INDICATORS:\n       Conduct research into advanced process control solutions, including modelling complex processes.\n       Identify opportunities for technology development and commercialization;\n       Play a leading role in minor and support role in major research projects and the development of products from that research;\n       Ensure that projects are executed on time and within budget;\n       Ensure that SHEQ procedures are strictly adhered to and that project work is executed with maximum overall technical efficiency;\n       Actively participate and play a support role in the training, guidance and motivation of junior staff. Participate in team debates and technical decisions;\n       Produce professional reports, papers and presentations at local and international conferences;\n       Conceptualise, design, execute, analyse and troubleshoot with minimal oversight;\n       Keep up-to-date at a professional level with technology and business developments that are relevant to the division’s interests\n \nMinimum requirements\nQUALIFICATIONS AND EXPERIENCE\n·        Engineer: B.Eng. Chemical, Mechanical or Electrical, or B.Sc Honours in an applicable field, e.g. physics or applied mathematics. Candidates must be willing to study further towards an M.Eng/M.Sc and PhD in a field aligned with Mintek’s research. An M.Sc or PhD in a field related to this post is preferred.\n·        Must be familiar with MATLAB or Python (prototyping of algorithms)\n·        2 years vocational experience following first graduation (BSc Hon/BEng).\n\n·        The following skills/knowledge will be advantageous:\nComputer programming in C , C# or VB.NET\nNumerical analysis, solving differential equations\nModelling of complex systems including mechanical, chemical and/or thermodynamic aspects.\n \nCOMPETENCIES:\n·        Communication and presentation skills (expected to produce journal articles and conference papers)\n·        Numerical and quantitative skills\n·        Self-driven\n·        People skills\n·        Ability to multi task\n·        Ability to get things done\n·        Ability to lead by example\n·        Advanced Process Control\n·        Process Modelling\n \n \nSALARY PACKAGE: negotiable \n \nCLOSING DATE: October 2023\n \nThe above-mentioned vacancy is also available on the Mintek website at www.mintek.co.za\n \nShould you not hear from us within one (1) month of the closing date, consider your applic ation to be unsuccessful.\n \nMintek is an equal opportunity, affirmative action employer, whose aim is to promote representivity in all levels of occupational categories\n \nPLEASE APPLY HERE",
                "SENIOR ENGINEER: NANOMINERALS UNIT - AMD\nListing reference: minte_000147\nListing status: Online\nApply by: 17 October 2023\n \nPosition summary\nIndustry: Scientific, Research & Development\nJob category: Other: Mining\nLocation: Randburg\nContract: Permanent\nRemuneration: Market Related\nEE position: Yes\n \nIntroduction\nMintek is seeking a highly skilled, detail-oriented Chemical Engineer to join the Nanominerals Unit within the Nanotechnology Group. The position entails the development of technologies for health, wastewater treatments and biosensors. Using her/his skill set, the candidate will work with the team to conduct technology and product development activities as well as up-scaling of materials synthesis in support of commercialization of new products for application in health, wastewater treatments and biosensors.\n \nJob description\nKEY PERFORMANCE INDICATORS:\nContribute to the innovation outputs (i.e. technologies, prototypes, products, and patents) of the Division.\nConduct technology and product development for application in health, sensors and wastewater treatment. The tasks include (but not limited to) reaction process designing and engineering, scaling-up, techno economic evaluations, prototype designing and validation processes.\nPlan methodology, equipment, material requirements and implement laboratory operations for the purpose of developing products and fabrication procedures that meet cost, product specification, and performance standards.\nAnalyse the root cause of a wide variety of failures related to issues arising in product development and validation processes.\nIdentify inefficiencies in scale-up of processes, develop and implement process and product improvement measures.\nReview new product plans and make recommendations for material selection based on design objectives.\nEngage with industry and identify needs of clients, assist in identifying opportunities for technology development and commercialization.\nSupervise and co-ordinate the activities of subordinate staff, to ensure that service of a high standard is rendered at full cost recovery.\nProvide technical and practical guidance in the execution of experiments.\nMust stay up to date and informed at an expert technical level with technology and business in the areas of the Division’s work.\nEnsure continuous growth and the provision of specialised training of junior staff to ensure that the professional skills are acquired to develop, deliver and support advanced water treatment products and technologies.\nEnsure that SHEQ procedures are strictly adhered to and that project work is executed with maximum overall technical efficiency.\n \nMinimum requirements\nJOB KNOWLEDGE AND EXPERIENCE:\n5 years' experience in research and development of chemical process engineering is a requirement.\nAt least 3 years’ experience in nanomaterials synthesis, chemical process design and product development.\nSystems thinking approach, design thinking and incorporating sustainability elements in product and process development\nWillingness to study, grow and be an expert in the field.\nTeam player who enjoys variation in tasks and has a passion for chemical  processing.\nAn affinity for planning and conducting new and innovative projects is essential.\n \nQUALIFICATIONS:\nMust possess an MSc /M Eng. degree in Chemical engineering.\nPhD will be an advantage.\nProfessional registration and voluntary association membership will be an advantage.\n \nBEHAVIOURAL COMPETENCIES:\nExcellent interpersonal skills.\nSelf-starter and critical thinker\nAbility to cope in a stressful and demanding environment.\nEffective communication of work, plans, and progress using written and verbal communication\nAbility to efficiently manage and prioritize multiple projects and coordinate material exchanges with end users\n \n \nSALARY PACKAGE: NEGOTIABLE  \n \nCLOSING DATE: OCTOBER 2023\n \nPlease apply via the Mintek website at www.mintek.co.za\n \nShould you not hear from us within one (1) month of the closing date, consider your application to be unsuccessful.\n \nMintek is an equal opportunity, affirmative action employer, whose aim is to promote representivity in all levels of occupational categories.\n \nPLEASE APPLY HERE"
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/national-credit-regulator-ncr_orig.jpg",
            "Href": "https://www.govpage.co.za/national-credit-regulator-ncr-vacancies-blog/national-credit-regulator-ncr-vacancies5190104",
            "Title": "gov-page: NATIONAL CREDIT REGULATOR (NCR) VACANCIES",
            "Content": [
                " \nNATIONAL CREDIT REGULATOR (NCR)\n ",
                "The National Credit Regulator (NCR) was established as the regulator under the National Credit Act 34 of 2005 (the Act) and is responsible for the regulation of the South African credit industry. It is tasked with carrying out education, research, policy development, registration of industry participants, i.e. credit providers, credit bureaux, alternative dispute resolution agents, payment distribution agents and debt counsellors, investigation of complaints, and enforcement of the Act. The Act requires the NCR to promote the development of an accessible credit market, particularly to address the needs of historically disadvantaged persons, low income persons, and remote, isolated or low density communities. The NCR invites applications from suitable candidates for the following position:\n \n \nSENIOR LEGAL ADVISOR- INVESTIGATIONS AND ENFORCEMENT (RE-ADVERTISEMENT) \nPaterson Grade: D-Lower \nSalary ranges from R405 200 – R769 900 maximum \n \nRequirements:\n▪ The suitable candidate must hold a four-year legal degree (LLB / BProc) Degree and must be an admitted attorney or advocate with substantial commercial litigation experience. \n▪ 5 years post admission litigation experience will be an added advantage. \n▪ The suitable candidate must have knowledge of debt counselling practices and processes. \n▪ The suitable candidate must have a minimum of five (5) years relevant working experience in a financial, regulatory, or legal environment. \n▪ A minimum of two (2) years in a supervisory role will be an added advantage. \n▪ Experience working within the credit industry will serve as an added advantage.\n▪ Insolvency procedure knowledge and experience will serve as an added advantage.\n \nDuties:\n▪ The successful candidate will deal with litigation matters, which will include complex and contentious matters, on behalf of the Investigations and Enforcement Department within the National Consumer Tribunal, High Court, SCA and Constitutional Court. \n▪ Assessment of investigation reports and evidence. \n▪ Drafting of pleadings and/or the necessary enforcement action on behalf of the NCR \n▪ Representation and litigation of matters on behalf of the NCR and the Department at the National Consumer Tribunal and/or Courts. \n▪ Provide support to the Investigations and Enforcement Manager in ensuring the department achieves its targets. \n▪ Handle complex complaints and enquiries referred by the Manager of the Department / Exco as and when required. \n▪ Oversee the enforcement team (Junior and – Legal Advisors) by providing technical inputs as well as monitoring performance. \n▪ Review of drafts and pleadings submitted by the enforcement team. \n▪ Providing guidance/training to inspectors, legal advisors, internal and external stakeholders. \n▪ Liaising with internal and external stakeholders. \n▪ Contract Management and review of performance in line with service level agreements. \n\n▪ Provide effective legal advice in respect of the NCA and other relevant legislation. \n▪ Weekly, monthly and quarterly report compilation of departmental performance. \n▪ Assist with development and implementation of departmental policies and procedures. \n▪ Legal Risk detection. \n▪ Participate in appropriate committees as and when required and provide the necessary legal inputs. \n▪ Draft and review Terms of Reference, Memorandums, Contracts, Service Level Agreements, Tenders, Settlement Agreements and Opinions. \n▪ Conduct research on legal matters impacting the NCA to ensure improved regulatory dispensation. \n▪ Budget monitoring. \n▪ Investigations and Report compilation when required to do so. \n▪ Ensure timeous delivery of agreed outcomes. \n \nTechnical Skills: \n▪ Knowledge of the National Credit Act and civil court procedures. \n▪ At least 5 years’ post admission litigation experience. \n▪ Good understanding of the South African Consumer Credit Market. \n▪ Supervisory skills. \n▪ Leadership skills. \n▪ Excellent writing ability. \n▪ Evaluative and problem-solving skills. \n▪ Computer literate and administrative skills. \n▪ Strong interpretative skills. \n▪ Research and presentative skills. \n▪ Contract Management Skills. \n▪ Time Management. \n \nPersonal Competencies: \nPresentable, professional, and confident while being diplomatic and tactful. \nCritical thinking. \nDependable.\nAbility to make decisions, give direction, provide solutions, take accountability, and accept criticism or corrections. \nMust be able to work in a team-oriented environment, manage conflict and promote teamwork. \nFocused and disciplined as well as results driven. \nWell-spoken with good communication and listening skills. \nFlexible and innovative. \nNegotiation skills. \nMust have strong personal and professional ethics with high levels of integrity. \nMust be able to work under immense pressure. \nMust be willing to travel if and when required. \nSupportive skills. \nStrong service oriented.\n \n \nClosing date: 13 October 2023 \n \nThe National Credit Regulator is an equal opportunity organisation which offers competitive market related packages. Suitable persons should send a detailed CV and cover letter quoting the relevant reference number to: COM-recruitment@ncr.org.za\nCorrespondence will only be entered into with shortlisted candidates. The National Credit Regulator reserves the right not to make an appointment. \n \nRef: SLAI/10/23",
                "The National Credit Regulator (NCR) was established as the regulator under the National Credit Act 34 of 2005 (the Act) and is responsible for the regulation of the South African credit industry. It is tasked with carrying out education, research, policy development, registration of industry participants, i.e. credit providers, credit bureaux, alternative dispute resolution agents, payment distribution agents and debt counsellors, investigation of complaints, and enforcement of the Act. The Act requires the NCR to promote the development of an accessible credit market, particularly to address the needs of historically disadvantaged persons, low income persons, and remote, isolated or low density communities. \nThe NCR invites applications from suitable candidates for the following position:\n \n \nLEGAL ADVISOR: INVESTIGATION & ENFORCEMENT (RE-ADVERTISEMENT) \nPaterson Grade: D- Lower \nSalary ranges from R405 200 – R769 900 maximum \n \nRequirements:\n▪ The successful candidate must hold a four-year Legal Degree, obtained from a South African University/ tertiary institution \n▪ The successful candidate must be an admitted Attorney and/or an Advocate registered with one of the provincial bar councils. The successful candidate must have a minimum of five (5) years post admission experience within a financial, regulatory and/or legal environment. \n▪ The successful candidate must have civil litigation experience acquired within a legal practice. \n \nDuties:\n▪ The successful candidate will deal with litigation matters, which will include complex and contentious matters, on behalf of the department from the National Consumer Tribunal, High Court, SCA and Constitutional Court. \n▪ Drafting of pleadings, reports and legal opinions. \n▪ Provide legal advice and assistance to specific issues related to the NCA and other related legislation. \n▪ Prepare and present cases at the National Consumer Tribunal and/or Courts. \n▪ Assessing investigation reports and advising on appropriate enforcement action.\n▪ Liaising with internal and external stakeholders. \n▪ Conducting research on legal issues concerning the consumer credit industry. \n▪ Provide administrative and legal support to the department. \n▪ Duties will also include the service and filing of documents and pleadings at the National Consumer Tribunal and/or Courts. \n \nTechnical Skills: \n▪ Knowledge of the National Credit Act and related legislation. \n▪ Knowledge of debt counselling procedures and provisions will be an added advantage. \n▪ Understanding of court processes. \n▪ Administrative, research, and negotiation skills will be an added advantage. \n▪ Computer literacy skills \n▪ Excellent writing and drafting skills \n \nPersonal Competencies: \n▪ Presentable, professional and confident. \n▪ Leadership skills. \n▪ Problem solving skills. \n▪ Must be able to work in a team oriented, highly stressful and fast paced environment, be able to manage conflict and promote team work. \n▪ Focused, disciplined and result driven. \n▪ Good communication skills. \n▪ Must have strong personal and professional ethics. \n \n \nClosing Date: 13 October 2023 \n \nThe National Credit Regulator is an equal opportunity organisation which offers competitive market related packages. Suitable persons should send a detailed CV quoting the relevant reference number to: COM-recruitment@ncr.org.za\n \nCorrespondence will only be entered into with short listed candidates. The National Credit Regulator reserves the right not to make an appointment. \n \nRef : IELA/10/23"
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        },
        {
            "ImgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/national-film-and-video-foundation-nfvf.jpg?1696901399",
            "Href": "https://www.govpage.co.za/national-film-video-foundation-nfvf-vacancies-blog/national-film-video-foundation-nfvf-vacancies4375467",
            "Title": "gov-page: NATIONAL FILM & VIDEO FOUNDATION (NFVF) VACANCIES",
            "Content": [
                " \nNATIONAL FILM & VIDEO FOUNDATION (NFVF)\n ",
                " \n \nTEMP: FINANCE MANAGER\nReporting to: Chief Financial Officer\nRef: RECR/FM/001\nDuration: 12 months\n \nJob Purpose:\nProvide support to the Chief Financial Officer (CFO) on the management of the organisation’s finances, including inputs into the NFVF’s financial strategy, funding strategy, preparation and submission of financial reports and ensuring financial risk is managed, and best practice is applied in terms of governance and compliance.\n \nQualification & Experience:\n• B Com Hons in Accounting, Finance, Auditing or related field;\n• 5-8 years’ experience of which at least 5 as a Finance Manager;\n• Experience in financial management;\n• Experience with Sage Evolution, Caseware;\n• Experience in Supply Chain Management and application of PPPFA;\n• Experience and expertise in public sector accounting frameworks (GRAP);\n• Experience in management & development of people;\n• Experience in the application of the PFMA and its regulations;\n• Experience in presenting to both internal and external stakeholders;\n• Experience in auditing and/or co-ordination of audits (as client); and\n• Experience in dealing with National Treasury, Office of the Auditor General, relevant Government department/s and other relevant key stakeholders.\n \nKey Responsibilities:\nFinancial Strategy Input:\n• Submit inputs into the financial strategy of the NFVF to support organizational annual performance plans and strategies;\n• Analyse organisation’s strategic plans;\n• Monitor implementation of the financial strategy to track progress against targets and identify problems should they arise and recommend remedial actions.\n \nFund-Raising Strategy:\n• Develop and implement the fund-raising strategy for the organisation for review by CFO;\n• Identify sources of additional funding over and above the grant received from the Department of Sport, Arts & Culture;\n• Benchmark with other entities of similar size & develop an implementation plan to execute and roll out the strategy;\n• Ensure execution thereof with detailed milestones and targets;\n• Engage with stakeholders (e.g. in the film and video industry, Department of Sport, Arts &\nCulture) regarding the management of the fund; and\n• Ensure reporting requirements are met – monthly, quarterly and annually.\n• Provide support to the CFO on the management of the film fund.\n \nFinancial Systems & Processes:\n• Develop, implement and maintain financial systems through the development of financial policies, procedures & systems and ensure that they are benchmarked with leading practices;\n• Review and monitor financial policies, procedures & systems ensuring compliance;\n• Produce monthly, quarterly and annual financial reports, budgets, financial statements;\n• Co-ordinate monthly and quarterly meetings with Heads of Departments regarding performance against budgets and projections;\n• Review monthly payroll reports and third-party payments;\n• Submits compliant annual financial statements to National Treasury, Auditor-General, DSAC and other stakeholders;\n• Manage the safeguarding of company assets, ensuring that asset verification takes place regularly;\n• Ensure compliance with all relevant and key legislation, regulations and accounting practices;\n• Ensure budgeting is aligned to Treasury MTEF processes; and\n• Ensure compliance with PFMA, National Treasury regulations and GRAP.\n \nFinancial Risk Management:\n• Oversee and co-ordinate risk management in terms of finance;\n• Maintain the operational risk register for the finance business unit to ensure implementation of the risk treatment plans;\n• Submit a quarterly review of the risk register, treatment plans and audit action plan for review by the CFO;\n• Engage with internal and external auditors on all issues related to audit findings;\n• Co-ordinate audits as the key contact/liaison with auditors; and\n• Maintain and update the audit improvement plan for the organization and submit to the CFO on a quarterly basis.\n \nStaff Management:\n• Ensure performance contracts and reviews for subordinate staff take place in terms of policy;\n• Provide input into performance appraisal reports; and\n• Identify training and development needs and opportunities for subordinate staff.\n \nSkills & Behavioural Attributes:\n• Financial Management;\n• Risk Management;\n• Project Management;\n• Confidentiality;\n• People management skills;\n• Planning and organizational skills;\n• Attention to detail; and\n• Practical knowledge of the Public Sector.\n \n \nSuitably qualified and experienced candidates are invited to submit their abridged curriculum vitae via email to vacancies@nfvf.co.za or fax on 0865197585 by no later than 22 October 2023.\n \nNote: Correspondence will be made only with the shortlisted candidates and no late applications will be considered.\nIt is the applicant’s responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA).",
                "TEMP: IT MANAGER\nReporting To: Chief Financial Officer\nJob Ref: RECR/ITM/002\n \nJob Purpose:\nResponsible for aligning the ICT operation with the strategic and business objectives of the NFVF. Manage and coordinate the full scope of the Information and Communication Technology function, overseeing the implementation of infrastructure, systems, and procedures to enable an efficient ICT operations function that will ensure that all ICT systems and processes support the strategic objectives and mandate of NFVF. This includes:\n• Creating and translating the ICT Strategy and Plan, the ICT Governance Framework, and legal requirements into effective ICT Operations;\n• Ensuring optimal reliability and availability of Information and Communication Technology infrastructure and systems;\n• Providing enabling technologies to improve the way in which the NFVF accomplishes its business and improve operating efficiency;\n• Ensuring that all systems and applications are secure with minimal exposure to risk factors;\n• Effective planning, management, and co-ordination of ICT SLA’s and projects; and\n• Providing ICT support, training, and awareness to NFVF staff.\n \nQualification & Experience:\n• Minimum Degree / Honours in Information and Communication Technology (NQF level 7- 8);\n• 5-8 years’ relevant experience\n• Desktop Administration (MCSE, MCSA etc.);\n• Network Administration – infrastructure and security (CCNA, CCNP, CCNE, Arista ACE, Fotinet etc.);\n• Firewall Administration (CCNP, MSCE, MCSA etc.);\n• Service Management (ITIL or equivalent);\n• Information Security Management (CISM etc.);\n• COBIT 5 or later;\n• Governance of Information and Communication Technology Policy Framework;\n• ICT Charter;\n• Microsoft Office Applications; and\n• Windows Server;\n• ICT domain;\n• Management;\n• ICT Project Management;\n• Roll-out of new systems and technologies;\n• Management, Implementation, and Maintenance of ICT systems;\n• ISO (International Organization for Standardization);\n• Service Management;\n• COBIT 5 or later; and\n• Sage Evolution, VIP (Business Management, Accounting, Payroll, HR etc.).\n \nKey Responsibilities:\nICT Governance and Policy Management:\n• Develop the ICT Strategy for review by the CFO and approval by the Accounting Authority;\n• Align and implement ICT Strategy and policies to support NFVF strategy, programmes, and performance plans;\n• Develop, maintain and review ICT policies and procedures to ensure compliance with legislation, International Best Practice, and relevant ICT Frameworks such as ITIL, COBIT, ISO 27001, ISO 31000 etc;\n• Develop, compile, implement and maintain the NFVF ICT Strategic Plan, three (3) year ICT Plan, Annual Performance and Operational Plan;\n• Develop, implement, and maintain the NFV ICT Governance Framework and Strategy according to the defined guidelines of the Corporate Governance of ICT Policy Framework and best practice;\n• Compile and implement ICT policies, processes and standard operating procedures for NFVF;\n• Ensure compliance to policies, processes and standard operating procedures;\n• Managing the development and implementation of the ICT operational plan;\n• Research, investigate and recommends ICT and Business Intelligence solutions to address business needs;\n• Conduct or oversee benchmarking exercises to ensure that NFVF ICT governance processes are aligned with best practice for key frameworks. (COBIT etc.).\n \nICT Systems and Infrastructure Management:\n• Ensure and maintain the reliability of the ICT Infrastructure and Systems;\n• Monitor and improve ICT infrastructure and system availability through the Business Continuity Plan, Disaster Recovery Plan and Backups;\n• Reduce recovery turnaround times as result of adverse circumstances;\n• Investigate and recommend architecture, technologies, systems, hardware, and software for NFVF requirements;\n\n• Implement and maintain ICT platforms for internet access, e- mails and Sage Evolution, VIP, Praxis, Mimecast, Servers, and applications;\n• Establish backup systems (Veeam, Windows Backup, DPM and similar applications), with suitable retention periods, regular testing and resolving of failures;\n• Oversee and enforce maintenance and repair agreements and schedules (inclusive of server maintenance); and\n• Monitor performance of ICT systems and make recommendations for improvement of ICT infrastructure.\n \nContract/Supplier and Project Management:\n• Negotiate Service Level Agreements and provide recommendations to the CFO/ CEO;\n• Ensure the establishment of ICT Service Level Agreements and performance criteria, together with Supply Chain Management;\n• Manage Outsourced Service Providers and Service Level Agreements for ICT services;\n• Monitor quality assurance according to deliverables as indicated in contractual agreements and SLA’s;\n• Establish and implement a Service Providers performance management and review system and manage the performance of both internal and external ICT resources;\n• Ensure that all SLA agreements are met and penalties or corrective action is imposed;\n• Oversee the roll-out of new systems and technologies; and\n• Lead and manage ICT projects and the deployment of infrastructure, technologies and services.\n \nICT Risk and Security Management:\n• Establish, oversee and co-ordinate an ICT Risk Framework and Information Security Management System (ISMS);\n• Implement risk and security assessment tools and technologies;\n• Identify critical ICT risks facing the organisation, divisions, and departments;\n• Propose appropriate strategies and interventions to mitigate risk; Maintain an Operational Risk Register for the ICT business unit with treatment plans;\n• Oversee the development and maintenance of the Operational Risk Register for ICT;\n• Oversee the implementation of ICT risk treatment plans;\n• Monitor and review the Risk Register, Treatment Plans and Audit Action Plan for review by the CFO;\n• Submit a quarterly report on control effectiveness, status of risks and progress of corrective action implementation;\n• Compile ICT Business Continuity Management plans for dealing with adverse situations to prevent, minimise and recover from potential disruption;\n• Establish, review and enhance systems controls to strengthen ICT control;\n• Perform regular IT Health Checks (ITHC) to identify and expose security vulnerabilities (hacking tests etc.);\n• Manage and monitor ICT Security with regard to user devices, access, system vulnerability, cybercrime, viruses, data leakage etc;\n• Maintain firewalls and security infrastructure;\n• Implement measures and technology to ensure security, confidentiality and appropriate access to intellectual property, information, and data, inclusive of POPI Act;\n• Oversee the Information Systems Audit for NFVF to monitor compliance with approved policy, procedures, and protocol; and\n• Address all audit queries raised by auditors in the ICT reviews and update the audit improvement plan accordingly.\n \nICT Asset Management:\n• Maintain an updated ICT asset register;\n• Undertake a quarterly review and verification of ICT assets;\n• Management of inventory of ICT assets and equipment;\n• Establish and implement processes, procedures, frameworks, and systems to proactively and strategically manage ICT assets throughout its lifecycle (acquisition, usage, maintenance, and retirement); and\n• Manage the responsible, cost-effective, and optimal use of ICT fixed and operational assets to ensure that every asset is properly used, maintained, upgraded, and disposed of at the end of its lifecycle.\n \nFinancial and Resources Management / Cost Control:\n• Analyse organisation ICT requirements and compile the ICT budget in consultation with all divisions and manage the implementation thereof;\n• Conduct reviews of the mid-term budgets and re-prioritise resources;\n• Approve ICT procurement for NFVF within delegation of authority (up to R1mil);\n• Manage and control the ICT Function’s budget in line with PFMA and protocols;\n• Drive ICT sustainability initiatives, minimising costs, and identifying cost efficiencies without compromising on security and risk;\n• Manage and control ICT projects and initiatives within budget parameters;\nTrack, reconcile and consolidate ICT expenses;\n• Control, keep track of and reconcile project expenses;\n• Assist Supply Chain Management with tender processes for the purchase of ICT equipment, material, and services; and\n• Draft the technical requirements and specifications for ICT tenders and assist in the technical evaluation.\n \nICT Support / Service Management:\n• Provide first line ICT Help Desk and technical support to the business and end users and escalate as appropriate to the responsible Service Provider;\n• Oversee and manage contracts for day-to-day ICT support and service management inclusive of:\no Install, configure and support all Microsoft desktop and server operating systems and application software\no Respond to and resolve support calls\no Assistance to end-users\no Install desktop, servers, equipment, hardware (desktop and server) infrastructure and troubleshoot challenges relates to these\n• Establish ICT training needs and schedule accordingly;\n• Provide end-user training and awareness on ICT equipment, ICT desktop systems and security; and\n• Conduct research, identify and keep abreast of technological trends, new technology, legislation and regulations etc.\n \nReporting / Presentations:\n• Ensure that ICT performance reports are formulated and circulated as per management requirements and according to NFVF policies and procedures;\n• Compile monthly, quarterly, and yearly reports for the ICT function;\n• Prepare Key Control Dashboard reports for quarterly and annual reporting to the relevant forums;\n• Adhere to regulatory reporting, filing and submission guidelines and schedules;\n• Compile Reports relating to proposals, investigations, research, problem identification etc. to Accounting Authority and Committees, CEO, CFO etc.; and\n• Presentations to Management Committee, Audit Committee, Accounting Authority (various topics - proposals, performance, audits etc.).\n \nFunction Leadership/Staff Management:\n• Conduct performance contracting and performance reviews according to the policy, performance management cycle and schedule;\n• Establish performance review mechanisms and meetings to provide feedback, share information and plan achievement of objectives; and\nEnsure that employees in the ICT section have an active, needs- driven Personal Development Plan (PDP) and implement staff training and development using the identified training and development opportunities.\n \nSkills & Behavioural Attributes:\n• Information systems and operations;\n• Risk Management;\n• Project Management;\n• Ethical conduct;\n• People management and empowerment;\n• Strategic thinking and planning;\n• Quality and service focused;\n• Innovation.\n \n \nSuitably qualified and experienced candidates are invited to submit their abridged curriculum vitae via email to vacancies@nfvf.co.za or fax on 0865197585 by no later than 22 October 2023.\n \nNote: Correspondence will be made only with the shortlisted candidates and no late applications will be considered.\nIt is the applicant’s responsibility to have foreign qualifications evaluated by the South African Qualifications Authority (SAQA)."
            ],
            "PostedDate": "9/10/2023",
            "Iframe": ""
        }
    ],
    "Departments": {
        "city of johannesburg vacancies": "https://www.govpage.co.za/city-of-johannesburg-metropolitan-municipality-vacancies-blog/city-of-johannesburg-vacancies8940036",
        "city of johannesburg vacancies (re-advertisement of short-term contract (stc) circulars: • 015/2023 • 016/2023)": "https://www.govpage.co.za/city-of-johannesburg-metropolitan-municipality-vacancies-blog/city-of-johannesburg-vacancies-re-advertisement-of-short-term-contract-stc-circulars-o-0152023-o-0162023",
        "ethekwini metro vacancies": "https://www.govpage.co.za/ethekwini-metropolitan-municipality-vacancies-blog/ethekwini-metro-vacancies6669982",
        "ethekwini metro youth driver’s licence programme": "https://www.govpage.co.za/ethekwini-metropolitan-municipality-vacancies-blog/ethekwini-metro-youth-drivers-licence-programme",
        "ethekwini metro database for employment candidates for people with disabilities": "https://www.govpage.co.za/ethekwini-metropolitan-municipality-vacancies-blog/ethekwini-metro-database-for-employment-candidates-for-people-with-disabilities",
        "agricultural research council (arc) vacancies": "https://www.govpage.co.za/agricultural-research-council-arc-vacancies-blog/agricultural-research-council-arc-vacancies4100622",
        "armaments corporation of south africa (armscor) vacancies": "https://www.govpage.co.za/armaments-corporation-of-south-africa-armscor-vacancies-blog/armaments-corporation-of-south-africa-armscor-vacancies6307876",
        "commission for conciliation, mediation and arbitration (ccma) vacancies": "https://www.govpage.co.za/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies-blog/commission-for-gender-equality-cge-vacancies",
        "commission for gender equality (cge) vacancies": "https://www.govpage.co.za/commission-for-gender-equality-cge-vacancies-blog/commission-for-gender-equality-cge-vacancies1723796",
        "financial intelligence centre (fic) vacancies": "https://www.govpage.co.za/financial-intelligence-centre-fic-vacancies-blog/financial-intelligence-centre-fic-vacancies2780114",
        "financial sector conduct authority (fsca) vacancies": "https://www.govpage.co.za/financial-sector-conduct-authority-fsca-vacancies-blog/financial-sector-conduct-authority-fsca-vacancies3635942",
        "government employees medical scheme (gems) vacancies": "https://www.govpage.co.za/government-employees-medical-scheme-gems-vacancies-blog/government-employees-medical-scheme-gems-vacancies6936503",
        "government employees pension fund (gepf) vacancies": "https://www.govpage.co.za/government-employees-pension-fund-gepf-vacancies-blog/government-employees-pension-fund-gepf-vacancies4616696",
        "housing development agency (hda) vacancies": "https://www.govpage.co.za/housing-development-agency-hda-vacancies-blog/housing-development-agency-hda-vacancies8468132",
        "independent regulatory board for auditors (irba) vacancies": "https://www.govpage.co.za/independent-regulatory-board-for-auditors-irba-vacancies-blog/independent-regulatory-board-for-auditors-irba-vacancies4746245",
        "mintek vacancies": "https://www.govpage.co.za/mintek-vacancies-blog/mintek-vacancies2140372",
        "national credit regulator (ncr) vacancies": "https://www.govpage.co.za/national-credit-regulator-ncr-vacancies-blog/national-credit-regulator-ncr-vacancies5190104",
        "national film & video foundation (nfvf) vacancies": "https://www.govpage.co.za/national-film-video-foundation-nfvf-vacancies-blog/national-film-video-foundation-nfvf-vacancies4375467"
    }
}