{
    "title": "govpage-public-sector",
    "blogPosts": [
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/gauteng-social-development_orig.jpg",
            "href": "https://www.govpage.co.za/gauteng-department-of-social-development-vacancies-blog/gauteng-department-of-social-development-bursaries-and-financial-assistance-for-study-purpose-2024",
            "title": "GAUTENG DEPARTMENT OF SOCIAL DEVELOPMENT BURSARIES AND FINANCIAL ASSISTANCE FOR STUDY PURPOSE - 2024",
            "content": [
                " \nGAUTENG DEPARTMENT OF SOCIAL DEVELOPMENT\n \nDepartment of Social Development Bursaries and Financial Assistance for Study Purposes - 2024\n \nThe Gauteng Department of Social Development is offering bursary opportunities to deserving students who reside in Gauteng to promote skills development and quality education. Students must excel academically have a passion to pursue a career in the Social sector.\n ",
                " \nBursaries will be awarded within the following fields of study to students who are not currently benefiting from any other bursary scheme:\n• Community Development.\n• Financial Management.\n• Demography and Population Studies.\n• Clinical Psychology; and\n• Occupational Therapy.\n \nThe bursary will cover the following expenses: registration, tuition, prescribed books, and study material.\nThe selection of candidates will be based on, but not limited to the following:\n• Permanent residents within the Gauteng Province for at least one year prior to application,\n• South African citizen,\n• Currently studying or intend on studying full-time in one of the listed fields,\n• Accepted to study at a recognized tertiary institution,\nApplication forms can be collected and submitted at any Gauteng Social Development office/institution.\n \nYouth from all race and gender groups, youth leaving child and youth care facilities as well as youth with disabilities who meet the minimum entry requirements are encouraged to apply.",
                "Application forms can be collected and submitted at any Gauteng Social Development office/institution.\n \nThe following documents should accompany applications:\nCertified ID document, certified Matric certificate, certified copies of all education qualifications, proof of tertiary acceptance/proof of registration, motivational letter, proof of residence, Parents / Guardians proof of income (pay slips or affidavit if unemployed. Independent Electoral Commission (IEC) voting district verification printout (that indicates the voting station and ward details) accessible from the IEC website: https://www.elections.org.za/pw/\n \nAll successful applicants will be required to enter into contractual agreements with the Department.\n \nENQUIRIES: Khabo Malgas (011) 355 7967/064 967 8522, Dikeledi Kutu (011) 355 7616/ 064 953 5099, Thoko Mcira (011) 355 7659/ 064 967 8388\n \nClosing date: 20 October 2023\n \nIf you do not receive any response from the Department within 3 months, Please accept that your application was unsuccessful."
            ],
            "postedDate": "11/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/kwazulu-natal-transport_orig.jpg",
            "href": "https://www.govpage.co.za/kwazulu-natal-transport-vacancies-blog/kwazulu-natal-department-of-transport-thuthuka-skills-development-drivers-licence-programme",
            "title": "KWAZULU NATAL DEPARTMENT OF TRANSPORT - THUTHUKA SKILLS DEVELOPMENT DRIVER’S LICENCE PROGRAMME",
            "content": [
                "KWAZULU NATAL DEPARTMENT OF TRANSPORT - THUTHUKA SKILLS DEVELOPMENT DRIVER’S LICENCE PROGRAMME",
                " \nClosing Date: 17 October 2023"
            ],
            "postedDate": "11/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/limpopo-department-of-agriculture-lda_orig.png",
            "href": "https://www.govpage.co.za/limpopo-agriculture-vacancies-blog/limpopo-department-of-agriculture-vacancies2097342",
            "title": "LIMPOPO DEPARTMENT OF AGRICULTURE VACANCIES",
            "content": [],
            "postedDate": "11/10/2023",
            "iframe": "https://drive.google.com/file/d/1XzEBNTImu8O4BivE7t1F8Y5vc16gLltt/preview"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/limpopo-department-of-health_orig.png",
            "href": "https://www.govpage.co.za/limpopo-health-vacancies-blog/limpopo-department-of-health-student-nurse-training-for-the-diploma-in-nursing-general-r171-for-the-academic-year-2024",
            "title": "LIMPOPO DEPARTMENT OF HEALTH STUDENT NURSE TRAINING FOR THE DIPLOMA IN NURSING: GENERAL (R.171) FOR THE ACADEMIC YEAR 2024.",
            "content": [],
            "postedDate": "11/10/2023",
            "iframe": null
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/city-of-joburg_orig.jpg",
            "href": "https://www.govpage.co.za/city-of-johannesburg-metropolitan-municipality-vacancies-blog/city-of-johannesburg-vacancies8668436",
            "title": "CITY OF JOHANNESBURG VACANCIES",
            "content": [
                "CITY OF JOHANNESBURG\n \nGroup Corporate & Shared Services: Group Human Capital Management\n6th Floor, B Block Metropolitan Centre, 158 Civic Boulevard, Braamfontein\nPO Box 1049 Johannesburg, South Africa, 2000\nTel +27(0) 11 407 6111 - Fax +27(0) 11 339 1878\nwww.joburg.org.za\n ",
                " \n \nVACANCY CIRCULAR 074/2023 \n \nThis Vacancy is open to Employees of the City of Johannesburg and External Candidates \n \n \nCLOSING DATE: TUESDAY, 24 OCTOBER 2023 \n \n WE HAVE EXCITING CAREER OPPORTUNITIES FOR: \nPERMANENT POSITIONS: \nMANAGER: PUBLIC PROGRAMMES \nMANAGER: PUBLIC PROGRAMMES (DIGITIZATION) \n \nAPPLICATION REQUIREMENTS \n• Complete the online job application form and attach all relevant and updated documents (Certified Qualification/s/Certificates, ID, and CV). \nApplicants should take note that they can be required to provide proof of original documents during the selection process. • You will be requested to provide a brief description of your work experience relating to the vacancy. \n• Applicants with membership to professional bodies need to provide a membership number and expiry date. \n• If you are an internal applicant, your employee number will be required. \n• Applicants are advised to use Google Chrome when applying for CoJ positions. \n \nDISCLAIMER\nThe City of Johannesburg is currently recruiting and will not demand payment in any form for any job placement. All vacancies are advertised in newspapers and on the CoJ website. \nThe City of Johannesburg applies the principles of employment equity as per the National legislation and policy guidelines and will consider designated groups in line with these requirements. We are an equal-opportunity employer. \nBy submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. \nHowever, registering your CV and/or receipt and acknowledgment of any kind shall not be an indication that your application will be successful and/or lead to employment. \nThe City of Johannesburg shall not be liable for any damage, loss, or liability of whatsoever nature arising from your use of the job opportunity section of this website. \nThe City of Johannesburg reserves the right not to make an appointment. \nAny misrepresentation or failure to disclose material information on the application form or CV will automatically disqualify your application. \n \n \n \nMANAGER: PUBLIC PROGRAMMES \nDEPARTMENT: Community Development \nBRANCH: Arts, Culture and Heritage \nDESIGNATION: Manager: Public Programmes \nREMUNERATION: R44 693,36 pm (basic salary, excluding benefits) \nLOCATION: cnr King George & Klein Street, Joubert Park, Johannesburg \n \nMinimum Requirements: \nBachelor’s degree in Museum Studies, Arts, or Marketing or Project Management at NQF level 7; \n5 – 7 years experience working in arts, culture and heritage programmes, experiential knowledge of public programmes in the heritage sector and/or creative industries, cultural development, marketing and promotions of public programmes; \nValid driver’s license. \n \nPrimary Function:\nManage the public programmes for museums of the Directorate. Coordinate the design and implementation of museum programmes of the City. Coordinate the virtual programmes for museums and galleries. Manage and coordinate museum programmes in various museums and galleries. Interface with all Chief Curators on the public programmes for the respective museums. Coordinate the marketing and publicity of museum programmes and coordinate the marketing platforms for museums and galleries. Track, collate and report on visitor numbers to public programmes within museums. Liaise with stakeholders and mobilise resources for museums and galleries. Contribute to the museum policy development in the Directorate. \n \nKey Performance Areas: \nManage the public programmes for museums of the Directorate; \nCoordinate the design and implementation of museum programmes of the City; \nCoordinate the virtual programmes for museums and galleries; \nManage and coordinate museum programmes in various museums and galleries; \nSupervise the staff responsible for public programmes in museums; \nManage the marketing and publicity of public programmes and coordinate the marketing platforms for museum and galleries; \nLiaise with stakeholders in the Museum and Heritage Sectors; \nContribute to the cultural policy making in the Directorate; \nManage budgets and expenditure for specified heritage and museum projects; \nWrite reports to Council; \nProvide input to the budgeting process. \n \nLeading Competencies: \nComputer literacy (MS Office Packages, including Word, Excel, PowerPoint); \nDatabase skills; \nMarketing skills; \nGood written and oral communication skills in English and must be able to communicate and coordinate effectively with other stakeholders; \nAttention to detail and high levels of accuracy and excellent planning, organising, coordinating and time management skills. \n \nCore Competencies: \nKnowledge of arts, culture and heritage development and public programmes; \nProgramme Design and Implementation; \nMarketing and Promotion of arts, culture and heritage programmes; \nManaging and promotion of Flagship Heritage Programmes; \nKnowledge of online and virtual programming in the arts, culture and heritage; \nCollaborative/Teamwork, Values and Integrity, Attention to detail, and quality-focused; \nCustomer and Service Delivery Management (Batho Pele) Ethics, Professionalism; \nImpact and Influence according to City’s protocols, legislation, and standards. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/14tdV7vT4T5SfdgAk_6wuMgew554\nAPPLY ONLINE VIA THIS LINK: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Thato Sepuru \nTel No: 011 407 7198 \nCLOSING DATE: TUESDAY, 24 OCTOBER 2023\n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation, \nEmployment record verification, \nCriminal check, \nIdentity validation. \n \n \n \nMANAGER: PUBLIC PROGRAMMES (DIGITIZATION) \nDEPARTMENT: Community Development \nBRANCH: Arts, Culture and Heritage \nDESIGNATION: Manager: Public Programmes (Digitization) \nREMUNERATION: R44 693,36 pm (basic salary, excluding benefits) \nLOCATION: 21 Lillian Ngoyi Street, Newtown, Johannesburg \n \nMinimum Requirements: \nBCom Informatics, Information Technology Management of Information Technology Communication and Information Management Tertiary qualification in Information Science from a university at NQF level 7 (Degree, BCompt, Bsc Computer Science, Bsc IT, BIT); \n5 – 7 years’ working in IT management; \nExperience in managing back-end support for virtual platforms, electronic management systems and portals; \nManaging the scope for digitization for public programmes and Museum Information systems; \nAt least 2 years management experience at middle management level; \nAt least 5 years working experience as an Information professional, preferably in an arts or heritage environment, including experience with information systems and standards for museum collection management, digital imaging, Web management and electronic records management; \nExperience end-user of IT, including operating systems, software, servers, networks and peripherals; \nCulture and heritage experience and knowledge of national legislation for heritage, copyright, public records etc.; \nValid driver’s license. \n \nPrimary Function:\nPlan, lead and direct the digitization of public programmes, events, museum collections and special programmes, through the design and development of policies, systems, procedures and controls, enabling the Directorate to create, manage, disseminate and act on core business information, in line with international best practices and legislative requirements, to accomplish the Directorate’s objectives and service to clients. \n \nKey Performance Areas: \nIdentify and define the immediate, short- and long-term objectives/plans associated with digitization of public programmes, events, museum collections and special programmes; \nDevelop, administer and maintain information systems for the implementation of public programmes and heritage collections; \nManage the Photography of all Public Programmes and Museum collection and Design a digital image archives for the Directorate’s business needs, e.g. exhibitions, publicity and the Web; \nManage a virtual Public Programme through various platforms including Social Media, Website and Intranet pages for the Directorate to ensure access to e-services, electronic information, e-business and e-commerce for the arts, culture and heritage sectors; \nImplement and administer the CoJ Electronic Records management System for business records; \nDirect and control the professional, technical and operational outcomes associated with the information services function; \nManage information technology needs particularly specialist needs not supported under the City’s IT contract. \n \nLeading Competencies: \nComputer literacy (MS Office Packages, including Word, Excel, PowerPoint); \nNetworking skills; \nGood written and oral communication skills in English and must be able to communicate and coordinate effectively with other stakeholders; \nAttention to detail and high levels of accuracy and excellent planning, organising, coordinating and time management skills. \n \nCore Competencies: \nKnowledge of Digitization; \nKnowledge of Museum Information Systems; \nKnowledge of Web management and Electronic records management; \nKnowledge of Project management; \nKnowledge of Administration; \nKnowledge of Public relations; \n \nCollaborative/Teamwork, Values and Integrity, Attention to detail, and quality-focused; \nCustomer and Service Delivery Management (Batho Pele) Ethics, Professionalism; \nImpact and Influence according to City’s protocols, legislation, and standards. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1ztyQQy0DRhaWZnJpwkKe1gew554\nAPPLY ONLINE VIA THIS LINK: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Thato Sepuru \nTel No: 011 407 7198 \nCLOSING DATE: TUESDAY, 24 OCTOBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation, \nEmployment record verification, \nCriminal check, \nIdentity validation. \n \n\n \n \n ",
                " \n \n \n \nRE-ADVERTISEMENT TO VACANCY CIRCULARS:\n• 065/2023\n• 067/2023\n• 068/2023\n• 069/2023\n \nThe City of Johannesburg (CoJ) advertised positions on the above-mentioned circulars published on Jozinet, website and social media. Due to the network problems in the past two weeks, CoJ was not able to receive job application forms completed online and attachments of documents. Applicants were also unable to upload the required information as per the job advertisements. \nCoJ would like to extend the closing date of all the circulars affected. Applicants who applied previously are advised to re-apply. \n \nPLEASE NOTE THAT THE CLOSING DATE OF THE ABOVE CIRCULARS ARE EXTENDED TO 19 OCTOBER 2023 \n \nApplicants are advised to use Google Chrome when applying for CoJ positions. \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nCLOSING DATE: THURSDAY, 19 0CTOBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation and \nEmployment record verification, \nCriminal check, and Identity validation. \n \nThe inconvenience caused is regretted.\n \n \n \n \n ",
                " \n \n \n \nCALL FOR NOMINATIONS FROM THE MEMBERS OF THE PUBLIC TO FILL THE POSITION OF INTEGRITY COMMISSIONER FOR THE CITY OF JOHANNESBURG METROPOLITAN MUNICIPALITY\n \nThe speaker of the Council hereby calls for nominations from the members of institutions and civil society to fill the position of the Integrity Commissioner in the Metropolitan Municipality.\n \n1. Requirements for the Position\nTo qualify for the nomination, the nominee shall:\na) Be a person of integrity and honesty;\nb) Be in possession of a B degree or equivalent;\nc) Possess knowledge of law, public policy, politics and socio-economic issues;\nd) Be a South African Citizen;\n2. Conditions of Appointment\na) The Integrity Commissioner shall be appointed for a period of five (5) years;\nb) They shall not remain in Office for more than ten (10) years;\nc) They shall be assisted by staff members assigned by the Secretary to Council for the work of their Office;\nd) Their remuneration and conditions of service shall be determined by the Secretary to Council in consultation with the City Manager;\n3. Functions of the Integrity Commissioner\n3.1\na) The Integrity Commissioner may on their own accord investigate any alleged violation of the Code of Conduct by any councillor in so far as such violation relates to the disclosure and declaration of financial interest by the councillor;\nb) Should the Integrity Commissioner find evidence of a violation, they must report the facts and conclusions to the Ethics & Disciplinary Committee of Council;\nc) The Integrity Commissioner shall:\ni. Open and keep a register called the Register of Financial Interests;\nii. Record in the Register particulars of Councillors’ registrable interests;\niii. Amend any entries in the Register as and when necessary; and\nd) Perform other duties as and when assigned by the Ethics Committee within the ambit of the Code.\ne) The integrity Commissioner shall submit quarterly reports to the Ethics Committee on the performance of their functions.\n3.2 Advice and Counsel to Councillors\na) A councillor may approach the Integrity Commissioner to obtain personal advice and counsel on any matter related to compliance with the Code of Conduct, including compliance with the requirements of the Register of Financial Interests.\nb) All sessions of advice and counsel between the Integrity Commissioner and Councillor shall be confidential.\nc) The Integrity Commissioner shall report to the Committee the number of times he has had advice and counselling sessions over a given time period.\nd) When the Integrity Commissioner during an advice and counselling session realizes that a violation had been committed by the councillor, the Integrity Commissioner shall reserve the right to keep that matter confidential, provided the violation is amended within an agreed time period.\n4. Independence and Impartiality\nThe Integrity Commissioner shall act independently and impartially.\n5. Nominations Particulars\nWritten nominations must include a cover letter, and a comprehensive Curriculum Vitae providing the following details of the nominee:\ni. Full names, identity number and gender;\nii. Contact details, including physical address, telephone and cellular phone numbers and email address;\niii. Relevant previous experience;\niv. Copies of academic qualifications;\nv. Copies of identity book and driver’s license;\nvi. Written acceptance by the nominee\n \n \nALL ENQUIRIES MUST BE FORWARDED TO THE FOLLOWING OFFICIALS OF THE CITY OF JOHANNESBURG:\nSharon Gardner (011) 407 6294 at SharonG@joburg.org.za\nTebogo Mogodiri (011) 407) 6002 at Tebogor@joburg.org.za\n \nAll applications will be through the website using this link: https://share-eu1.hsforms.com/1fWYpMHicQBiGQcDhyrUEEAew554 Or visit www.joburg.org.za and click on Vacancies.\n \nCLOSING DATE FOR APPLICATIONS\n \nFRIDAY, 20 OCTOBER 2023\n \nIssued by: The Acting Secretary to Council \nAndile Gobinca\n \n \n \n \n ",
                " \n \n \n \nRE-ADVERTISEME NT CIRCULAR 057/2023 \n \nThis Vacancy is open to Employees of the City of Johannesburg and External Candidates \n \nCLOSING DATE: TUESDAY, 24 OCTOBER 2023\n \nWE HAVE AN EXCITING CAREER OPPORTUNITY FOR: \nPERMANENT POSITION \nSECRETARY TO COUNCIL (CITY SECRETARY) \nAppointment in this position will be subject to the signing of an employment contract and performance agreement, as well as disclosure of financial interests. \n \nAPPLICATION REQUIREMENTS \n• Complete the online job application form and attach all relevant and updated documents (Certified Qualification/s/Certificates, ID, and CV). \n• Applicants should take note that they can be required to provide proof of original documents during the selection process. \n• You will be requested to provide a brief description of your work experience relating to the vacancy. \n• Applicants with membership to professional bodies need to provide a membership number and expiry date. \n• If you are an internal applicant, your employee number will be required. \n• Applicants are advised to use Google Chrome when applying for CoJ positions. \n \nDISCLAIMER\n• The City of Johannesburg is currently recruiting and will not demand payment in any form for any job placement. All vacancies are advertised in newspapers and on the CoJ website. \n• The City of Johannesburg applies the principles of employment equity as per the National legislation and policy guidelines and will consider designated groups in line with these requirements. We are an equal-opportunity employer. \n• By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. \n• However, registering your CV and/or receipt and acknowledgment of any kind shall not be an indication that your application will be successful and/or lead to employment. \n• The City of Johannesburg shall not be liable for any damage, loss, or liability of whatsoever nature arising from your use of the job opportunity section of this website. \n• The City of Johannesburg reserves the right not to make an appointment. \n• Any misrepresentation or failure to disclose material information on the application form or CV will automatically disqualify your application. \n \n \nSECRETARY TO COUNCIL \nDepartment: Office of the Speaker \nBranch: Legislature \nDesignation: Secretary to Council (City Secretary) \nRemuneration: R 2 148 405 pa (all-inclusive, cost to company) \nLocation: Metro Centre, 158 Civic Boulevard, Braamfontein \n \nMinimum Requirements: \nMatric/Grade 12; \nA qualification in Bachelor of Laws (LLB) or equivalent NQF level 8; \nA Masters qualification, and or a Company Secretarial Professional qualification and registration with the Institute of Company Secretaries of Southern Africa (ICSA) will be an added advantage; \n5 years’ senior management experience and 3 years at middle management \n10 years’ overall experience in the legal field in local government or a Chartered Secretary with 6 – 8 years relevant exposure and experience; \nGood command of English; and \nOther languages within the Nguni and Sotho category will be an added advantage \n \nPrimary Function: \nDirect and lead the Office of the Speaker, by developing, implementing, coordinating, facilitating and promoting best practices, strategies, structures, mechanisms, policies, procedures, practices, programmes/interventions and culture, in order to strengthen the Legislative Arm through the research, development and implementation of the best practice systems and processes of scrutiny and oversight (of the executive) and public participation. \n \nKey Performance Areas: \nProvide by-law making, accountability, oversight, and scrutiny services; \nManage and coordinate Legislature empowerment and stakeholder management and relations services; \nProvision of strategic direction and management services; \nInitiate and participate in the development of effective and efficient Department organisational structures, processes, and systems; \nEnsure capacitation of the Department’s structure through effective and efficient Recruitment, Selection, and Placement processes; \nProvide sound strategic leadership to the Department; \nEnsure effective control of the financial resources of the Department; \nEnsure effective control of Human Resources; \nManage specific administrative and reporting requirements associated with the Department and Individual performance. \n \nLeading Competencies: \n• Analysis and interpretation of legislation and policies • Stakeholder relations and influencing; \n• Uses tact, diplomacy, and a positive attitude in all internal and external communications, whether verbal or non-verbal and other interactions with the public or other City officials; \n• Attention to detail; \n• Flexible and practical approach to work; \n• Direction and diplomacy; \n• Management, planning, budgeting, monitoring, and organising; \n• Good written and verbal communication (report writing, PowerPoint, presentation, and public speaking). \n• Strategic Direction and Leadership; People Management, Program, and Project Management; \n• Financial Management; \n• Change Management; \n• Governance leadership; \n• Knowledge and understanding of legal prescripts; \n• Interpretation of legislations, By-laws and Regulations; \n• Networking and Maintenance of Sound Relations; \n• Ability to operate in a Political Environment. \n \nCore Competencies: \n• In-depth knowledge and understanding of the Legislature and service delivery environments and its legislation; \n• Sound knowledge of Political and Community Protocol including the knowledge of the different political agendas and community needs and requirements; \n• Knowledge of local government environment and its factors, Government-wide policies, and the ability to interpret and apply policies and legislations; \n• Knowledge of Local election laws, Codes, Ordinances, and Resolutions; \n• In-depth understanding of research, strategy, and policies ain relation to the Protocols, Ordinances, and separation of powers as well as any matters relating to the governance of the Council and how it can be innovatively and practically applied; \n• Knowledge of principles and practices of Good Governance, administration, and personnel management. \n• Moral Competence; \n• Planning and Organising; \n• Analysis and Innovation; \n• Knowledge and Information Management; \n• Effective Communication; \n• Results and Quality Focus. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1Ulsf4C2wSN6AZbE8UnDpuwew554  \nAPPLY ONLINE VIA THIS LINK: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Pelisa Sindelo \nTel No: 011 407 6560 \nCLOSING DATE: TUESDAY, 24 OCTOBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation and \nEmployment record verification, \nCriminal check, and \nIdentity validation. \n \n \n ",
                " \n \n \n \n \nRE-ADVERTISEME NT CIRCULAR 067/2023 \n \nThis Vacancy is open to Employees of the City of Johannesburg and External Applicants \n \nCLOSING DATE: THURSDAY, 19 OCTOBER 2023\n \nWE HAVE AN EXCITING CAREER OPPORTUNITY FOR: \nPERMANENT POSITION \nCHIEF OF POLICE \n \nAPPLICATION REQUIREMENTS \n• Complete the online job application form and attach all relevant and updated documents (Certified Qualification/s/Certificates, ID, and CV). \n• Applicants should take note that they can be required to provide proof of original documents during the selection process. \n• You will be requested to provide a brief description of your work experience relating to the vacancy. \n• Applicants with membership to professional bodies need to provide a membership number and expiry date. \n• If you are an internal applicant, your employee number will be required. \n• Applicants are advised to use Google Chrome when applying for CoJ positions. \n \nDISCLAIMER\nThe City of Johannesburg is currently recruiting and will not demand payment in any form for any job placement. All vacancies are advertised in newspapers and on the CoJ website. \nThe City of Johannesburg applies the principles of employment equity as per the National legislation and policy guidelines and will consider designated groups in line with these requirements. We are an equal opportunity employer. \nBy submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. \nHowever, registering your CV and/or receipt and acknowledgement of any kind shall not be an indication that your application will be successful and/or lead to employment. \nAny misrepresentation or failure to disclose material information on the application form or cv will automatically disqualify your application. \nThe City of Johannesburg shall not be liable for any damage, loss or liability of whatsoever nature arising from your use of the job opportunity section of this website. \nThe City of Johannesburg reserves the right not to make an appointment. \n \n \nCHIEF OF POLICE \nDepartment: Public Safety \nBranch: Johannesburg Metropolitan Police Department (JMPD) \nDesignation: Chief of Police \nRemuneration: R95 772.64 pm (basic salary, excluding benefits) \nLocation: 195 Main Road Street, Martindale, 2092 \n \nMinimum Requirements: \nMatric/Grade 12; \nBachelor’s degree or BTech in Policing (NQF level 7); \nBasic police training qualification; \nAt least 10 years of extensive experience and subject matter expertise in the policing and supervisory environment, of which three (3) years must be at senior management in a metro or medium-sized municipality or similar public sector environment; \nFirearm proficiency; \nProven experience at senior management level in the public safety environment. \nGood knowledge and interpretation of policy and legislation; \nGood knowledge of performance management system; \nGood knowledge of supply chain management regulations; \nGood governance; \nCode B driver’s license; and \nNo criminal record (excl. political in the previous dispensation). \n \nPrimary Function: \nTo provide strategic leadership on all aspects of integrated public safety, and to ensure efficient and effective implementation/performance of the core functions prescribed in Section 64C of the South African Police Service Act namely; traffic policing, by-law enforcement, and traffic management. \n \nKey Performance Areas: \nLead the provision of policing, traffic management, by-law enforcement, and crime prevention services; \nProvision of assets, property, and human resources in order to ensure security services; \nLead the provision of driver licensing and testing services; \nLead and manage the Branch in terms of Section 64C (2) (a-h); \nFinancial and Human Resources management; \n \nLeading Competencies: \n• Good verbal communication skills (including presentation and public speaking); \n• Good written communication (Report writing, PowerPoint presentation, etc.) \n• Tact and a positive attitude in all internal and external communications, whether verbal or non-verbal, and other interactions with the public or other City officials; \n• Attention to detail; \n• Flexible and practical approach to work; \n• Discretion and diplomacy; \n• Planning, leading, organising and controlling; \n• Principles and practices of project management. \n \nCore Competencies: \nKnowledge of legislation governing local government and other spheres of government in relation to crime prevention, traffic management, security and its management, by-law enforcement, the SAPS Act and other relevant legislation, including labour legislation; \nKnowledge of principles and practices of good governance, administration and personnel management; \nSound knowledge of the relevant legislation that governs employment practices and principles of human resource administration; \nIn-depth understanding of government strategic planning and policies, and how they can practically be applied; \nPrinciples and practices of municipal budget preparation and administration; \nSound knowledge of modern policies and practices of public personnel administration, including procedures, ordinances and resolutions; \nSound knowledge of employee classification, compensation and benefits, recruitment, selection, and training; \nKnowledge and analysis of the impact of labour market conditions and socio-economic issues; \nAbility to establish and maintain effective working relationships with employees, city officials, labour unions and the public; \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1oIVlk7QqS7SAE3AaHdRsjQew554\nAPPLY ONLINE VIA THIS LINK: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Pelisa Sindelo \nTel No: 011 407 6560 \nCLOSING DATE: THURSDAY, 19 OCTOBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation and \nEmployment record verification, \nCriminal check, and \nIdentity validation. \n \n \n \n ",
                " \nRE-ADVERTISE MENT CIRCULAR 066/2023 \n \nThis Vacancy is open to Employees of the City of Johannesburg and External Applicants \n \nCLOSING DATE: TUESDAY, 24 OCTOBER 2023\n \nWE HAVE AN EXCITING CAREER OPPORTUNITY FOR: \nPERMANENT POSITION \nGROUP HEAD: CITIZEN RELATIONSHIP AND URBAN MANAGEMENT \nAppointment in this position will be subject to the signing of an employment contract and performance agreement, as well as disclosure of financial interests. \n \nAPPLICATION REQUIREMENTS \n• Complete the online job application form and attach all relevant and updated documents (Certified Qualification/s/Certificates, ID, and CV). \n• Applicants should take note that they can be required to provide proof of original documents during the selection process. \n• You will be requested to provide a brief description of your work experience relating to the vacancy. \n• Applicants with membership to professional bodies need to provide a membership number and expiry date. \n• If you are an internal applicant, your employee number will be required. \n• Applicants are advised to use Google Chrome when applying for CoJ positions. \n \nDISCLAIMER\nThe City of Johannesburg is currently recruiting and will not demand payment in any form for any job placement. All vacancies are advertised in newspapers and on the CoJ website. \nThe City of Johannesburg applies the principles of employment equity as per the National legislation and policy guidelines and will consider designated groups in line with these requirements. We are an equal opportunity employer. \nBy submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. \nHowever, registering your CV and/or receipt and acknowledgement of any kind shall not be an indication that your application will be successful and/or lead to employment. \nAny misrepresentation or failure to disclose material information on the application form or cv will automatically disqualify your application. \nThe City of Johannesburg shall not be liable for any damage, loss or liability of whatsoever nature arising from your use of the job opportunity section of this website. \nThe City of Johannesburg reserves the right not to make an appointment. \n \n \nGROUP HEAD: CITIZEN RELATIONSHIP AND URBAN MANAGEMENT \nDepartment: Office of the City Manager \nBranch: Citizen Relationships and Urban Management \nDesignation: Group Head: Citizen Relationship and Urban Management \nRemuneration: R 2 148 405 pa (all-inclusive, cost to company) \nLocation: Metropolitan Centre, 158 Civic Boulevard, Braamfontein \n \nMinimum requirements: \nMatric/Grade 12; \nBachelor’s Degree in Public Management / Administration, Engineering, Planning, Accounting, Economics, Development Planning (NQF level 7); \n5 years’ senior management experience and 3 years at middle management; \n10 years' extensive experience in leadership / management or related field; \nKnowledge of the MFMA, Treasury Regulations and other relevant legislative frameworks; \nKnowledge on local governments environment; \nKnowledge of City’s strategy (IDP), prescribed Methodologies, Legislative, Policy and Regulatory Frameworks governing the media and communications function; \nKnowledge on Corporate Governance; \nKnowledge of principle and practices of municipal organization, administration and personnel management; \nIn-depth knowledge of function principles, techniques & tools and how they can be practically applied; \nKnowledge on Corporate Governance; \nThe incumbent should meet the standards set out in the Core Competency Requirements as per Regulations; and \nMust have a valid drives license; \n \nPrimary Function \nTo provide Regional service delivery governance, urban management, augmented field services and citizen relations functions aimed at achieving service delivery excellence by ensuring that the City is responsive to the needs of the community. \n \nKey Performance Areas: \nContribute to the development of the City’s strategic planning process; \nLead the Department’s Service Delivery and Budget Implementation Planning (SDBIP) process; \nEnsure sound Departmental Financial Planning and Budgeting processes; \nLead and facilitate the Departmental Performance Management planning process; \nLead and manage the development of the Sub-Directorate’s Individual Learning Plans (ILP’s) process; \nOrganise both human and non-human resources for effective and efficient implementation of Departmental functions, processes, and procedures; \nLeading the Recruitment, Selection & Placement process for sourcing of suitably qualified staff for the Department; \nProvide sound leadership for the achievement of the Sub-Directorate’s objectives; \nDirect the provision of regional service delivery governance, urban management, augmented field services and citizen relations functions; \nEnsure effective monitoring, evaluation process and systems in the regions; \nEnsure effective control of the Department’s Human Resource; \nEnsure effective Departmental Assets Management and Control; \nImplement good governance and effective risk management systems; \nCoordinate the Strengthening of Inter-and-intra-governmental Relations (IGR); \nEnsure effective management of specific administrative and reporting requirements associated with the Department and individual performance; \n \nLeading competencies: \nComputer Literacy (Microsoft Word and Excel); \nGood facilitation and influencing; \nGood listening and communications Coordinating; \nProblem solving Customer Care; \nCritical thinking; \nExcellent written and verbal communications; and \nGood management. \nStrategic Direction and Leadership; \nPeople Management, \nProgram and Project Management; \nFinancial Management; \nChange Management; \nChange Leadership; \nGovernance Leadership. \n \nCore Competencies: \n• Moral Competence; \n• Planning and Organising; \n• Analysis and Innovation; \n• Knowledge and Information Management; \n• Effective Communication; \n• Results and Quality Focus. \n \n“All suitably qualified candidates are encouraged to apply and will be considered. The City of Johannesburg applies the principles of employment equity as per National legislation and policy guidelines and will consider designated groups in line with these requirements. Preference will be given to previously disadvantaged groups including those with disabilities. Appointments will be made in accordance with the approved Employment Equity Plan to promote its equitable representation in terms of race, gender and disability.” \n \nPlease take note that only online applications will be considered. Please apply by using the following link below: \nhttps://share-eu1.hsforms.com/1U4PLN2gXSlWAw1xvJXcj2wew554\nAPPLY ONLINE VIA THIS LINK: www.joburg.org.za\nENQUIRIES ONLY: \nContact Person: Pelisa Sindelo \nTel No: 011 407 6560 \nCLOSING DATE: TUESDAY, 24 OCTOBER 2023 \n \nApplicants are respectfully informed that, if no notification of appointment/response is received within six (6) weeks of the closing date, they must accept that their application was unsuccessful. By submitting your application for a position at the City of Johannesburg, you are consenting that the personal information submitted as part of your application may be used for the purposes of the Recruitment and Selection and related process. In terms of the Talent Acquisition Policy of the City of Johannesburg, you hereby consent to the following risk checks should your application be shortlisted: \nCredit Record, \nCV validation and \nEmployment record verification, \nCriminal check, and \nIdentity validation"
            ],
            "postedDate": "11/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/city-of-tshwane.jpg?1697052370",
            "href": "https://www.govpage.co.za/city-of-tshwane-metropolitan-municipality-vacancies-blog/city-of-tshwane-vacancies2516652",
            "title": "CITY OF TSHWANE VACANCIES",
            "content": [
                " \n \nCITY OF TSHWANE\n \nINTERNAL/EXTERNAL JOB FORUM\n \nOur policy is to provide equal employment opportunities to all qualified persons without regard to race, religious belief, age, national origin, marital status, physical disability, HIV status, gender, social origin, culture, political opinion, conscience and sexual orientation. Persons with disabilities are encouraged to apply. The City of Tshwane is committed to employment equity. Preference may be given to appointable applicants from the underrepresented designated groups in terms of the City’s Employment Equity Plan. The City retains the right not to make an appointment and to verify all information provided by candidates.\n \nApplicants should note that they will be required to provide proof of their qualifications or any other relevant documents (certified copies or original documents) during the selection process. Appointments will be subject to the positive verification of qualifications (from Grade 12 upwards). Any misrepresentation of qualifications or information on the application of an applicant, failure to present proof of claimed qualifications or fraudulent qualifications will disqualify a candidate for appointment. If it is an internal candidate, he/she may be disciplined for misconduct.\n \nThe online system closes at midnight on the closing date and no late applications can be accepted. If you do not receive correspondence from our office within 21 days of the application’s closing date, please consider your application unsuccessful.\n ",
                "The City of Tshwane seeks to fill the fixed-term contract positions as indicated in this job forum.\nThe complete job forum can be accessed by visiting the City of Tshwane public website (https://www.tshwane.gov.za) and clicking on “Documents” and then on “Job Forums” or alternatively clicking on “Notice board” or on “Quick Links”.\n \nPLEASE APPLY ONLINE BY VISITING THE CITY OF TSHWANE PUBLIC WEBSITE AND CLICKING THE E-RECRUITMENT LINK\n(LOCATED UNDER BOTH THE “E-SERVICES” AND THE “CAREERS” LINK)\n \nClosing date: 19 October 2023\n(Online applications will close at midnight.)\n \nGeneral enquiries: LJ Moleli (012 358 4346)\nRecruitment Centre\nUpper Ground Level, Middestad Building\n252 Thabo Sehume Street\nPretoria CBD",
                "PROFESSIONAL\n \nDEPARTMENT: HUMAN SETTLEMENTS\nDivision: Human Settlements Provision\nSection: Project Implementation\nLocation: Pretoria Central\nReference number: HOSD101-2023\nPROJECT MANAGER (2 POSITIONS) (FIXED-TERM CONTRACT, NOT EXCEEDING A PERIOD OF FIVE YEARS)\nTo be advertised: Internal External\nThis position seeks to attract: African female, African male, Coloured female, Coloured male, Indian female, Indian male, White female, White male, Person with disability, All categories\nJob level: T15\nScale: R566 376 – R786 636 per annum\nEstimated remuneration package: R775 605 – R1 05 3867 per annum\n \nJob purpose\nProviding technical and operational expertise in project planning, procurement, contract management and execution for human settlements infrastructure projects\nin the development of options for the provision of infrastructure such as bulk services, reticulation of services (water and sewerage), roads and storm water drainage and construction of houses to the Deputy Director, Director and Divisional Head: Human Settlements Provision and assuring operations.\n \nAppointment requirements\nAn appropriate three-year career-related tertiary qualification (degree or national diploma) in Civil Engineering, Structural Engineering or Construction Studies.\nRegistration with the Engineering Council of South Africa as PrEng, PrTechEng or PrTechniEng in terms of the Engineering Profession Act, 2000 (Act 46 of 2000) or the South African Council for the Project and Construction Management Professions (SACPCMP) will be an added advantage.\nAt least five years’ relevant experience in a civil, structural and construction engineering and project management environment.\nValid Code B driving licence.\nComputer literacy and good working knowledge of Microsoft Office.\nWillingness to work after hours and on weekends, when required.\n \nPersonal attributes and/or competencies\nBeing ethical; good communication skills; good interpersonal relations; ability to work as part of a team; ability to pay attention to detail; ability to be professional at all times; ability to work independently at strategic level; integrity; ability to work under pressure; flexibility; ability to meet given deadlines; exceptional and dynamic creativity to improve the functioning of the section; administrative skills; organising and coordination skills; financial management skills; project management skills; analytical skills; presentation skills\n \nPrimary functions\nEnsuring programme and project process and implementation management.\nManaging complex civil and construction projects from conceptualisation, design, procurement, contract management, quality assurance and compliance and ensuring their proper integration in the plans of the City (Integrated Development Plan, Service Delivery and Budget Implementation Plan and Municipal Sustainable Human Settlements Plan).\nCoordinating the reporting in the City and the provincial and national government.\nReporting on the Service Delivery and Budget Implementation Plan, Risk Management, Audit and Oversight Committees, and all project-related issues.\nReporting on the Human Settlements Development Grant to the provincial government.\nReporting on the Urban Settlements Development Grant and Informal Settlements Upgrading Partnership Grant (ISUPG) to the national Department of Human Settlements.\nReviewing the project quality management and the product quality management in order to identify the issues, concerns and challenges in the overall management of the project and to identify the opportunities that can be realised through improvements to the attention paid to project and product quality.\nManaging and coordinating activities on new projects in order to ensure the completion thereof on time and within the cost and specification.\nFacilitating the establishment of a Project Steering Committee and coordinating its meetings.\nPreparing a plan, budget and schedule of all activities required for execution of the project.\nCoordinating activities according to plan.\nPreparing project reports.\nProviding guidance to the project team.\nEnsuring problem-solving and dispute resolution.\nContinuously interacting with and consulting all role players.\nAdministering the payments related to project.\nDirecting the outcomes associated with utilisation, productivity and performance of personnel in the system.\nMonitoring adherence to human resources and office policies and procedures, for example staff attendance.\nDefining or adjusting the key performance indicators, job design and role boundaries of personnel against service delivery requirements.\nConducting appraisals to measure performance and objective accomplishments against agreed targets, reviewing goals and setting new objectives.\nAssisting in evaluating the capabilities of prospective applicants and participating in the interviewing and final selection sessions.\nEnsuring optimal and correct use of the resources of staff and office machines.\nMaintaining records of work in progress and completed.\nEnsuring effective and efficient management of the subsection.\n \nSAP: S70009750, S70009751\nNew/natural attrition: Natural attrition\nEnquiries: S Shiburi (012 358 8237)",
                "MANAGERIAL\n \nDEPARTMENT: HUMAN SETTLEMENTS\nDivision: Human Settlements Provision\nSection: Project Implementation\nLocation: Pretoria Central\nReference number: HOSD102-2023\nDIRECTOR: PROJECT IMPLEMENTATION (FIXED-TERM CONTRACT, NOT EXCEEDING A PERIOD OF FIVE YEARS)\nTo be advertised: Internal External\nThis position seeks to attract: African female, African male, Coloured female, Coloured male, Indian female, Indian male, White female, White male, Person with disability, All categories\nJob level: T18\nScale: R795 720 – R1 105 152 per annum\nEstimated remuneration package: R1 154 296 – R1 548 145 per annum\n \nJob purpose\nProviding technical and operational expertise in project planning, procurement, contract management and execution for human settlements infrastructure projects in the development of options for the provision of infrastructure such as bulk services, reticulation of services (water and sewerage), roads and storm water drainage and construction of houses to the Divisional Head: Human Settlements Provision and assuring operations.\n \nAppointment requirements\nAn appropriate three-year career-related tertiary qualification (degree or national diploma) in Civil Engineering, Structural Engineering or Construction Studies.\nRegistration with the Engineering Council of South Africa as PrEng, PrTechEng or PrTechniEng in terms of the Engineering Profession Act, 2000 (Act 46 of 2000) or the South African Council for the Project and Construction Management Professions (SACPCMP) will be an added advantage.\nAt least five years’ relevant experience in a civil, structural and construction engineering and project management environment, of which at least three years should be at management level.\nValid Code B driving licence.\nComputer literacy and good working knowledge of Microsoft Office.\nWillingness to work after hours and over weekends, when required.\n \nPersonal attributes and/or competencies\nBeing ethical; good communication skills; good interpersonal relations; ability to be a good team member; ability to pay attention to detail; ability to be professional at all times; ability to work independently at a strategic level; integrity; ability to work under pressure; flexibility; ability to meet given deadlines; exceptional and dynamic creativity to improve the functioning of the section; administrative skills; organising and coordination skills; financial management skills; project management skills; analytical skills; presentation skills\n \nPrimary functions\nEnsuring project auditing.\nConducting individual research interviews with project stakeholders, project managers and project team members to identify past, current and future issues, concerns, challenges and opportunities.\nConducting individual research interviews with stakeholders, including vendors, suppliers, contractors, other internal and external project resources and selected customers.\nAssessing the issues, challenges and concerns in more depth to get to the root causes of problems.\nReviewing all historical and current documentation related to the project, including\nteam structure, scope statement, business requirements, project plan, contract, milestone report, meeting minutes, action items, risk logs, issue logs and change logs.\nOverseeing complex civil and construction program from conceptualisation, design, procurement, contract management, quality assurance and compliance and ensuring their proper integration to the plans of the City (Integrated Development Plan, Service Delivery and Budget Implementation Plan and Municipal Sustainable Human Settlements Plan).\nInterviewing selected stakeholders to identify and determine what their expectations of the project were and to identify to what extent their expectations have been met.\nReviewing project quality management and product quality management to identify issues, concerns and challenges in the overall management of the project and to identify the opportunities that can be realised through improvements to the attention paid to project and product quality.\nIdentifying lessons learnt that can improve the performance of other future projects within the organisation.\nOverseeing risk and issue management by ensuring risk identification, risk quantification, risk response and risk monitoring and control.\nEnsuring impact and change management.\nEnsuring project impact analysis to support the evaluation and tracking of a suggested modification to a project's scope.\nMeasuring and setting standards regarding project change management of time (the deadline of the project), resources available (people and money needed) and output (the form of the deliverables).\nEnsuring project communication.\nDesigning and implementing communication plan formats for constant and effective communication among all project stakeholders.\nEnsuring that the right information gets to the right project stakeholder at the right time.\nManaging the communication plan.\nEnsuring the timely and appropriate generation, collection, distribution, storage, retrieval and ultimate disposal of project information.\nProviding the critical links among people and information that are necessary for successful communication.\nGuiding the project manager, project team, stakeholders, customers, sponsors and everyone involved in the project to understand how communication affects the project as a whole.\nIncluding guidelines for project status meetings, project team meetings, virtual meetings and emails.\nIdentifying and defining immediate, short- and long-term objectives.\nKeeping abreast of the trends, theories and practices that underlie the rendering of services.\nImplementing the department’s business and strategic plans and associated short- and long-term performance and service delivery plans.\nMonitoring the progress of specific key performance indicators and measures.\nEnsuring that performance indicators are identified, objectives are aligned, and appropriate procedures are developed and implemented.\nAnalysing and aligning requirements with operating capacity and capability.\nEnsuring a climate conducive to promoting and sustaining motivational levels, productivity, and performance by directing and controlling the outcomes associated with the use, productivity and performance of personnel within the section.\nDefining and adjusting the key performance indicators and job profiles of personnel against service delivery requirements.\nEvaluating the capability of prospective applicants and leading the interview and final selection sessions.\nConducting appraisals to measure performance and objectives against agreed targets and setting new objectives.\nIdentifying professional and technical skill gaps and completing developmental plans for existing personnel with clearly defined career paths and job-enrichment opportunities.\nMonitoring the adequacy of current training interventions and reporting on impacts after training.\nImplementing human resources policies and procedures to control and regulate workplace conflict and/or instituting corrective measures.\nAnalysing staff attendance, absenteeism, overtime and lost time, and implementing and monitoring specific remedial measures aimed at improving productivity and reducing personnel-related costs.\nEnsuring compliance with occupational health and safety policies.\nEnsuring compliance with the skills development plan for the section.\nEnsuring compliance with the employment equity policy and plans for the section.\nMonitoring and controlling the section’s budget so that income and expenditure are in line with Council requirements.\nPreparing and submitting the capital and operational budget.\nManaging the capital and operational budget.\nManaging the assets of the department.\nReporting on the Human Settlements Development Grant to the provincial government and on the Urban Settlements Development Grant and Informal Settlements Upgrading Partnership Grant (ISUPG) to the national Department of Human Settlements.\n \nSAP: S70052301\nNew/natural attrition: New (funded by the USDG grant)\nEnquiries: S Shiburi (012 358 8237)"
            ],
            "postedDate": "11/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/emalahleni-logo_orig.jpg",
            "href": "https://www.govpage.co.za/emalahleni-local-municipality-vacancies-blog-497715/emalahleni-local-municipality-vacancies8909434",
            "title": "EMALAHLENI LOCAL MUNICIPALITY VACANCIES",
            "content": [
                " \nEMALAHLENI LOCAL MUNICIPALITY\n ",
                " \nINTERNAL & EXTERNAL NOTICE\n \nEmalahleni Local Municipality is an equal opportunity employer committed to the promotion of equity and equality.\n \nThe appointment of a candidate is at the Emalahleni Local Municipality’s sole discretion, taking into account factor which Council considers relevant, including but not limited to Employment Equity.  \n \nEmalahleni Local Municipality reserves the right to appoint the suitable candidate in line with the affirmative Action Strategy.\n \nSuitable qualified females and people with disabilities are encouraged to apply.\n \nThe submission of an application gives Emalahleni Local Municipality the right to make enquiries necessary to obtain information regarding the applicant’s background. Such enquiry will include current and previous employers as well as academic institutions.\n \nThe Municipality hereby invites applications from suitably qualified candidates for the following position:",
                "TRAFFIC OFFICER (X14)\n \nQUALIFICATIONS/ REQUIREMENTS: *Gr.12 *Basic training qualification attained *Code EB drivers license *No criminal record *Firearm proficiency * 2 - 5 years’ relevant experience.\n \nKEY RESPONSIBILITIES: *Point durity *Patrolling *Execution of by-laws *Stopping and examining of motor vehicle \n \nOCCUPATIONAL COMPETENCIES: *Must be able to support strategies that aim to build a municipality that reflects the community it serves *Must be able to assess and takes account of risk when making decisions *Must be able to handle objections by acknowledging issues by suggesting alternatives *Must be able to sort out conflict and deals with hostility and provocation in a calm and restrained way *Must be able to respond to call promptly and effectively *Must be able to interact professionally with general public and stakeholders.\n \nSALARY: R245 763.00 per annum\nLevel:10\n\n \n \n \n \n \nREFUSE TRUCK DRIVER (OGIES/PHOLA) X2\n \nQUALIFICATIONS/ REQUIREMENTS:*Gr. 10 *Drivers license Code 14 (EC) with Public Drivers License  *CANDIDATES WILL BE SUBJECTED TO A DRIVING TEST AND A HEALTH TEST.\n \nKEY RESPONSIBILITIES: *Collection of refuse using a tipper truck and dispose at the landfill site *Participate in the cleaning program at Emalahleni and Project Consolidate *Keep vehicle clean *Record information on loads transported and any other information *Ensure the regular maintenance and repair of the vehicle *Perform any other tasks that may be delegated\n \nOCCUPATIONAL COMPETENCIES: *General labour activities *Coordinating work with the work schedules of other *Safety around the workplace/workspace is clean *Must be able to understand and follow basic instructions and be held accountable for task accomplished *Tools and equipment storage and care *Ensure that that tools is secured, stored and used according to specifications\n \nSALARY: R245 763.00 per annum\nLevel: 10\n \n \nCLOSING DATE: 18 OCTOBER 2023\n \nENQUIRIES: MR. ML SITHOLE/MS. BM ZITHA\nTel: 013 690 6537/6358\n \nPlease send your Application form, CV together with certified copies of your qualifications and Identity Document to the Manager: Human Resources, P.O. Box 3, Witbank 1035, or submit your CV at \n \nAdministration Building\nCivic Centre  \nPresident Street \nWitbank\n1035\n \nIf no response is received from Emalahleni Local Municipality within 60 days after the closing date, it must be regarded that your application has not been successful.\n \nPLEASE NOTE: THAT NO FAXED OR E-MAILED APPLICATIONS WILL BE CONSIDERED AND THAT APPLICATIONS RECEIVED AFTER THE CLOSING DATE WILL NOT BE ACCEPTED\nPEOPLE FROM DESIGNATED GROUP ARE ENCOURAGED TO APPLY!!!"
            ],
            "postedDate": "11/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/arc.png?1697052774",
            "href": "https://www.govpage.co.za/agricultural-research-council-arc-vacancies-blog/agricultural-research-council-arc-vacancies2369507",
            "title": "AGRICULTURAL RESEARCH COUNCIL (ARC) VACANCIES",
            "content": [
                " \nAGRICULTURAL RESEARCH COUNCIL (ARC)\n \nThe Agricultural Research Council (ARC) is a premier science institution that conducts research with partners, develops human capital and foster innovation in support of the agricultural sector. It provides diagnostic, laboratory, analytical, agricultural engineering services, post-harvest technology development, agrochemical evaluation, consultation and advisory services, food processing technology services as well as various surveys and training interventions. Through its wider network of research institutes and experimental farms, the ARC provides a strong scientific base and a broadly distributed technology transfer capacity to the entire agricultural industry in South Africa. \n ",
                " \n \nThe ARC-Vegetable, Industrial and Medicinal Plants (ARC-VIMP) seeks to appoint a highly skilled, experienced, and dynamic persons to the following positions at Roodeplaat, Pretoria: \n \nSENIOR BUYER \n(6 MONTHS FIXED TERM CONTRACT) \n \nKey Performance Areas: \n•Procurement of goods works and services in line with SCM policy and other treasury regulations.\n•Assist in managing and monitoring the institute procurement plan.\n•Coordinate SCM Bid Committees.\n•Ensure internal control compliance with ARC Policies and the relevant legislations.\n•Handling of internal and/or external enquiries and communicating with all stakeholders and suppliers.\n•Provide advice on the procurement of goods and/or service.\n•Involvement in procurement and sourcing of goods and services.\n•Compile and submit reports as required.\n \nRequirements: \n•Bachelor’s Degree/B-Com/National Diploma in Supply Chain Management specifically in Sourcing.\n•Logistics, Supply Management or Purchasing Management.\n•3-4 years’ experience in public sector procurement with knowledge and understanding of Supply Chain Management policies and procedure.\n•Experience with tender processes, CIDB projects and capital equipment.\n•Knowledge and understanding of the PFMA and related policies and regulations.\n• Knowledge and understanding of maintenance, services and procurement of parts for various types of equipment. \n• Knowledge and understanding of contract administration. \n• Understanding the scientific research environment is an added advantage. \n• Ability to identify and resolve challenges in line with the policies and regulations. \n• Ability to use initiative and work independently and/or with the team. \n• Expediting purchase orders, assisting with internal procurement and contract management. \n \n \n \n \n \nBUYER X 3 \n(6 MONTHS FIXED TERM CONTRACT) \n \nKey Performance Areas: \n• Procurement of goods works and services in line with SCM policy and other treasury regulations. \n• Coordinate SCM Bid Committees. \n• Ensure internal control compliance with ARC Policies and the relevant legislations. \n• Handling of internal and/or external enquiries and communicating with all stakeholders and suppliers. \n• Involvement in procurement and sourcing of goods and services. \n• Provide advice on the procurement of goods and/or service. \n• Expediting purchase orders, assisting with internal procurement and contract management. \n• Compile and submit reports as required. \n \nRequirements: \n• Bachelor’s Degree, BCom Degree OR National Diploma in Supply Chain Management, Sourcing, Logistics, or Purchasing Management. \n• 1-2 years’ experience in public sector procurement with knowledge and understanding of Supply Chain Management policies and procedure. \n• Knowledge and understanding of the PFMA and related policies and regulations.\n• Knowledge and understanding of maintenance, services and procurement of parts for various types of equipment. \n• Knowledge and understanding of contract administration. \n• Understanding the scientific research environment is an added advantage. \n• Ability to identify and resolve challenges in line with the policies and regulations. \n• Ability to use initiative and work independently and/or with the team. \n \nEnquires: Mr Phuthi Buthane (012) 808 8000",
                " \nCLOSING DATE FOR APPLICATIONS: 24 October 2023 \n \nCompetitive remuneration package will be congruent with the scope, responsibilities and the stature of the position. The appointment will be subject to a positive security clearance and preference will be given to South African citizens. Applications accompanied by covering letter, detailed CV (Including certified copies of certificates, supporting documents, copy of driver’s license) must be attached on the form. \nClick on the link to apply for Senior Buyer https://forms.office.com/r/5fSfwMyJ2N\nClick on the link to apply for Buyer x3 https://forms.office.com/r/a9vALpqR5Y\n \nNB: Non-RSA citizens with work permit must attach certified copies as well as the names and particulars of three (3) traceable referees. \n \nSAQA evaluation report must accompany foreign qualifications. Incomplete applications will not be considered. Applicants who do not receive any response four (4) weeks after the closing date must regard their applications as unsuccessful. The Agricultural Research Council is an equal opportunity employer and is committed to the principles and processes of Employment Equity. The company has the right not to appoint."
            ],
            "postedDate": "11/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/central-energy-fund_orig.jpg",
            "href": "https://www.govpage.co.za/central-energy-fund-cef-vacancies-blog/central-energy-fund-cef-vacancies9365815",
            "title": "CENTRAL ENERGY FUND (CEF) VACANCIES",
            "content": [
                " \nCENTRAL ENERGY FUND (CEF)\n ",
                " \n \nSENIOR INTERNAL AUDITOR\nJHB Sandton\nJob Ref #: CEF-5\nIndustry: Energy\nJob Type: Permanent\nSalary: Market Related\n \nDescription:\nThe Senior Internal Auditor is accountable to the Chief Audit Executive for the provision of specialist audit, risk and compliance support, technical input and advice to ensure the successful delivery of corporate compliance and risk management services to CEF Group. This includes a range of audit, risk and compliance activities including internal audit, risk management, internal control systems and processes and business continuity management.\n \nRequirements:\nREQUIRED MINIMUM QUALIFICATIONS AND EXPERIENCE\nMin of 9 years’ experience in Auditing of 3 – 5 years must in management\nMatric (NQF Level 4) and bachelor’s degree in Auditing or Accounting and/ or equivalent at NQF level\nMember of the Institute of Internal Auditors (IIA)\nHonours Degree (NQF Level 8) in the relevant field or Certified Internal Auditor as an added advantage\n \nDESIRED ADDITIONAL SKILLS/ COMPETENCIES\nKnowledge of auditing policies, processes and frameworks\nReporting skills\nTime management skills\nCommunication skills\nEthical\nObjective\nJudgment\nExcellent Attention to Detail\nExcellent Technical Expertise\nExcellent Communication - Verbal & Written\nCustomer Orientation /Focus\nExcellent analytical skills\nStrong Initiative",
                "KEY PERFORMANCE INDICATORS\nParticipate in the preparation of the annual Internal Audit Plan\nPrepare individual audit plans on receipt of audit allocations from the Chief Internal Auditor\nDraft audit objectives, scope, background, and period of execution\nEnlist Junior Internal Auditors to assist in the execution of the audit.\nPrepare planning memorandum.\nCommunicate in advance to management that the audit will be taking place and participate in meetings with management to outline the scope of the audit.\nDevelop an internal audit programme aligned to the scope agreed to with management.\nPlan audits in compliance with the Institute of Internal Auditors (IIA) standards\nPrepare audit working papers based on audit programme.\nRequest information from management to execute the audit.\nGather appropriate evidence to substantiate audit findings.\nDraft audit findings and submit to Chief Internal Auditor for Review.\nMonitor the delivery of the audit in accordance with the time budget and communicate any audit overruns to the Chief Internal Auditor\nEngage with management throughout the audit.\nRecommend corrective action and process and internal control Improvements.\nConduct the audit in accordance with the IIA standards and Internal Audit Plan\nExercise a significant level of responsibility for the provision of accurate, professional and timely audit related services within CEF Group, including internal audit, risk and compliance management, internal control frameworks, systems and processes and business continuity management.\nProvide expert advice, support and recommendations to management and staff on arrange of complex internal audit, compliance, audit and risk management matters, in accordance with established government policies and procedures, legislative requirements and professional standards.\nSignificantly contribute to the establishment, delivery and maintenance of an efficient and effective risk management and compliance framework and related policies, practices and processes consistent with government legislation, regulations and relevant professional standards.\nUndertake complex project work including initiating, planning, implementation and evaluation of internal audit, compliance and risk management functions and processes to improve their efficiency.\nContribute to the achievement of CEF Group objectives, goals and priorities, through the application of specialist compliance related knowledge, expertise, and experience.\nLiaise and consult with internal and external parties to contribute to the on-going development and improvement of corporate compliance and risk management services.\nPrepare reports to document audit findings and submit to the Chief Internal Auditor for approval.\nProvide feedback to process owners on outcome of audit.\nInput into monthly and quarterly audit reporting\nAllocate workload to the Junior Internal Auditors in the execution of audits.\nMentor and coach Junior Internal Auditors on audit processes and methodologies\nMonitor work carried out by the Junior Internal Auditors and take corrective action when necessary.\nMonitor compliance to IIA standards.\nCoordinate with external auditor regarding annual financial audit and controls testing support.\nAny prior experience in internal or external audit (AGSA), quality assurance and process improvement.\nPrepare quality reports that clearly highlight internal control weaknesses and risks, as well as areas of strength, identified.\nMeet at least annually with head of divisions to understand concerns, identify potential focus areas for internal audit plan.\nBuild relationships with business stakeholders through, business understanding and development of specific audit objectives for each assignment on the audit plans.\nBuild and maintain relationships with external audit providers through quarterly meetings or as required.\nPrepare detailed flow charts of systems and business processes.\n \nCLOSING DATE: 20 October 2023\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "11/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/ccma_orig.jpg",
            "href": "https://www.govpage.co.za/commission-for-gender-equality-cge-vacancies-blog/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies",
            "title": "COMMISSION FOR CONCILIATION, MEDIATION AND ARBITRATION (CCMA) VACANCIES",
            "content": [
                " \nCOMMISSION FOR CONCILIATION, MEDIATION AND ARBITRATION (CCMA) \n ",
                " \n \nFULL TIME SENIOR COMMISSIONER COUNCILS AND AGENCIES – NATIONAL OFFICE\nPost level:04\nREF: FTSCOMCA10-23\n\n\nThe National office has a vacancy for a Full Time Senior Commissioner: Council and Agencies.\n\n\nPurpose\nTo provide a management support role to the Senior Commissioner: Dispute Prevention and Resolution at National Office (P03)/ NSC – Dispute Prevention and Resolution and the statutory functions of the Commission in order to ensure all efficiencies and statutory requirements relating to Councils and Agencies Unit are met at all times. To support the implementation of the strategy and operational plans in respect of Councils and Agencies Unit relating to accreditation, monitoring and evaluation of dispute resolution performance, subsidy payment and effective stakeholder relations.\n \nKey performance areas:\n• Accreditation Management\n• Subsidy Payments Management\n• Stakeholder Relationship Management\n• Certification of Bargaining Council Awards\n• Annual Operational Plan\n• Reporting\n• Financial / Budget Management\n• People Management\n \nKey requirements:\n• Appropriate bachelor’s degree or Equivalent Training on Labour legislation\n• 8 – 10 years’ experience and 2 – 3 experience at Management Level Training on CCMA policies and procedures.",
                " \nClosing date: 16 October 2023\n \nDownload Declaration form\n\nDownload Application Form\n \nTo respond in confidence, please complete the enclosed application form, send your detailed CV, copy of your qualifications, and a covering letter disclosing information that will assist the panel in considering your application to: recruitment@ccma.org.za\n \n“When responding to the advert please ensure that the position reference Ref: FTSCOMCA10-23 is quoted first on the subject line, as is. And that the application is sent to the email address contained herein. Failure to observe this protocol may result in your application being disqualified.”\n \nIf we have not responded within a Month from the closing date, you should regard your application as unsuccessful. Correspondence will only be entered into with short-listed candidates. The CCMA reserves the right not to make an appointment. It is the intention of the CCMA to promote representatively in respect of race, gender and disability through the filling of the posts. Preference will be given to candidates from the designated groups."
            ],
            "postedDate": "11/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/eskom_orig.png",
            "href": "https://www.govpage.co.za/eskom-vacancies-blog/eskom-vacancies4498144",
            "title": "ESKOM VACANCIES",
            "content": [
                " \nESKOM\n ",
                " \n \nENVIRONMENTAL MANAGEMENT OFFICER\nVacancy type: External/Internal\nTask Grade : T12\nArea of Specialization : To execute environmental management activities within the designated area of business.\nDepartment : Environmental\nBusiness Unit : Kusile Power Station Projects\nLocation : South Africa (Mpumalanga)\nReference Number : 5100123461MAP\nClosing Date : 10/25/2023\n \nMinimum Requirements\n•Qualification(s):\nDiploma/National Diploma in Natural Science/Environmental Management at NQF 6 with 240 credits\n\n•Related Minimum Experience:\n3 years related experience in the area of environmental management\n \nSkills and Competencies\nLeadership\n•Entrepreneurial mind-set\n•Self-starter\n•Conflict resolution\n•Ability to deliver on expectations\n\nBehavioral\n•Strong drive to learn\n•Be results and delivery focused\n•Be able to work as part of a team\n•Integrity\n•Safety consciousness\n\nKnowledge\n•Ability to link technical and legal aspects related to environmental compliance issues\n•Environmental management systems (ISO 14001)\n•Environmental impact assessments\n•Approval processes for statutory environmental approvals applicable the designated area of the business (e. g. environmental authorisation, waste management, water usage, atmospheric emission licenses, tree cutting permits)\n•Environmental risk and due diligence assessments\n•Environmental law\n•Environmental auditing\n•Environmental incident investigations\n•Eskom business policies, procedures, and directives\n•Environmental statutory/legislative requirements national, provincial/local by-laws\n\nSkill\n•Strong communication\n•Diversity management\n•The ability to apply analytical and logical thinking\n•Gathering and analysing information\n•Designing and testing solutions to problems and formulating plans\n•Attention to detail\n•Conflict resolution and negotiation\n•Should demonstrate in practice the ability to interact with and mobilize stakeholders\n•Presentation\n•Multi-disciplinary problem solving\n•Ability to write effective and professional reports\n \nKey Responsibilities\n•Provide support by implementing and executing the implementation of an international organisation of standardisation (ISO) 14001 environmental management system and related procedures in the designated areas of the business\n•Ensure compliance to legislative and governance requirements in the designated areas of the business through the implementation of compliance measures\n•Execute the process for obtaining environmental approvals for environmental authorisation, waste, water usage, atmospheric emission licenses and tree cutting permits\n•Implement and monitor environmental management plans\n•Perform environmental investigations.\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL (recruitmentgcd@eskom.co.za) **\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \n SENIOR CLERK GENERAL ADMINISTRATION (DISTRIBUTION) MTHATHA\nVacancy type: External\nTask Grade : T06\nArea of Specialization : To provide general administration services to the section\nDepartment : Property Management\nBusiness Unit : Cape Coastal Cluster\nLocation : South Africa (Eastern Cape)\nReference Number : RH 27/2023\nClosing Date : 10/18/2023\n \nMinimum Requirements\n\nQualification(s):\n• NCV3 / Grade 12 at NQF 4 with 120 Credits\n\nRelated Minimum Experience:\n• 2 years administrative experience\n \nSkills and Competencies\n\nLeadership\n• Team player\n\nBehavioural\n• Politeness\n• Promptness\n• Energetic\n• Self-starter\n• Assertive\n• Telephone etiquette\n\n\nKnowledge\n• Knowledge of Eskom’s policies and procedures\n\nSkill\n• Administrative skills\n• Communication skills\n• Sound interpersonal skills\n• Negotiation skills\n• Liaising skills\n \nKey Responsibilities\n• Performs section administration\n• Office control\n• Provide a basic advisory and reporting service\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace\n \n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitmentdx@eskom.co.za **\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \nENGINEER PROF ENGINEERING (RE-ADVERT) (TRANSMISSION DIVISION) APOLLO CONVERTER STATION\nVacancy type: External/Internal\nTask Grade : P13\nArea of Specialization : To provide engineering designs, and technical solutions\nDepartment : Maintenance\nBusiness Unit : Apollo CS\nLocation : South Africa (Gauteng)\nReference Number : 50817540SG-01\nClosing Date : 10/20/2023\n \nMinimum Requirements\n\nQualification(s):\n• BSc/B Eng in Engineering at NQF8 with 480 credits\n\nRelated Minimum Experience:\n• 2 years related technical experience and engineering related technologies.\n• Professional Registration Body: Engineering Council of South Africa (ECSA) as a candidate engineer\n \nSkills and Competencies\n\nLeadership\n• Entrepreneurial mind-set\n• Ability to build effective relationship\n• Coaching and mentoring\n\nBehavioral\n• Strong drive to learn\n• Results and delivery focused\n• Integrity\n• Professionalism\n• Safety consciousness\n\nKnowledge\n• Technology\n• Design codes and standards\n• Engineering theory\n• Relevant processes, procedures, policies, guidelines, and legislation\n\nSkills\n• Engineering design\n• Technical problem solving\n• Analytical\n• Cost analysis, economic evaluation\n• Communication\n• Presentation\n• Technical report writing\n \nKey Responsibilities\n• Execute design work.\n• Contribute to the integrity of asset base.\n• Deliver standardized outputs.\n• Perform technical studies.\n• Consult on discipline related issues.\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitmenttx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \nENGINEER PROF ENGINEERING (RE-ADVERT) (TRANSMISSION DIVISION) APOLLO CONVERTER STATION – OLIFANTSFONTEIN\nVacancy type: External/Internal\nTask Grade : P13\nArea of Specialization : To provide engineering designs, and technical solutions\nDepartment : Operations\nBusiness Unit : Apollo CS\nLocation : South Africa (Gauteng)\nReference Number : 50817540SG-01\nClosing Date : 10/20/2023\n \nMinimum Requirements\n\nQualification(s):\n• BSc/B Eng in Engineering at NQF8 with 480 credits\n\nRelated Minimum Experience:\n• 2 years related technical experience and engineering related technologies.\n• Professional Registration Body: Engineering Council of South Africa (ECSA) as a candidate engineer\n \nSkills and Competencies\n\nLeadership\n• Entrepreneurial mind-set\n• Ability to build effective relationship\n• Coaching and mentoring\n\nBehavioral\n• Strong drive to learn\n• Results and delivery focused\n• Integrity\n• Professionalism\n• Safety consciousness\n\nKnowledge\n• Technology\n• Design codes and standards\n• Engineering theory\n• Relevant processes, procedures, policies, guidelines, and legislation\n\nSkills\n• Engineering design\n• Technical problem solving\n• Analytical\n• Cost analysis, economic evaluation\n• Communication\n• Presentation\n• Technical report writing\n \nKey Responsibilities\n• Execute design work.\n• Contribute to the integrity of asset base.\n• Deliver standardized outputs.\n• Perform technical studies.\n• Consult on discipline related issues.\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitmenttx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n\nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \nPRINCIPAL TECH OFFICIAL CUSTOMER NETWORK CENTRE (DISTRIBUTION) CALVINIA\nVacancy type: External/Internal\nTask Grade : T10\nArea of Specialization : To ensure the continuity of supply to customers by executing planning, operating, maintaining, repairing and building work according to policies, directive standards, procedures, work practices guidelines and service agreement on the electrical network up\nDepartment : Maintenance ＆ Operation s Kimberley Zone\nBusiness Unit : Gemma Cluster\nLocation : South Africa (Northern Cape)\nReference Number : GCNC49351219\nClosing Date : 10/18/2023\n \nMinimum Requirements\n\nQualification(s):\n• Senior Artisan Trade Certificate (Dry\n   Trade) at NQF4 with 120 credits\n \nRelated Minimum Experience:\n• 2 years Distribution network operating and maintenance\n \nSkills and Competencies\n\nBehavioural\n• Integrity\n• Customer centricity\n• Professionalism\n• Results orientation\n\n\nLeadership\n• Coaching\n• Mentoring\n• Developing teams\n• Working in a team towards a common goal\n• Lead and empower a team\n\nKnowledge\n• Eskom standards, procedures, directives and guidelines\n• Power plant specific transformers, auxiliary, switchgear theoretical knowledge at the required level\n• Quality management international organisation for standardisation (ISO) 9001 and 14001\n• Emergency response and safety\n• Basic health, safety, environment\n• Tools and specialised equipment.\n• Low and high voltage systems up to 132kV\n• High voltage (HV), medium voltage (MV) and low voltage (LV) line construction\n• Operating Regulations for High Voltage Systems (ORHVS) outcome 6 authorisation\n• Meter worker certification\n• Single phase tester\n• Crane operating\n• Mobile elevating platform operating\n• Auger drill operating\n• Rock drill operating\n\nSkill\n• ORHVS outcome 5\n• Public driver`s permit (PDP)\n• Valid driver’s licence (EC)\n• Safety management\n• Basic workshop\n• Communication\n• Sound interpersonal relations.\n \nKey Responsibilities\n• Perform maintenance.\n• Repair faults.\n• Build assets on the network.\n• Ensure health and safety.\n• Provide training.\n• Provide customer service.\n \nFor assistance with this Advert  please email recruitmentdx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \nASSISTANT OFFICER CATERING (MATIMBA POWER STATION)\nVacancy type: External/Internal\nTask Grade : T09\nArea of Specialization : Provides the Eskom kitchen with the best possible support and leadership to the allocated team of staff on any given shift so that the required standards are met, and guests leave satisfied. Substitutes for the Senior chefs in their absence\nDepartment : Finance and Services\nBusiness Unit : Matimba Power Station\nLocation : South Africa (Limpopo)\nReference Number : 50821327 HS Mat Gx\nClosing Date : 10/25/2023\n \nMinimum Requirements\n\n•Qualification(s):\n•Grade 12\n\n•Related Minimum Experience:\n•4 years’ related experience\nSkills and Competencies\n\n•Behavioural\n•Customer service skill\n•Attention to detail\n•Planning and organising\n•Professionalism\n•Communication\n•adaptability\n\n•Leadership\n•Team player\n•Knowledge\n•Knowledge of the control system\n\n\n•Skills\n•Basic computer skills\n•Basic financial skills\n\n•Attributes\n•Physical mobility\n \nKey Responsibilities\n•Ensure customer satisfaction\n•Control operating equipment\n•Revenue Control\n•Administrative support to contracts\n\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nFOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recuitmentgx@eskom.co.za\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \nASSISTANT OFFICER FINANCIAL ACCOUNTING X1 (GX KUSILE POWER STATION)\nVacancy type: External/Internal\nTask Grade : T10\nArea of Specialization : To provide an effective and efficient support function aligned with organisational policies, procedures, and applicable legislation and in support of sound financial controls and disciplines\nDepartment : Finance\nBusiness Unit : Kusile Power Station\nLocation : South Africa (Mpumalanga)\nReference Number : Fin-2023/18\nClosing Date : 10/18/2023\n \nMinimum Requirements\n\nQualification(s):\nNational Diploma in Finance at NQF 6 with 240 credits\n\nRelated Minimum Experience:\n2 Years in a Finance environment\n \nSkills and Competencies\n\n1. Behavioral:\n• Accountability\n• Integrity\n• Professionalism\n\n2. Leadership:\n• Team player\n\n3. Knowledge:\n• Budgeting and Forecasting (level 3)\n• Closing/Consolidation (level 3)\n• External Reporting (level 3)\n• Financial and Accounting (level 3) \n• Financial Analysis and Reporting (level 3)\n• Financial Forecasting and Projections (level 3)\n• Financial Information Compilation (level 3)\n• Information Interpretation (level 3)\n• Financial Risk Assessment (level 3)\n• Financial Systems (level 3)\n• General Ledger Maintenance (level 3)\n• Internal Control (level 3)  \n\n4. Skills:\n• Analytical \n• Communication\n• Interpersonal \n• Project management \n \nKey Responsibilities\n• Coordinate and facilitate foreign exchange processes.\n• Coordinate and facilitate retention management.\n• Maintain general ledger (GL) account management.\n• Maintain effective management of accounts receivable.\n• Provide an efficient service.\n• Process periodic month end processes.\n• Maintain effective controls and reporting.\n• Maintain stakeholder management.\n\nFor assistance with this advert, please email:\nrecuitmentgx@eskom.co.za\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \nSENIOR-CLERK-GENERAL-ADMINISTRATION-(DISTRIBUTION)-EAST-LONDON---SUNILAWS\nVacancy type: External\nTask Grade : T06\nArea of Specialization : To provide general administration services to the section\nDepartment : Property Management\nBusiness Unit : Cape Coastal Cluster\nLocation : South Africa (Eastern Cape)\nReference Number : RH 25/2023\nClosing Date : 10/18/2023\n \nMinimum Requirements\nQualification(s):\n• NCV3 / Grade 12 at NQF 4 with 120 Credits\n\nRelated Minimum Experience:\n• 2 years administrative experience\n \nSkills and Competencies\nLeadership\n• Team player\n\nBehavioural\n• Politeness\n• Promptness\n• Energetic\n• Self-starter\n• Assertive\n• Telephone etiquette\n\n\nKnowledge\n• Knowledge of Eskom’s policies and procedures\n\nSkill\n• Administrative skills\n• Communication skills\n• Sound interpersonal skills\n• Negotiation skills\n• Liaising skills\n \nKey Responsibilities\n• Performs section administration\n• Office control\n• Provide a basic advisory and reporting service\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \n Eskom is committed to providing a smoke-free environment for its employees and visitors at the workplace\n \n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitmentdx@eskom.co.za **\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \nSENIOR ADVISOR PLANNING AND SCHEDULING (TRANSMISSION) MEGAWATT PARK\nVacancy type: External/Internal\nTask Grade : G15\nArea of Specialization : To provide an effective planning and scheduling advisory and support service to ensure the project is well-planned and scheduled for timely completion\nDepartment : Project Management Office\nBusiness Unit : Office of the Group Executive\nLocation : South Africa (Gauteng)\nReference Number : 50821737DM\nClosing Date : 10/24/2023\n \nMinimum Requirements\n• Qualification(s):\nB Degree/B Tech/Advanced Diploma in Built Environment/Commerce/Human Sciences at NQF 7 with 360 credits\n\n• Related Minimum Experience:\n5 years’ experience in planning and scheduling/project management\n \nSkills and Competencies\n• Behavioral\n• Dealing with complexity\n• Decision making\n• Influencing and persuading\n• Resilience and flexibility\n• Working with authority\n\n• Leadership\n• Achievement oriented\n• Integrity and values\n• Business acumen\n• Coaching and mentoring\n• Teamwork/collaboration\n• Providing direction through change\n\n• Knowledge\n• Earned value management (EVM)\n• Planning and scheduling\n• Project management\n• Contracts management\n• Cost engineering\n• Construction management\n\n• Skill\n• Analysis/judgement/problem solving\n• Negotiation/persuasiveness\n• Planning and organising\n• Communication and engagement\n \nKey Responsibilities\n• Provide project planning and scheduling throughout all stages of the project life cycle\n• Perform project execution and progress planning and scheduling\n• Manage the master schedule and database\n• Coordinate the updating of plans and report on progress\n• Mentor and coach new planners and schedulers\n• Comply with Eskom and site relevant governance, safety, health, environment, risk, and quality (SHERQ) requirements\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL **\nrecruitmenttx@eskom.co.za\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and  targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \n(RE-ADVERT) ENGINEER PROF ELECTRICAL X2 PLANT SECTOR-POLOKWANE (DX)\nVacancy type: External/Internal\nTask Grade : P13\nArea of Specialization : To provide engineering designs, asset care and technical solutions.\nDepartment : Maintenance ＆ Support (Plant Management)\nBusiness Unit : Limlanga Cluster\nLocation : South Africa (Limpopo)\nReference Number : LOUAAA254-13\nClosing Date : 10/18/2023\nMinimum Requirements\n\n•Qualification(s):\nBSc Eng. or B Eng. in Mechanical / Electrical / Electronics / Mechatronic / Computer / Civil / Chemical / Metallurgical / Industrial Engineering.\n\n•Related Minimum Experience:\n2 years’ technical experience in Power Generation, Transmission or Distribution.\n\n•Professional Registration Body:\nECSA as a Candidate Engineer.\n \nSkills and Competencies\n\n•Leadership\no Strong communication skills\no Entrepreneurial mindset\no Ability to build effective relationships and delivery on expectations\no Coaching and mentoring\n\n•Behavioral\no Strong drive to learn,\no Be results and delivery focused\no Integrity\no Safety consciousness\no Professionalism\n\n•Knowledge\no Power plant system and technology knowledge\no Design Codes and standards\no Engineering theory knowledge\no Knowledge of relevant processes. policies, guidelines, and legislations\no Engineering design skills\no Technical problem-solving skills\no Analytical skills\no Cost analysis/economic evaluation skills\no Be able to work as part of a team\no Communication skills\no Presentation skills\no Technical report writing\no Safety consciousness\n\n•Skill\no Extensive experience in successful plant configuration and project management\no Technical problem-solving skills\no Analytical skills.\no Life cycle planning skills,\no Presentation skills.\no Multi-disciplinary problem-solving\no Communication skills\n\n•Attributes\no Hearing\no Visual acuity\no Colour vision\no Eye/hand/feet co-ordination\no Physical strength\no Mobility/Agility\n\n•Assessment\no Interview\no Use scenario sketching\no Psychometric Assessment\n \nKey Responsibilities\nExecutes design work.\nContributes to the integrity of the asset base.\nDelivers standardisation outputs.\nPerforms technical studies.\nConsults on discipline related issues.\n\n\nFOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL (recruitmentdx@eskom.co.za)\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \n(RE-ADVERT) ENGINEER PROF ELECTRICAL X2 NETWORK OPTIMISATION-POLOKWANE (DX)\nVacancy type: External/Internal\nTask Grade : P13\nArea of Speacialization : To provide engineering designs, asset care and technical solutions.\nDepartment : Maintenance and Operations – Network Operations and Support\nBusiness Unit : Limlanga Cluster\nLocation : South Africa (Limpopo)\nReference Number : LLP93 Re-ad2\nClosing Date : 10/18/2023\n \nMinimum Requirements\n\n•Qualification(s):\nBSc Eng. or B Eng. in Mechanical / Electrical / Electronics / Mechatronic / Computer / Civil / Chemical / Metallurgical / Industrial Engineering.\n\n•Related Minimum Experience:\n2 years’ technical experience in Power Generation, Transmission or Distribution.\n\n•Professional Registration Body:\nECSA as a Candidate Engineer.\n \nSkills and Competencies\n\n•Leadership\no Strong communication skills\no Entrepreneurial mindset\no Ability to build effective relationships and delivery on expectations\no Coaching and mentoring\n\n•Behavioral\no Strong drive to learn,\no Be results and delivery focused\no Integrity\no Safety consciousness\no Professionalism\n\n•Knowledge\no Power plant system and technology knowledge\no Design Codes and standards\no Engineering theory knowledge\no Knowledge of relevant processes. policies, guidelines, and legislations\no Engineering design skills\no Technical problem-solving skills\no Analytical skills\no Cost analysis/economic evaluation skills\no Be able to work as part of a team\no Communication skills\no Presentation skills\no Technical report writing\no Safety consciousness\n\n•Skill\no Extensive experience in successful plant configuration and project management\no Technical problem-solving skills\no Analytical skills.\no Life cycle planning skills,\no Presentation skills.\no Multi-disciplinary problem-solving\no Communication skills\n\n•Attributes\no Hearing\no Visual acuity\no Colour vision\no Eye/hand/feet co-ordination\no Physical strength\no Mobility/Agility\n\n•Assessment\no Interview\no Use scenario sketching\no Psychometric Assessment\nKey Responsibilities\n\nExecutes design work.\nContributes to the integrity of the asset base.\nDelivers standardisation outputs.\nPerforms technical studies.\nConsults on discipline related issues.\n\n\nFOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL (recruitmentdx@eskom.co.za)\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \nRE ADVERT SENIOR ENGINEER ASSET INVESTMENT PLANNING AND DEVELOPMENT (TX MWP)\nVacancy type: External/Internal\nTask Grade : P16\nArea of Specialization : To develop a ten year refurbishment investment plan compliant with customer and National Energy Regulator(NER) requirements, implement, develop, maintain processes and systems to establish a robust optimised\nDepartment : Asset Investment Planning\nBusiness Unit : Asset Management\nLocation : South Africa (Gauteng)\nReference Number : 50816147SPL 01\nClosing Date : 10/18/2023\nMinimum Requirements\nBSc Eng/B Eng in Mechanical/\nChemical/Electrical/ Electronic/\nMechatronic/Computer/Civil/\nMetallurgical/Industrial Engineering at\nNQF8 with 480 credits\n\n4 years’ Experience in Experience in network planning, design, development,\noperations and maintenance of power systems\n\nProfessional Registration Body: Engineering Council of South Africa (ECSA) as professional engineer\n \nSkills and Competencies\n\nBehavioural:\n• Integrity\n• Honesty\n• Trustworthiness\n• Strong drive to learn\n• Safety consciousness\n• Professionalism\n• Self-starter\n\nLeadership:\n• Team player\n• Motivating teams\n• Coaching\n• Mentoring\n• Developing\n• Entrepreneurial mind-set\n• Build effective relationships and delivery on expectations\n• Results and delivery focused\n\nKnowledge:\n• Technology strategy formulation, forecasting, road mapping\n• Risk analysis principles\n• Project management principles\n• Sound knowledge and understanding of all electrical plant systems, network design and operations\n• Understanding design, maintenance base and operator training system (OTS)\n• Business processes management.\n• Division investment approval and project life-cycle model\n• Portfolio investment planning and optimisation\n• Accounting knowledge for consolidating business cases\n\nSkills\n• Strategic thinking\n• Negotiation\n• Analytical\n• Financial management\n• Communication and presentation\n• Leadership\n• Dynamic, hardworking and work under pressure\n• Problem solving\n \nKey Responsibilities\n1. Ensure technical deliverables, services to internal and external customers.\n2. Develop discipline specific philosophies, technical standards, procedures, work practices and specifications for approval.\n3. Manage governance and finances.\n4. Participate in national and international technical forums.\n5. Provide professional technical leadership.\n\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL**\nrecruitmenttx@eskom.co.za\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.\nCandidates with disabilities are encouraged to apply for positions.”\n\n\nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n \n ",
                " \n \n \n \nMIDDLE MANAGER PROJECT PORTFOLIO DELIVERY (TRANSMISSION) MEGAWATT PARK\nVacancy type: External/Internal\nTask Grade : M18\nArea of Specialization : To be accountable for planning, implementing, managing, and maintaining professional project support strategies, services, resources, and controls required for the success of the projects.\nDepartment : Project Management Office\nBusiness Unit : Office of the Group Executive\nLocation : South Africa (Gauteng)\nReference Number : 50821552DM\nClosing Date : 10/24/2023\n \nMinimum Requirements\n• Qualification(s):\n\nB-Degree/B Tech / Advanced Diploma in Built Environment/ Commerce/ Human Sciences at NQF7 with 360 credits\n\n• Related Minimum Experience:\n7 years’ experience in Project Management\n \nSkills and Competencies\n• Behavioral\n• Resilience and flexibility\n• Integrity and values\n• Professionalism\n• Trustworthiness\n\n• Leadership\n• Strategy generation and alignment\n• Change leadership\n• Stakeholder mobilisation management\n• Represents Eskom\n• Embraces diversity\n• Emotional maturity\n• Negotiation and conflict resolution\n• Business acumen\n• Teamwork, collaboration\n• Dealing with complexity\n• Working with authority\n• Providing direction through change\n• Strategic thinking\n• Building, develop teams\n• Building cross boundary, cultural relationship\n\n• Knowledge\n• Programme management\n• Project Management Body of Knowledge (PMBOK) and other project management systems and tools\n• Construction management and regulations\n• Earned value management (EVM)\n• Contracts management\n• Quantity surveying\n• Financial management\n• General management\n• Portfolio strategic alignment\n• Portfolio governance management\n• Portfolio performance management\n• Portfolio risk management\n• Portfolio stakeholder management\n\n• Skill\n• Analytical\n• Judgement and decision making\n• Problem solving\n• Influencing and persuading\n• Client focus\n• Organisational communication\n• Delegation of authority and responsibility\n• Developing organisational talent\n• Negotiation, persuasiveness\n• Planning and organising\n• Strategic functional leadership\n\n\nKey Responsibilities\n• Lead the development of project management procedures, guidelines, and standards\n• Manage portfolio accounting, costing and cost control systems\n• Monitor, assess and improve the execution of projects\n• Manage portfolio planning and schedule control processes\n• Establish and manage the project contracting environment\n• Act as a project management centre of excellence\n• Manage programme and project management mentoring and coaching\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL **\nrecruitmenttx@eskom.co.za\n \n “If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \n(RE-ADVERT) SNR ENGINEER PROF ENGINEERING SUPPORT-NETWORK PROTECTION-POLOKWANE (DX)\nVacancy type: External/Internal\nTask Grade : P16\nArea of Specialization : The provision of specialised M&O engineering services to Generation, Transmission or Distribution OUs to optimise asset performance in the short, medium and long term.\nDepartment : Maintenance and Operations – Network Operations and Support\nBusiness Unit : Limlanga Cluster\nLocation : South Africa (Limpopo)\nReference Number : LOUAAA261-12\nClosing Date : 10/18/2023\n \nMinimum Requirements\n\n•Qualification(s):\nB.Sc. Eng. / B.Eng. Mechanical, Chemical, Electrical, Electronic, Civil, Metallurgical or Industrial Engineering.\n\n•Related Minimum Experience:\n4 years’ related experience in the technical operations of power generation or delivery (Transmission and Distribution) infrastructure including demonstration of prior responsibility in this function.\n\n•Professional Registration Body:\nECSA Registered Pr. Engineer.\nSkills and Competencies\n\n•Leadership\no Strong communication skills\no Entrepreneurial mind-set\no Ability to build effective relationships and delivery on expectations\no Coaching and Mentoring\n\n•Behavioral\no Strong drive to learn\no Be results and delivery focused \no Be able to work as part of a team\no Integrity\no Safety consciousness\no Professionalism\n\n•Knowledge\no Management of Technology principles (MOT)\no Risk analysis principles\no Project management principles\no Sound knowledge and understanding of all electrical plant systems, network design and operation\no Electrical system analytical skills\no Understanding of Design Base, OTS and Maintenance Base\no Knowledge of Business Processes Management\no Superior Analytical and Problem-Solving Ability\n\n•Skill\no Strategic Thinking skills\no Negotiation skills\no Management of Technology principles (MOT)\no Risk analysis principles\no Project Management principles\no Sound knowledge and understanding of all electrical plant systems, network design and operation\no Electrical System analytical Skills\no Financial Management Skills\no Communication and presentation Skills\no Leadership Skills\n\n•Attributes\no Depth perception\no Stamina\no Communication Skills\n\n•Assessment\no Interview\no Demonstrate experience\no Use scenario sketching\no Ability to see the big picture\no Psychometric assessment\n \nKey Responsibilities\nProvides specialised planned (and sometimes unplanned) M&O Engineering support to the OUs.\nDevelops discipline-specific philosophies, technical standards, procedures, work practices and specifications.\nDevelops discipline-specific direction setting for improving plant availability through effective M&O execution.\nProvides input into and conducts research to improve M&O operations\nRepresent Eskom in relevant technical forums.\nManages and conducts product, equipment, material, service and change impact evaluations\nProvides a technical consulting and investigation service within the OU.\nProvides professional technical leadership over engineers within their own discipline.\n\n\nFOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL (recruitmentdx@eskom.co.za)\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \nSENIOR CLERK GENERAL ADMINISTRATION (DISTRIBUTION) BELLVILLE/BRACKENFELL\nVacancy type: External\nTask Grade : T06\nArea of Specialization : To provide general administration services to the section\nDepartment : Property Management\nBusiness Unit : Cape Coastal Cluster\nLocation : South Africa (Western Cape)\nReference Number : RH 26/2023\nClosing Date : 10/18/2023\n \nMinimum Requirements\n\nQualification(s):\n• NCV3 / Grade 12 at NQF 4 with 120 Credits\n • 2 years administrative experience\n \nSkills and Competencies\n\n• Leadership\n• Team player\n\n• Behavioural\n• Politeness\n• Promptness\n• Energetic\n• Self-stater\n• Assertive\n• Telephone etiquette\n\nKnowledge\n• Knowledge of Eskom’s policies and procedures\n\nSkill\n• Administrative skills\n• Communication skills\n• Sound interpersonal skills\n• Negotiation skills\n• Liaising skills\n \nKey Responsibilities\n• Performs section administration\n• Office control\n• Provide a basic advisory and reporting service\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace\n \n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitmentdx@eskom.co.za **\n \nPLEASE APPLY HERE\n \n \n ",
                " \n \n \n \nRE ADVERT SNR ADVISOR BUSINESS PROCESS AND STANDARDS (TX MWP)\nVacancy type: External/Internal\nTask Grade : G16\nArea of Specialization : To provide specialist consultation services to ensure standardised, integrated and best practices within project management and other asset creation environments through enabling technologies, materials, procedures, standards, guidelines, capabilities and\nDepartment : Asset Investment Planning\nBusiness Unit : Asset Management\nLocation : South Africa (Gauteng)\nReference Number : 50817434SPL 01\nClosing Date : 10/18/2023\n \nMinimum Requirements\n\n•Qualification(s):\nB Degree/B Tech/National Higher\nDiploma/Advanced Diploma in\nCommerce/Built Environment at NQF7\nwith 360 credits.\n\n•Related Minimum Experience:\n5 Years’ Experience related to engineering, construction, project, programme management and/or other asset creation\nenvironments or related support disciplines\n\nProfessional Registration:\nNot Applicable\n \nSkills and Competencies\n•Behavioural\n• Professionalism, competence and credibility\n• Discretion and maturity\n• Honesty, integrity and trustworthiness\n• Flexibility and ability to work within an undefined and continuously changing environment\n• Resilient and ability to operate effectively in matrix environment\n• Emotional intelligence\n\n•Leadership\n1. Displayed leadership, interpersonal and teamwork\n2. Act as a coach and/or mentor\n3. Lead and manage multiple projects simultaneously\n4. Results orientation\n5. Expert stakeholder management\n6. Manage risk and organisational change\n\n•Knowledge\n• Related practices used by Eskom with a specialist knowledge of the area of expertise\n• Expert knowledge of components of holistic project management business\n• Business values, concepts, systems, models, processes and value chains\n• In-depth understanding of project management and other asset creation functional requirements\n• Designing and implementing related solutions\n• Business systems and skills development techniques\n• In-depth understanding of capital investment and other asset creation management processes\n• Understanding project management role in groups and Eskom\n• Commercial, governance, procurement and legal processes and requirements\n• Eskom’s business, Eskom Project Management Office (EPMO) strategic goals and priorities\n• Working knowledge of relevant Eskom policies, procedures and guidelines\n• Divisional businesses\n• Capability design and development\n• Process and system design and maintenance\n• Assess business risks and estimate financial impact of project management alternatives and solutions\n• Evaluate and translate project management and other asset creation business needs into integrated best practice solutions\n\n•Skill\n• Presentation\n• Interpersonal\n• Research, analyse and prepare information\n• Analytical, technical, planning and organisational\n• Communication at all levels\n• Cope with stress and work under pressure\n• Network internal and external to the organisation\n• Apply multiple solutions to business problems\n• Rapidly comprehend the functions and capabilities of new technologies or practices\n• Expert ability in problem solving\n• Experience in project management environment regarding successful or failed projects\n• Facilitation, negotiation and conflict resolution\n• Expert strategic analysis and decision making\n \nKey Responsibilities\n1. Provide specialised services for improvement of work practices and skills base.\n2. Consult with stakeholders to understand and interpret functional requirements.\n3. Provide mentorship and coaching to resources.\n4. Provide guidance to business on project processes and standards.\n5. Provide support in local and international research of project best practices, solutions and global trends.\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL**\nrecruitmenttx@eskom.co.za\n\n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n\nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE\n \n \n \n ",
                " \n \n \n \nRE-ADVERT SENIOR ENGINEER PROF ENGINEERING C AND I X1 (GENERATION) PEAKING\nVacancy type: External/Internal\nTask Grade : P16\nArea of Specialization : The development and support of suitable technologies, processes, standards, specifications, and designs.\nDepartment : Control and Instrumentation Engineering\nBusiness Unit : Peaking Operating Unit\nLocation : South Africa (Western Cape)\nReference Number : 50515198SL Gx Peaking1\nClosing Date : 10/24/2023\n \nMinimum Requirements\nQualification(s):\n• BSc Eng/ B Eng – Electrical/ Electronic / Mechatronics Engineering\n\nExperience:\n• 4 Years post qualification experience in Control and Instrumentation\n\nProfessional Registration:\n• ECSA Professional Engineer\nSkills and Competencies\n• Behavioural:\no Strong drive to learn\no Be results and delivery focused\no Be able to work as part of a team\no Integrity\no Safety consciousness\no Professional\n\n• Leadership:\no Strong communication skills\no Entrepreneurial mind-set\no Ability to build effective relationships and delivery on expectations\no Coaching and mentoring\n\n• Knowledge:\no Technology Strategy Formulation\no Technology Forecasting\no Technology Roadmapping\no Management of Technology projects\no Risk analysis principles\no Project management principles\no Sound knowledge and understanding of all mechanical plant systems especially hydro and pumped storage and operation thereof.\no Hydro and pumped storage system analytical skills\no Understanding of Design Base, OTS and maintenance base\no Knowledge of Business Processes Management\no Superior analytical and problem solving ability\n\n• Skills\no Strategic thinking skills\no Negotiation skills\no Risk analysis principles\no Project management principles\no Sound knowledge and understanding of all mechanical plant systems and operation\no Mechanical system analytical skills\no Financial management skills\no Communication and presentation skills\no Leadership skills\n\n• Attributes\no Depth perception\no Communication skills\n \nKey Responsibilities\n• Provides professional technical leadership over engineers within their own discipline\n• Manages and conducts products, equipment, material, service, and change impact evaluations\n• Participate in national and international technical forums\n• Conducts discipline-specific research into new technologies\n• Provides input into discipline-specific technology vision, strategy and direction setting\n• Develops discipline specific philosophies, technical standards, procedures, work practices and specifications for approval\n• Provides a technical consulting and investigation service for customers\n• Produces and integrates engineering solutions/designs for asset creation on behalf of customers at various stages of the project lifecycle\n \nFor assistance with this advert, please email: recuitmentgx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.” \n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace.\n \nPLEASE APPLY HERE",
                "ENGINEER PROF ENGINEERING (TRANSMISSION DIVISION) RUSTENBURG\nVacancy type: External/Internal\nTask Grade : P13\nArea of Specialization : To provide engineering designs, and technical solutions\nDepartment : Secondary Plant\nBusiness Unit : Northern Grid\nLocation : South Africa (North West)\nReference Number : 50817187SG-01\nClosing Date : 10/20/2023\n \nMinimum Requirements\n\nQualification(s):\n• BSc/B Eng in Engineering at NQF8 with 480 credits\n\nRelated Minimum Experience:\n• 2 years related technical experience and engineering related technologies.\n• Professional Registration Body: Engineering Council of South Africa (ECSA) as a candidate engineer\nSkills and Competencies\n\nLeadership\n• Entrepreneurial mind-set\n• Ability to build effective relationship\n• Coaching and mentoring\n\nBehavioral\n• Strong drive to learn\n• Results and delivery focused\n• Integrity\n• Professionalism\n• Safety consciousness\n\nKnowledge\n• Technology\n• Design codes and standards\n• Engineering theory\n• Relevant processes, procedures, policies, guidelines, and legislation\n\nSkill\n• Engineering design\n• Technical problem solving\n• Analytical\n• Cost analysis, economic evaluation\n• Communication\n• Presentation\n• Technical report writing\n \nKey Responsibilities\n• Execute design work.\n• Contribute to the integrity of asset base.\n• Deliver standardized outputs.\n• Perform technical studies.\n• Consult on discipline related issues.\n\n\n** FOR ASSISTANCE WITH THIS ADVERT, PLEASE EMAIL recruitmenttx@eskom.co.za\n \n“If you have not been contacted within 28 days after the closing date of this advertisement, please accept that your application was unsuccessful.”\n \n“Eskom is committed to equality, employment equity, and diversity. In accordance with the employment equity plan of Eskom and its employment equity goals and targets, preference may be given, but is not limited, to candidates from under-represented designated groups.  Eskom reserves the right not to make an appointment to the posts as advertised.  Candidates with disabilities are encouraged to apply for positions.”\n \nEskom is committed to providing a smoke-free environment for its employees and visitors at the workplace\n \nPLEASE APPLY HERE"
            ],
            "postedDate": "11/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/national-credit-regulator-ncr_orig.jpg",
            "href": "https://www.govpage.co.za/national-credit-regulator-ncr-vacancies-blog/national-credit-regulator-ncr-vacancies3740605",
            "title": "NATIONAL CREDIT REGULATOR (NCR) VACANCIES",
            "content": [
                " \nNATIONAL CREDIT REGULATOR (NCR)\n \nThe National Credit Regulator (NCR) was established as the regulator under the National Credit Act 34 of 2005 (the Act) and is responsible for the regulation of the South African credit industry. It is tasked with carrying out education, research, policy development, registration of industry participants, i.e. credit providers, credit bureaux, alternative dispute resolution agents, payment distribution agents and debt counsellors, investigation of complaints, and enforcement of the Act.\nThe Act requires the NCR to promote the development of an accessible credit market, particularly to address the needs of historically disadvantaged persons, low income persons, and remote, isolated or low density communities. \n ",
                " \nThe NCR invites applications from suitable candidates for the following position:\n \n \n Call Centre Agent X2 \nPaterson Grade: B-Lower \nSalary ranges from R64 700 – R116 500 maximum \nRequirements:\n▪ A Grade 12 certificate, with one year post matric qualification in customer service or relevant qualification, with at least one year’s relevant experience in a customer service industry. \n▪ A certificate in debt counselling will be an added advantage. \n \nDuties:\n▪ Act as point of first contact with stakeholders and thus representing the face of the NCR. \n▪ Interface with consumers via inbound calls, e-mails, and faxes for the purpose of resolving enquiries related to the NCA. \n▪ Retrieving telephone messages and returning calls timeously. \n▪ Probe and query consumers to assess needs and provide useful information on general and debt counselling matters. \n▪ Participate in activities designed to improve customer satisfaction and business performance. \n▪ Competently update and retrieve records on the Complaints Management Systems and deal with other administrative functions as required. \n \nSkills:\n▪ Basic computer proficiency. \n▪ Clear communication skills. \n▪ Ability to listen with empathy and to interpret information correctly. \n▪ Good time management skills. \n▪ Strong interpersonal and problem-solving skills. \n▪ Conflict management skills. \n▪ A strong service and results orientation. \n▪ Team player with the ability to multitask. \n▪ Call handling techniques. \n \nKnowledge:\n▪ Debt counselling procedures. \n▪ Background on the National Credit Act.",
                "Closing Date: 16 October 2023\n \nThe National Credit Regulator is an equal opportunity organisation which offers competitive market related packages.\n \nSuitable persons should send a detailed CV quoting the relevant reference number to: IF-Recruitment@ncr.org.za\n \nCorrespondence will only be entered into with short listed candidates. The National Credit Regulator reserves the right not to make an appointment.\n \nRef: CLA/10/23"
            ],
            "postedDate": "11/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/prasa_orig.gif",
            "href": "https://www.govpage.co.za/passenger-rail-agency-of-south-africa-prasa-blog/passenger-rail-agency-of-south-africa-prasa-vacancies5586894",
            "title": "PASSENGER RAIL AGENCY OF SOUTH AFRICA (PRASA) VACANCIES",
            "content": [
                " \nPASSENGER RAIL AGENCY OF SOUTH AFRICA (PRASA)\n ",
                "INTERNAL AND EXTERNAL\n \nCHIEF EXECUTIVE OFFICER: PRASA TECHNICAL, 5-YEAR PERFORMANCE-BASED CONTRACT \nSALARY GROUP: Executive Management \nLOCATION: PRASA Corporate \nDEPARTMENT: Office of the Group Chief Executive Officer \nPOST NUMBER: TBA \nREFERENCE: R&S/CEO/TECHCEO/267\nDEPARTMENTAL MISSION: To lead and direct the operations of PRASA Technical and drive PRASA Group’s capital projects\n \nOUTPUTS:\n• Develop, implement, and monitor a strategy for PRASA Technical\n• Provision of direction and oversight over the Division’s operations\n• Direct and oversee corporate governance, compliance, and risk management\n• Management of resources\n• Reporting and advisory services \n \nKNOWLEDGE: \n• Business acumen\n• Relevant legislation applicable to PRASA Technical\n• Business environment, the relevant role players within the business and their key responsibilities and outcomes\n• Principles of finance and the components involved in finance, human, supply chain and contract management\n \nSKILLS:\n• Leadership and Management\n• Problem-solving and decision-making\n• Communication and interpersonal\n• Collaborating and negotiation\n• Strategic and tactical thinking\n \nATTITUDES:\n• Adaptable and innovative\n• Honesty and integrity\n• Tact and diplomacy\n• Detail and result-oriented\n• Customer centricity\n \nCAPABILITIES:\nMINIMUM REQUIREMENTS:\n• Masters in engineering\n• Registration with the Engineering Council of South Africa as a Professional Engineer / Technologist is advantageous\n• 24/7 availability\n• Extended working hours\n• Travel – locally and international\n \nEXPERIENCE\n• 15 year’s experience in the Engineering/ Technical field with 5 years’ experience operating at an executive management level.",
                " \nPlease apply by completing an internal application form and submitting this together with your complete CV to: Ms. Tara Chhiba Ravjee or e-mail response@nkwalim.co.za or tara@nkwalim.co.za\n \nPlease note that: “applicants who previously applied should apply again”. \n \nCLOSING DATE: 14th October 2023 \n \nShould you not hear from us within three (3) months from the closing date, please consider your application unsuccessful. By responding to this vacancy advert irrespective of how such information is submitted, you consent to the collection, collation, processing and storing for such information and the use and disclosure of such information per the PRASA data privacy protection policy. PRASA shall take all reasonable measures to protect the personal information of candidates/applicants and for the purpose of this disclaimer “personal information” shall be defined as detailed in the Promotion of Access to Information Act, Act 2 of 2000 (“PAIA”) and the Protection of Personal Information Act, Act 4 of 2013 (“POPI”) A copy of PRASA’s Privacy notice is available on the website or on request. \n \nISSUED BY SENIOR MANAGER RECRUITMENT AND SELECTION \nAs per PRASA Employment Equity Plan, this position is earmarked as follows: \nMALE: African, Indian, Coloured, White\nFEMALE: African, Indian, Coloured, White"
            ],
            "postedDate": "11/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/seda_orig.jpg",
            "href": "https://www.govpage.co.za/small-enterprise-development-agency-seda-vacancies-blog/small-enterprise-development-agency-seda-vacancies6027325",
            "title": "SMALL ENTERPRISE DEVELOPMENT AGENCY (SEDA) VACANCIES",
            "content": [],
            "postedDate": "11/10/2023",
            "iframe": null
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/sanparks-logo.png?1697053789",
            "href": "https://www.govpage.co.za/south-african-national-parks-sanparks-vacancies-blog/south-african-national-parks-sanparks-vacancies5630453",
            "title": "SOUTH AFRICAN NATIONAL PARKS (SANPARKS) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN NATIONAL PARKS (SANPARKS)\n ",
                " \n \nClerk: Human Capital Management\nPark:\nAddo Elephant National Park\n \nDescription:\nFixed Term Contract Ending March 2027: 3 Years\nPaterson Grading: B3\n \nThe remuneration package includes a basic salary, based on the salary scale of a position with a Paterson B3 job grade and allowances and benefits as specified in the HR Tariff Document and Conditions of Service of SANParks. The successful candidate will have to provide their own accommodation as there is no official accommodation in the park.\nThe appointment will be in accordance with EE plan targets.\n \nRequirements:\nGrade 12 certificate with a National Diploma in Human Resources Management (NQF Level 6)\nMinimum of two (2) years’ experience in Human Capital Management\nA valid Code B driver's license is essential.\nExcellent Computer skills in MS Word, MS Excel, MS PowerPoint, and MS Outlook are a prerequisite.\nWorking knowledge of SAGE 300 people is an added advantage.\nWorking knowledge of relevant Human Resources legislation, as well as HCM Policies, Procedures and Practices\nHave attention to detail.\nSound written and verbal communication and interpersonal skills\nApplicant must have a sense of initiative, be flexible and have the ability to meet deadlines and work independently without supervision\n \nResponsibilities:\nExecute Human Capital Management administration associated with the recruitment process, such as capturing CVs received, screening/shortlisting of applicants, contacting shortlisted candidates, reference checks, arranging logistics of interviews and participating in interviews.\nExecute monthly HR Payroll duties such as checking/verifying attendance registers and consolidating leave.\nCapture and maintain staff information on the SAGE 300 people system.\nCoordinate wellness and training interventions and record keeping\nCompile and submit monthly/quarterly/annual HR reports for Regional HR Manager and Wildlife Conservation Bond Project Manager.\nRepresent Human Capital Management in disciplinary hearings and interviews.\nManage and coordinate the maintenance and updating of Human Capital Management filing for all employees in the project.\nAdvise line managers and other staff on HCM policies and practices.\nAttend to HCM-related queries face-to-face, telephonically and via email.\nGeneral daily admin duties as required within the project.",
                "Supporting documents such as a detailed CV, certified copies of qualifications, ID and driver's License, and other relevant documents must be emailed.\nUse reference number HUMAN CAPITAL CLERK in the subject line.\n \nApplications that do not comply with the application process will be regarded as incomplete and not considered.\n \nOnly interested persons who meet the above-stated requirements should apply using the below link: https://forms.office.com/r/b5KbX0uzSW\n \nThe application will only be completed when you have applied through the link and have submitted all your relevant documents to the following email address: glenda.hlungwani@sanparks.org\n \nFor enquiries:\nContact Glenda Hlungwani\nTel: 042 233 8607\n \nCLOSING DATE: 24 October 2023\n \nApplications that have not been responded to within 21 days should be regarded as unsuccessful.\n \nSANParks is committed to the principles of employment equity. Preference will be given to PDI / HDSA."
            ],
            "postedDate": "11/10/2023",
            "iframe": ""
        }
    ],
    "departments": {
        "gauteng department of social development bursaries and financial assistance for study purpose - 2024": "https://www.govpage.co.za/gauteng-department-of-social-development-vacancies-blog/gauteng-department-of-social-development-bursaries-and-financial-assistance-for-study-purpose-2024",
        "kwazulu natal department of transport - thuthuka skills development driver’s licence programme": "https://www.govpage.co.za/kwazulu-natal-transport-vacancies-blog/kwazulu-natal-department-of-transport-thuthuka-skills-development-drivers-licence-programme",
        "limpopo department of agriculture vacancies": "https://www.govpage.co.za/limpopo-agriculture-vacancies-blog/limpopo-department-of-agriculture-vacancies2097342",
        "limpopo department of health student nurse training for the diploma in nursing: general (r.171) for the academic year 2024.": "https://www.govpage.co.za/limpopo-health-vacancies-blog/limpopo-department-of-health-student-nurse-training-for-the-diploma-in-nursing-general-r171-for-the-academic-year-2024",
        "city of johannesburg vacancies": "https://www.govpage.co.za/city-of-johannesburg-metropolitan-municipality-vacancies-blog/city-of-johannesburg-vacancies8668436",
        "city of tshwane vacancies": "https://www.govpage.co.za/city-of-tshwane-metropolitan-municipality-vacancies-blog/city-of-tshwane-vacancies2516652",
        "emalahleni local municipality vacancies": "https://www.govpage.co.za/emalahleni-local-municipality-vacancies-blog-497715/emalahleni-local-municipality-vacancies8909434",
        "agricultural research council (arc) vacancies": "https://www.govpage.co.za/agricultural-research-council-arc-vacancies-blog/agricultural-research-council-arc-vacancies2369507",
        "central energy fund (cef) vacancies": "https://www.govpage.co.za/central-energy-fund-cef-vacancies-blog/central-energy-fund-cef-vacancies9365815",
        "commission for conciliation, mediation and arbitration (ccma) vacancies": "https://www.govpage.co.za/commission-for-gender-equality-cge-vacancies-blog/commission-for-conciliation-mediation-and-arbitration-ccma-vacancies",
        "eskom vacancies": "https://www.govpage.co.za/eskom-vacancies-blog/eskom-vacancies4498144",
        "national credit regulator (ncr) vacancies": "https://www.govpage.co.za/national-credit-regulator-ncr-vacancies-blog/national-credit-regulator-ncr-vacancies3740605",
        "passenger rail agency of south africa (prasa) vacancies": "https://www.govpage.co.za/passenger-rail-agency-of-south-africa-prasa-blog/passenger-rail-agency-of-south-africa-prasa-vacancies5586894",
        "small enterprise development agency (seda) vacancies": "https://www.govpage.co.za/small-enterprise-development-agency-seda-vacancies-blog/small-enterprise-development-agency-seda-vacancies6027325",
        "south african national parks (sanparks) vacancies": "https://www.govpage.co.za/south-african-national-parks-sanparks-vacancies-blog/south-african-national-parks-sanparks-vacancies5630453"
    }
}