{
    "title": "govpage-public-sector",
    "blogPosts": [
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/icasa_orig.png",
            "href": "https://www.govpage.co.za/independent-communications-authority-of-south-africa-icasa-vacancies-blog/independent-communications-authority-of-south-africa-icasa-vacancies6535425",
            "title": "INDEPENDENT COMMUNICATIONS AUTHORITY OF SOUTH AFRICA (ICASA) VACANCIES",
            "content": [
                " \nINDEPENDENT COMMUNICATIONS AUTHORITY OF SOUTH AFRICA (ICASA) \n ",
                " \nCHIEF AUDIT EXECUTIVE\nCenturion\nFixed Term\nFull Tie\nR1 729,126.00 - R2 034,265.00\nEE/AA, Non EE/AA\n \nEASY APPLY\n \nIntroduction\nWe are looking for a CHIEF AUDIT EXECUTIVE to join the team. \n \nPurpose of the job                                                                                               \nTo provide an independent and objective assurance on internal controls, risk management and governance. To support the Council and the Audit Risk Ethics and Disclosures Committee (AREDC) to examine, evaluate and report on the adequacy of controls within ICASA.\n \nDuties and Responsibilities\nDirect the identification, evaluation and monitoring of key risk areas, and develop the Audit Strategy and the Annual Audit Plan\nPrepare a 3-year rolling audit plan\nLead the audit function in playing a strategic role in embedding the principles of good governance and in ensuring that the standards of ethical behaviour are upheld\nProvide value-added consulting activities that offer proactive as opposed to reactive assurance\nPrepare and annually review the  Internal Audit and AREDC Charters\nConsult and provide technical and operational assistance to the business on implementing best practices in Internal Control and on improving its risk management process\nContinuously monitor and report on improvement areas to ensure compliance with all relevant legislation and regulation (e.g. PFMA, Treasury and GRAP  as well as the Professional Practice of Internal Auditing and the company's policies and procedures)\nEnsure that Corporate Governance processes are adequately managed\nConduct preliminary reviews of systems and business processes, and identify key risk areas\nMaintain stakeholder relations with Council, EXCO and AREDC and report on findings and make recommendations\nAssist Management and Council in designing adequate systems of control where weaknesses are identified\nConduct quality control reviews of the work of the audit staff, and perform staff mentoring,  manage staff performance and on-the-job-training and development\nReview and assess the effectiveness of the Internal Audit function\nValidate the Performance Information Report before approval by Council.\n \nDesired Qualifications\nA Relevant Masters Degree (NQF Level 9)\nCertified Internal Auditor an added advantage\n3-5 years experience at the Executive/ Board level\n3-5 years experience in Senior Management\n10 years internal audit experience\nKnowledge of the International Standards for the Professional Practice of Internal Auditing and Governance Frameworks\nAudit techniques (Including CAATS)\nKnowledge and experience in QAR reviews\nKnowledge and experience in conducting governance and security reviews.\n \nKey Competencies and Attributes\nAnalytical thinking\nTeam leadership\nResults management\nPlanning and organising\nLeading and managing change\nDeveloping others\nResource management\nFostering learning.",
                "Interested?\n\nClosing Date: 23 October 2023\n \nThis is a re-advertisement, those who had previously applied need not re-submit an application as their initial applications will be considered.\n \nAPPLY NOW"
            ],
            "postedDate": "12/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/national-agricultural-marketing-council-namc_orig.jpg",
            "href": "https://www.govpage.co.za/national-agricultural-marketing-council-namc-vacancies-blog/national-agricultural-marketing-council-namc-vacancies5139922",
            "title": "NATIONAL AGRICULTURAL MARKETING COUNCIL (NAMC) VACANCIES",
            "content": [
                " \nNATIONAL AGRICULTURAL MARKETING COUNCIL (NAMC)\n \nMINISTERIAL REPRESENTATIVES (1) TO SERVE ON THE BOARD OF DECIDUOUS FRUIT INDUSTRY DEVELOPMENT TRUST\n \nThe National Agricultural Marketing Council’s division dealing with Agricultural Industry Trusts has a mandate to facilitate the communication process between the Agricultural Trusts and the Minister of the Department of Agriculture, Land Reform and Rural Development (DALRRD). Among other things, Agricultural Industry Trusts division is expected to facilitate the process of the appointment of Ministerial Trustees. This release is aimed at fulfilling that activity regarding the Deciduous Fruit Industry Development Trust.\n ",
                " \nOBJECTIVES OF THE DECIDUOUS FRUIT INDUSTRY DEVELOPMENT TRUST:\nThe objectives of the Deciduous Fruit Industry Development Trust are to benefit, either directly or indirectly, beneficiaries that have been previously disadvantaged. The objectives of the Trust contained in the Trust Deed are as follows;\n(a) Fund the development, upliftment and promotion of beneficiaries, with particular emphasis on the transformation, exposure and upliftment of previously disadvantaged individuals and communities, focusing on training, mentoring and providing information, amongst other things,\n(b) Provide assistance to beneficiaries with their entry into and participation in the industry, particularly of members from previously disadvantaged communities,\n(c) Identify and recruit suitable candidates from within the ranks of the beneficiaries for training and advancement in the deciduous fruit industry in South Africa, with particular emphasis on the transformation and upliftment of previously disadvantaged individuals and communities that qualify as beneficiaries,\n(d) Liaise with Provincial Members of the Executives (MECs), the National Minister of Agriculture, the Department of Agriculture, the NAMC and other interest groups in the deciduous fruit industry, with a view to collaborating on a development and training policy so as to promote training and development of the beneficiaries, and\n(e) Facilitate and fund market research and the generic promotion of the deciduous fruit industry to the benefit of the beneficiaries.\n \nQUALIFYING CRITERIA TO SERVE AS A MINISTERIAL TRUSTEE:\n(a) Be a South African citizen;\n(b) Understand and/or be able to analyse & interpret the financial statements and investments;\n(c) At least 5 years’ experience in agriculture, land reform and rural development;\n(d) Should have knowledge and understanding of transformation policies of the government;\n(e) Possess a desire to advocate and advance the needs of smallholder farmers in the deciduous fruit industry;\n\n(f) Not be an immediate family member nor be involved in a business venture with NAMC members;\n(g) Be influential and able to work effectively as a member of a team;\n(h) Willingness to accept Trustee duties and responsibilities; and\n(i) Understand agricultural Trusts, statutory levies and their objectives.\n \nRESPONSIBILITIES OF MINISTERIAL TRUSTEES:\n(a) Ministerial Trustees have a legal obligation to take shared responsibility for the Agricultural Industry Trusts in which they represent the Minister on, and must ensure that;\ni. The Trust pursues its objectives or purposes as set out in the Trust deed;\nii. The assets of the Trust are protected and used exclusively to pursue its purposes; and\niii. The Trust complies with the law and its governing documents.\n(b) The Ministerial Trustees should be available for the meetings and report to the NAMC regarding the key issues discussed and decisions taken during the meeting;\n(c) Report to the NAMC regarding activities of the Deciduous Fruit Development Trust on a continuous basis;\n(d) Ensure that Agricultural Industry Trusts’ and levy funds are utilised in a manner that is consistent with objectives of the Trusts deed and that transformation projects are undertaken in accordance with the transformation charters for Agriculture, Land Reform and Rural Development.\n \nKNOWLEDGE AND EXPERIENCE:\n(a) Research;\n(b) Agriculture and awareness of emerging farmer issues;\n(c) Serving the public interests;\n(d) Governance;\n(e) Diversity;\n(f) Financial management;\n(g) Political/ Local, Provincial and National government knowledge; and\n(h) Legal knowledge",
                "TERMS OF MINISTERIALTRUSTEES:\n The terms of the Ministerial Trustees differ from one Trust to another and are guided by the Trust Deed of each Trust. Ministerial Trustees may serve only two consecutive terms and the reappointment is subject to the performance and commitment of the Trustee in the first term. The Trustee who has served for two consecutive terms will normally not stand for reappointment. \n \nPlease forward your Curriculum Vitae (CV) to: Mr. Brian Makhele: BMakhele@namc.co.za  & Ms. Nomantande Yeki: PYeki@namc.co.za\n \nClosing date: 24 October 2023 \n \nIf you have not been contacted within three months of the closing date, please note that your application was unsuccessful."
            ],
            "postedDate": "12/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/national-credit-regulator-ncr_orig.jpg",
            "href": "https://www.govpage.co.za/national-credit-regulator-ncr-vacancies-blog/national-credit-regulator-ncr-vacancies8307159",
            "title": "NATIONAL CREDIT REGULATOR (NCR) VACANCIES",
            "content": [],
            "postedDate": "12/10/2023",
            "iframe": "https://drive.google.com/file/d/1PyiFaqYYTmLkUWKz-U-y4pDfBJKAgmch/preview"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sanac_orig.jpg",
            "href": "https://www.govpage.co.za/south-african-national-aids-council-sanac-vacancies-blog/south-african-national-aids-council-sanac-vacancies4124025",
            "title": "SOUTH AFRICAN NATIONAL AIDS COUNCIL (SANAC) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN NATIONAL AIDS COUNCIL (SANAC)\n ",
                " \nSANAC VOLUNTEER OPPORTUNITY\n \nThe South African National Aids Council (SANAC) leads South Africa’s response to the national HIV and AIDS, TB & STIs epidemics. SANAC is building a dynamic team that can facilitate its effective leadership of the national response.\n \n4X PEER EDUCATORS – ADOLESCENT AND YOUNG PEOPLE (VOLUNTEERS) RE-ADVERTISEMENT\nReporting to: Provincial Technical Officer (AYP)\nLocation: KwaZulu Natal (eThekwini, uMgungundlovu, and uThukela)\nDuration: 12 Months\n \nPurpose and Objectives of  Peer Educators: Adolescent and Young People (AYP)\nSANAC and the KwaZulu Natal Provincial AIDS Council seeks to appoint four Peer Educators AYP in eThekwini, uMgungundlovu, and uThukela to for HIV Prevention Programmes to enhance youth participation and representation in the multi-sectoral response in ensuring an AIDS-free generation by 2030.  Peer Educators: AYP are passionate individuals between the ages of 15 and 24, who want to play a key leadership role in ensuring an AIDS free generation by 2030. These Peer Educators : AYP will actively participate in the programs offered in their communities and are role models and willing to represent AYP HIV Prevention initiatives in respective Districts. Acting as a local catalyst and community leader for AYP HIV Prevention, the Peer Educator: AYP will mobilize and engage adolescent girls and young women and multi-sector stakeholders to act, provide evidence-based targeted messages, provide direction on where services are needed most and identify innovative and relevant ways to ensure  Peer Educator: AYP  through pivotal decisions.\n \nThe objectives of the Peer Educators: AYP are to:\nCreate awareness and activate peers to be actively involved in issues that affect them.\nDevelop communication strategies that are relevant and resonates with the youth.\nEnsure that current AYP programs implemented are reaching the correct people and are provided with fidelity.\nActively participate in the design, enhancement, and coordination of AYP targeted programmes.\nFacilitate peer-to-peer networks and create a knowledge management hub to share lessons across Districts.\n \nRoles and Responsibilities\nFurthermore, the Peer Educators will:\nServe as a youth representative on AYP HIV Prevention related matters at workshops, advisory committees, meetings and on task forces in the district\nRaise awareness and mobilize peers for youth prevention programs\nSpeak publicly, as, and when required, on HIV Prevention matters that affect the youth\nIdentify and collaborate with local stakeholders to support and actively participate in AYP HIV prevention programs\nSupport organizations to develop youth friendly policies and procedures to create more opportunities for all young people\nDevelop a knowledge sharing hub to document lessons that can be shared across Districts\nAdvocate for availability and accessibility of youth friendly services at local level.\nPrepare monthly and quarterly report done by ambassadors and share with District AIDS Coordinator and other relevant structures.\n \nEligibility Criteria\nPeer Educators – AYP must be a female between the ages of 18-24 years\nPeer Educators – AYP should be in good academic standard with no lower than a level-4 overall, and must agree to maintain that good standing throughout their term\nMust be familiar and have participated in AYP programs before\nPeer Educators – AYP must be prepared to meet all the obligations outlined in the ‘Roles and Responsibilities’\nAbility to communicate and engage at different levels\nAbility to empower other AYP in their communities\nReport writing and negotiation skills\n \nReporting\nThe Peer Educators – AYP will directly to the relevant District AIDS Council coordination structures for daily operations and supported by the Provincial AYP Technical Officer for technical and other administrative functions.",
                "Application Process\nTo apply kindly send your CV and a letter of motivation referencing programmes and initiatives you have participated and contributed to in your community.\n \nApplications should be emailed to hr@sanac.org.za \n \nKindly indicate the name of the position  and area of preference on the subject line of the email. Applicants who do not comply with the above-mentioned requirements, as well as applications received late or faxed will not be considered.\n \nClosing date: 12 October 2023, Close of Business at 16:30\n \nNote that correspondence will only be conducted with the short-listed candidates. If you have not been contacted within two (2) months of the closing date of the advertisement, please consider your application as unsuccessful.\n\n \nSANAC reserves the right at any time to withdraw or alter this advertised position."
            ],
            "postedDate": "12/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sanparks-logo_orig.png",
            "href": "https://www.govpage.co.za/south-african-national-parks-sanparks-vacancies-blog/south-african-national-parks-sanparks-vacancies7168920",
            "title": "SOUTH AFRICAN NATIONAL PARKS (SANPARKS) VACANCIES",
            "content": [
                " \nSOUTH AFRICAN NATIONAL PARKS (SANPARKS)\n ",
                " \nINDEPENDENT CONTRACTOR: COMMUNICATION PROFESSIONAL - SANPARKS VISION 2040\nPark: Groenkloof (Head Office)\n \nDescription:\nProject Overview:\nSANParks Vision 2040 is a collaborative, inclusive process that will re-imagine and co-create a new future for national protected areas with a rigorous effort to include the citizens of the country and the world in the co-creation of National Protected Areas of the future.\nThe development of SANParks Vision 2040 and the strategy to support it, through an inclusive process involving a wide range of stakeholders and building the organisation that can ensure the realisation of this vision, is at the heart of the phased project.\n \nJob Summary:\nAs the Communication Professional for the SANParks Vision 2040 Project, you will play a crucial role in managing and implementing both internal and external communication strategies. Your expertise will be instrumental in disseminating project updates, engaging stakeholders, and building a positive brand image for Vision 2040. This role presents an exciting opportunity to make a significant impact, contributing to the success of a transformative project with far-reaching benefits.\nThis is a part-time, freelance position of approximately 200 - 250 hours over approximately a six-month period.\n \nRequirements:\nBachelor's degree in Communication, Public Relations, Journalism, or a related field. Advanced degrees or certifications are a plus.\nProven experience (at least 5 years) in strategic communication roles, ideally in an environment related to or understanding of the conservation sector (also corporate or nonprofit environment).\nExcellent written and verbal communication skills, with a keen eye for detail and the ability to tailor messages for diverse audiences.\nStrong project management abilities, capable of handling multiple tasks and priorities simultaneously.\nDemonstrated experience in crafting content for various platforms, including digital and traditional media.\nProficiency in using communication tools, social media platforms, and graphic design software.\nFamiliarity with the biodiversity, environmental management and/or conservation sector will be advantageous.\nA proactive, creative, and solution-oriented mindset, with a passion for driving positive change through effective communication.\nWork very closely with the Communications as well as Marketing staff within SANParks in order to ensure cohesion and dissemination of messages throughout the organisation.\nAssist in identifying risks and mitigation actions\n \nResponsibilities:\nRefine existing Vision 2040 communication plans and execute a comprehensive communication plan for the Vision 2040 project, ensuring alignment with project goals and objectives.\nCreate content for a variety of channels, including press releases, website updates, social media, newsletters, and internal communications.\nCreate advertisements, newsletters and other products requiring graphic design inputs.\nOversee internal communication efforts to keep employees informed and engaged, fostering a sense of involvement and ownership in the Vision 2040 project.\nCollaborate with cross-functional teams to collect relevant project updates and milestones and effectively communicate progress to internal and external stakeholders.\nCultivate and maintain positive relationships with media outlets, industry influencers, and other relevant parties to secure favourable coverage and promote the project's achievements.\nManage potential crisis communications, addressing issues promptly while safeguarding the reputation of the Vision 2040 project and the organization.\nCoordinate and support communication-related events, conferences, and workshops related to Vision 2040.",
                "Interested persons who meet the above-stated qualifications should forward their applications which should consist of a cover letter, detailed Curriculum vitae, certified copies of qualification(s) and Identity Document (certified within the past 3 months) to the following address:\nHuman Resources Division\nSA National Parks\nPO Box 787\nPRETORIA\n0001\nEmail: Gugulethu.Khuzwayo@sanparks.org\n \nClosing Date: 24 October 2023\n \nSANParks is committed to the principles of employment equity. Preference will be given to PDI / HDSA."
            ],
            "postedDate": "12/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/coega_orig.jpeg",
            "href": "https://www.govpage.co.za/coega-development-corporation-cdc-vacancies-blog/coega-development-corporation-cdc-vacancies4709992",
            "title": "COEGA DEVELOPMENT CORPORATION (CDC) VACANCIES",
            "content": [
                " \nCOEGA DEVELOPMENT CORPORATION (CDC)\n ",
                " \n \nFUNCTIONAL ANALYST (HR / PAYROLL) \n- ICT, RESEARCH AND STRATEGY\n- GQEBERHA \n- PERMANENT \n- GRADE C3\n \nACCOUNTABILITY\nThe Oracle HR Functional Analyst is accountable to the Chief Knowledge and Digital Officer with regards to the following:\nProject Deliverables\nOperational Deliverables\nOracle Functional Configuration\nGeneral HR Issues\nAnd to the Project Manager for IT systems implementation with regards to the following:\nProject Related Deliverables\n \nMANDATE: N/A\n \nDESCRIPTION\nRESPONSIBILITIES AND OBLIGATIONS\nThe primary responsibility of this role is to ensure the efficiency of the Oracle ERP System that supports the requirements of the CDC Business and Corporate Objectives. This role requires understanding of business needs with regards to the User requirements from the System. The responsibilities can be stated as follows:\nBusiness process mapping;\nContinuous Improvement of the Oracle system;\nLiaise with business for user requirement definition;\nProject management of system enhancement implementation;\nEnsure user requirements are realised within the enhancement and/or implementation;\nEnsure periodic legislative changes/amendments to the system are correctly applied;\nBe the link between ICT and the rest of the business as regards to Oracle.\n \nCRITICAL SUCCESS FACTORS\nClear benefits realisation of systems deployed;\nAlignment of blueprints to the organisation;\nUser friendliness of the Oracle Fusion system;\nSupport for the Oracle Fusion Human Capital functions;\n \nJOB DIMENSIONS\nTo have a good understanding of Oracle Fusion ERP system;\nTo be able to work in a highly dynamic environment;\nUnderstanding of the system functionality at application level;\nAbility to produce technical and user documentation for the systems;\nAbility to engage with other technical team members for the system functions and environment;\nBe able to focus on maintenance and knowledge capital for the organisation;\nBe an Innovator;\nHave strong planning and control attributes;\nBeing involved in all planned projects to ensure that no latent risks are present;\nMaintain highest integrity in all spheres of work:\nFurthermore, you are to ensure that:\nYou are aware of and have access to the CDC’s SHEMS;\nYou are aware of your responsibilities and duties as laid out in the CDC’s SHEMS;\nYou are aware that you work in a safe and environmentally friendly manner;\nYou ensure that the company’s housekeeping standards are maintained throughout your area of responsibility;\nYou report any unsafe conditions or acts which you cannot rectify yourself to your SHE representative or to the Senior SHE Project Manager as soon as possible;\nYou report all SHE incidents which occur within your area of responsibility promptly and in the correct format;\nYou are totally familiar with your responsibilities in terms of the CDC’s emergency plan;\nYou communicate to the Senior SHE Project Manager any required changes to the SHEMS prior to implementing these changes;\nYou timeously complete and correctly record any corrective action which needs to be taken in order to rectify a SHE matter;\nYou give full co-operation to, and participate in (as required), the CDC’s internal and external SHEMS audits.\nYou have the authority to:\nImmediately stop any person(s) on CDC property from committing an unsafe or destructive act or omission;\nTake whatever immediate steps you deem necessary to prevent injury or environmental damage when confronted with an unsafe or destructive condition.\nAdditionally ensure that:\nDuring your period of employment and subsequent thereto, you shall keep confidential and shall not make use of, directly or indirectly, and shall not disclose any of the CDC’s trade secrets or confidential information or those of its subsidiary or associate companies or those of other persons who have made disclosures to the CDC under conditions of confidentiality, other than to persons authorised by the CDC or those employed by the CDC who are required to know such secrets or to have such information for the purpose of their employment with the CDC.\nYou shall not, without the written permission of the CEO, be directly or indirectly employed for gain in any business or pursuit other than that of the CDC.  Such permission will be granted only if the CEO is satisfied that the activity is not in conflict with the CDC’s interests, and that the Employee’s ability to fulfil his/her duties to the CEO satisfaction will not be impaired.\nIt is conditional that you and/or no immediate relative or member of my household be employed by an organisation in direct competition with the CDC, without the CDC’s written approval. The CDC reserves the right to enquire as to the place of employment of my spouse or any member of my household.\n You will abide by the CDC Code of Conduct and Ethics Policy which seeks to codify the expected ethical behaviour from me, to meet the ideal of good corporate governance.\n \nQUALIFICATIONS & EXPERIENCE\nDegree/Diploma in Information Technology, Human Resources Management or equivalent;\nWorking knowledge of Oracle for at least 7 years;\n3- 5 years’ experience in Oracle Functional Human Capital and Financial knowledge;\nGood interpersonal skills:\nGood verbal and written communication skills:\nGood end – user computer skills (MS: Word, PowerPoint, Excel):\nAnalytical skills:\nPassion for people and an effective team player:\nReport writing and presentation skills:\nA valid driver’s licence.\n \n \nCDC is an employment equity employer and placement will be in accordance with our Employment Equity Plan. \n \nThe appointment of candidates is subject to the verification of all their credentials (employment history, educational, financial, criminal and any other checks as may be necessary). Please note that only shortlisted candidates will be contacted, and if you have not heard from us within one month of submitting your application, please consider it unsuccessful.\n \nAll applications must be forwarded to recruitment@coega.co.za\n \nLOCATION: Gqeberha - Head Office\nEMPLOYMENT TYPE: PERMANENT\nGRADE: C3\n \n \n \n \n ",
                " \n \n \n \nTRAINING FACILITATOR: PLUMBING TRADE \n- CORPORATE SERVICES \n– HUMAN CAPITAL SOLUTIONS \n– SKILLS DEVELOPMENT CENTRE \n- GQEBERHA \n- 1 YEAR FIXED TERM CONTRACT \n- GRADE C3\n \nACCOUNTABILITY\nThe Facilitator is accountable to the Executive Manager: Corporate Services through the Head: Skills Training Centre of the Coega Development Corporation (CDC).\n \nMANDATE\nThe Facilitator is accountable to the Executive Manager: Corporate Services through the Head: Skills Training Centre of the Coega Development Corporation (CDC).\n \nDESCRIPTION\nRESPONSIBILITIES AND OBLIGATIONS\nThe primary objective of the Training Facilitator role is to deliver applicable learning programmes that includes: -\nSelection of candidates for training interventions;\nDevelopment of learning materials;\nFacilitation of training (instruction, assessment etc) on and offsite;\nProduction of training reports;\nProvision of input for certification;\nFacilitation of placement of learners with host employers (evaluation of the workplace for placement suitability, orientate workplace mentors etc);\nProvision of mentorship to learners and support to workplace (host employer) mentors;\nUpkeep of the training workspace (lecturer room and workshop);\nEnsuring adherence to training schedules;\nConducting sites (host employers) visits frequently and regularly for support and monitoring of quality of provision;\nMaintain learner discipline;\nOverseeing and observe health and safety during institutional and workplace;\nMaking input into training process, systems and processes;\nPlanning and procurement of training consumables/inputs;\nCompiling and maintain inventory of tool and training equipment ;\nCollection and timeous submission of attendance registers for processing of stipends;\nFurthermore, all facilitators have to ensure that:\nThey are aware that they work in a safe and environmentally friendly manner;\nThey ensure that the company’s housekeeping standards are maintained throughout their area of responsibility;\nThey report any unsafe conditions or acts which they cannot rectify themselves to their SHE representative or to the Senior SHE Project Manager as soon as possible;\nThey report all SHE incidents which occur within their area of responsibility promptly and in the correct format;\nThey are totally familiar with their responsibilities in terms of the SDC’s emergency plan;\nThey timeously complete and correctly record any corrective action which needs to be taken in order to rectify a SHE matter;\nThe Training Facilitator has the authority to:\nImmediately stop any person(s) on SDC’s property from committing an unsafe or destructive act or omission;\nTake whatever immediate steps he/she deem necessary to prevent injury or environmental damage when confronted with an unsafe or destructive condition.\n \nSPECIFIC RESPONSIBILITIES\nOverall facilitation of training programmes\nEnsuring that training interventions are aligned to the CDC’s socio-economic objectives and quality assurance bodies\nDecide on and implement best training strategies\nParticipate in SDC relevant meetings and forums\nOversee smooth running of training activities during institutional and workplace training\nEnsure high retention of learners   \nMonitoring\nTo monitor progress of all training programmes in terms of budget, implementation and quality outcomes.\nTo monitor learner attendance during both institutional and workplace training\nStakeholder involvement\nTo interact with different role-players, interested and affected parties, stakeholders and implementing agents impacted by or impacting on the training programmes.\nReporting\nTo prepare reports as required and directed by the Head of the Coega Skills Development Centre\n \nREQUIREMENTS AND COMPETENCIES\nAt least an NQF L4 or equivalent Certificate in mechanical engineering;\nPlumbing Trade Test;\nKnowledge of QMS (Training);\nKnowledge and understanding of the role of QCTO;\nKnowledge and understanding of the role of NAMB;\nKnowledge of the new Occupational Qualifications;\nKnowledge and understanding of learning alignment matrix on OC qualifications;\nKnowledge and understanding of assessment and moderation practices;\nKnowledge of training legislation in relation to DHET;\nMore than 5 years industry experience\nAt least 3 year experience in a similar role\nPlanning and organizing training activities;\nKnowledge of general administrative processes;\nGood interpersonal skills - the ability to communicate clearly and effectively;\nAbove average skills in writing;\nKnowledge of presenting information to different audiences\n \nPERFORMANCE INDICATORS\nPerformance is monitored regularly by reference to Key Performance Indicators and Balanced Scorecard.\n \nCDC is an employment equity employer and placement will be in accordance with our Employment Equity Plan. \n \nThe appointment of candidates is subject to the verification of all their credentials (employment history, educational, financial, criminal and any other checks as may be necessary). Please note that only shortlisted candidates will be contacted, and if you have not heard from us within one month of submitting your application, please consider it unsuccessful.\n \nAll applications must be forwarded to recruitment@coega.co.za\n \n \n \n ",
                " \n \n \n \n \nTRAINING FACILITATOR: ELECTRICAL TRADE \n- CORPORATE SERVICES \n– HUMAN CAPITAL SOLUTIONS \n– SKILLS DEVELOPMENT CENTRE \n- GQEBERHA \n- 1 YEAR FIXED TERM CONTRACT \n- GRADE C3\n \nACCOUNTABILITY\nThe Facilitator is accountable to the Executive Manager: Corporate Services through the Unit Head: Skills Training Centre of the Coega Development Corporation (CDC).\n \nMANDATE\nThe Facilitator is mandated by the Board of Directors of the CDC to take responsibility for the facilitation of training courses offered by the Skills Development Centre.   \n \nDESCRIPTION\nRESPONSIBILITIES AND OBLIGATIONS\nThe primary objective of the Electrical Trade Training Facilitator role is to deliver applicable learning programmes that includes: \nSelection of candidates for training interventions;\nDevelopment of learning materials;\nFacilitation of training (instruction, assessment etc) on and offsite;\nProduction of training reports;\nProvision of input for certification;\nFacilitation of placement of learners with host employers (evaluation of the workplace for placement suitability, orientate workplace mentors etc);\nProvision of mentorship to learners and support to workplace (host employer) mentors;\nUpkeep of the training workspace (lecturer room and workshop);\nEnsuring adherence to training schedules;\nConducting sites (host employers) visits frequently and regularly for support and monitoring of quality of provision;\nMaintain learner discipline;\nOverseeing and observe health and safety during institutional and workplace;\nMaking input into training process, systems and processes;\nPlanning and procurement of training consumables/inputs;\nCompiling and maintaining inventory of training tools and equipment;\nCollection and timeous submission of attendance registers for processing of stipends.\nFurthermore, all facilitators have to ensure that:\nThey are aware that they work in a safe and environmentally friendly manner;\nThey ensure that the company’s housekeeping standards are maintained throughout their area of responsibility;\nThey report any unsafe conditions or acts which they cannot rectify themselves to their SHE representative or to the Senior SHE Project Manager as soon as possible;\nThey report all SHE incidents which occur within their area of responsibility promptly and in the correct format;\nThey are totally familiar with their responsibilities in terms of the SDC’s emergency plan;\nThey timeously complete and correctly record any corrective action which needs to be taken in order to rectify a SHE matter;\nThe Training Facilitator has the authority to:\nImmediately stop any person(s) on CDC property from committing an unsafe or destructive act or omission;\nTake whatever immediate steps he/she deem necessary to prevent injury or environmental damage when confronted with an unsafe or destructive condition.\n \nSPECIFIC RESPONSIBILITIES\nOverall facilitation of training programmes\nEnsuring that training interventions are aligned to the CDC’s socio-economic objectives\nDecide on and implement best training strategies\nParticipate in SDC and CDC relevant meetings and forums\nOversee smooth running of training activities during institutional and workplace training\nEnsure high retention of learners   \nMonitoring\nTo monitor progress of all training programmes in terms of budget, implementation and quality outcomes.\nTo monitor learner attendance during both institutional and workplace training\nStakeholder involvement\nTo interact with different role-players, interested and affected parties, stakeholders and implementing agents impacted by or impacting on the training programmes.\nReporting\nTo prepare reports as required and directed by the Unit Head: Technical Skills Development Centre.\n \nREQUIREMENTS AND COMPETENCIES\nAt least an NQF L4 or equivalent Certificate in mechanical engineering related trade;\nTrade Test - Electrical;\nKnowledge of QMS (Training);\nKnowledge and understanding of the role of QCTO;\nKnowledge and understanding of the role of NAMB;\nKnowledge of the new Occupational Qualifications;\nKnowledge and understanding of learning alignment matrix on OC qualifications;\nKnowledge and understanding of assessment and moderation practices;\n Knowledge of training legislation in relation to DHET;\nMore than 5 years industry experience\nAt least 3 year experience in a similar role\nPlanning and organizing training activities;\nKnowledge of general administrative processes;\nGood interpersonal skills - the ability to communicate clearly and effectively;\nAbove average skills in writing;\nKnowledge of presenting information to different audiences\n \nPERFORMANCE INDICATORS\nPerformance is monitored regularly by reference to Key Performance Indicators and Balanced Scorecard.\n \n \nCDC is an employment equity employer and placement will be in accordance with our Employment Equity Plan. \n\n \nThe appointment of candidates is subject to the verification of all their credentials (employment history, educational, financial, criminal and any other checks as may be necessary). Please note that only shortlisted candidates will be contacted, and if you have not heard from us within one month of submitting your application, please consider it unsuccessful.\n \nAll applications must be forwarded to recruitment@coega.co.za  \n \n \n \n \n ",
                "RE-ADVERTISEMENT\n- REMUNERATION AND BENEFITS MANAGER \n- CORPORATE SERVICES \n– HUMAN RESOURCES \n- GQEBERHA \n- PERMANENT \n- GRADE D2\n \nACCOUNTABILITY\nThe Manager: Remuneration and Benefits is accountable to the Executive Manager: Corporate Services (EMCS) of the Coega Development Corporation (CDC) through the Unit Head: Human Resources of the CDC.\n \nMANDATE\nThe Manager: Remuneration and Benefits is mandated by the Executive Manager: Corporate Services to take responsibility for the development, implementation, and management of legally complaint remuneration and benefits practices, processes, procedures and systems.\n \nDESCRIPTION\nRESPONSIBILITIES AND OBLIGATIONS\n3.1 Remuneration Policy and Procedures\n· Develop the Remuneration policy and a total Reward strategy;\n· Manage the implementation of the approved Remuneration policy and procedures;\n· Develop, implement and manage legally complaint remuneration and benefits practices, processes and systems;\n· Builds capacity within HR and management team with regards to remuneration and benefits;\n· Ensure consistency in the application of remuneration and benefits policies, practices and systems throughout the organization;\n· Provide information and update both management and employees on company benefits, policies and procedures;\n· Timeous advising on corporate governance related changes and issues.\n3.2 Job Evaluation\n· Management implementation of Job Evaluation Policy and Procedures;\n· Facilitate and coordinate the job profiling and evaluation process across the organisation to ensure internal and external equity;\n· Communicate and educate employees regarding the organisation’s job evaluation system and practices;\n· Implement and manage job grading structure;\n· Update and maintain organizational structure and headcount reports.\n3.3 Payroll Management\n· Manage the payroll function and human resources administration as per the required standards;\n· Develop and manage effective payroll management procedures and systems;\n· Manage payroll processes, salary reviews and incentive schemes;\n· Accountable for integrity of data on HR information management system;\n· Continuous maintenance of HR information management system.\n3.4 Remuneration analysis and benchmarking\n· Undertake benchmarking exercises and assignments in remuneration and benefits practices, job evaluation and annual salary reviews;\n· Prepare and submit reports on remuneration and benefits benchmarking exercises, and other assignments as required;\n· Research and develop pay structures based on practices;\n· Provide an overall view of views of practices and develop a business case for change where deemed necessary;\n· Critically analyse remuneration and reward practices and provide comparison with organisations in the market;\n· Maintain effective and efficient relationships with external service providers to improve operating efficiencies.\n3.5 Salary Review Process\n· Manage salary review process under the leadership of the HR Manager;\n· Recommend salary review guidelines, coordination of the entire process including training, documentation, distribution and consolidation of review spreadsheet;\n· Prepare schedules for payroll upload and staff letters;\n· Prepare reports, statistics, graphs and cost analysis.\n3.6 Advice and Operational Support\nProvide expert and professional advice on all remuneration related issues;\nSupport in preparing submissions to the remunerations and HR committee;\nConduct ad hoc internal and external benchmarking exercises per position;\nCommunicate changes in legislative policies and facilitating changes applicable to company processes;\nAssist departments with reviewing of job profiles and evaluations thereof;\nManage remuneration projects for the organisation when required;\nPeriodically review and recommend improvements to employee benefits and schemes;\nProvide leave management mechanisms;\nTimeous submission of an Employment Equity report and all other legislative requirements;\nExecute and implement HR projects/ assignments when required;\nEffectively manage and support Wellness programmes.\n3.7 Management of HR Integrated Information Systems\n· Effectively implement HRIS to satisfy the needs of the organisation;\n· Create monthly, quarterly, annual and post activity reports;\n· Effectively manage and support staff.\n \nFurthermore, you are to ensure that:\n· You are aware of and have access to the CDC’s SHEMS;\n· You are aware of your responsibilities and duties as laid out in the CDC’s SHEMS;\n· You are aware that you work in a safe and environmentally friendly manner;\n· You ensure that the company’s housekeeping standards are maintained throughout your area of responsibility;\n· You report any unsafe conditions or acts which you cannot rectify yourself to your SHE representative or to the Senior SHE Project Manager as soon as possible;\n· You report all SHE incidents which occur within your area of responsibility promptly and in the correct format;\n· You are totally familiar with your responsibilities in terms of the CDC’s emergency plan;\n· You communicate to the Senior SHE Project Manager any required changes to the SHEMS prior to implementing these changes;\n· You timeously complete and correctly record any corrective action which needs to be taken in order to rectify a SHE matter;\n· You give full co-operation to, and participate in (as required), the CDC’s internal and external SHEMS audits.\nYou have the authority to:\nImmediately stop any person(s) on CDC property from committing an unsafe or destructive act or omission;\nTake whatever immediate steps you deem necessary to prevent injury or environmental damage when confronted with an unsafe or destructive condition.\nAdditionally ensure that:\nDuring your period of employment and subsequent thereto, you shall keep confidential and shall not make use of, directly or indirectly, and shall not disclose any of the CDC’s trade secrets or confidential information or those of its subsidiary or associate companies or those of other persons who have made disclosures to the CDC under conditions of confidentiality, other than to persons authorised by the CDC or those employed by the CDC who are required to know such secrets or to have such information for the purpose of their employment with the CDC.\nYou shall not, without the written permission of the CEO, be directly or indirectly employed for gain in any business or pursuit other than that of the CDC. Such permission will be granted only if the CEO is satisfied that the activity is not in conflict with the CDC’s interests, and that the Employee’s ability to fulfil his/her duties to the CEO satisfaction will not be impaired.\nIt is conditional that you and/or no immediate relative or member of my household be employed by an organisation in direct competition with the CDC, without the CDC’s written approval. The CDC reserves the right to enquire as to the place of employment of my spouse or any member of my household.\nYou will abide by the CDC Code of Conduct and Ethics Policy which seeks to codify the expected ethical behaviour from me, to meet the ideal of good corporate governance.\n \nCOMPETENCIES AND REQUIREMENTS\nDegree / National Diploma in HR Management/Finance / NQF Level 7 or equivalent;\nA post graduate qualification in HR or certification as a remuneration specialist is preferable;\nMinimum 5 years in the HR field: Remuneration and Benefits, and payroll management;\nCCM (international Certificate in Compensation), CGCP (Certified Global Compensation Professional ) advantageous;\nProfessional membership – South African Reward Association (SARA) or similar is advantageous;\nExtensive knowledge of Oracle system;\nHands on experience in remuneration function that includes benchmarking, pay design and salary survey;\nExposure to remuneration analysis and modelling;\nExperience in Job evaluation processes;\nKnowledge of applicable remuneration legislation;\nAnalytical skills;\nPassion for people and an effective team player;\nInterpersonal skills;\nReport writing, communication and presentation skills;\nA valid driver`s licence.\n \nPERFORMANCE INDICATORS\nPerformance is monitored regularly by the EM Corporate Services and HR Manager, by reference to Key Performance Indicators and Balanced Scorecard.\n \n \nCDC is an employment equity employer and placement will be in accordance with our Employment Equity Plan.\n \nThe appointment of candidates is subject to the verification of all their credentials (employment history, educational, financial, criminal and any other checks as may be necessary). Please note that only shortlisted candidates will be contacted, and if you have not heard from us within one month of submitting your application, please consider it unsuccessful.\n \nAll applications must be forwarded to recruitment@coega.co.za",
                "INTERNSHIPS: MARKETING & COMMUNICATIONS \n- GQEBERHA\nACCOUNTABILITY: N/A\nMANDATE: N/A\n \nDESCRIPTION\nJOB DESCRIPTION: GDS ADMINISTRATIVE INTERN\nEDUCATION: ND/DEGREE IN MARKETING MANAGEMENT\nDURATION: 18 MONTHS INTERNSHIP\nLOCATION: GQEBERHA\n \nREQUIREMENTS\nGrade 12\nND/Degree in Marketing Management\nPost-graduate qualification as a definite advantage\nComputer literacy\nMust not be older than 35 years age\nGqeberha permanent residence\n \nSKILLS AND KNOWLEDGE\nResponsible to effectively and efficiently assist the Manager to operate the Graphic Design Studio (GDS) office;\nDevelop and implement administrative processes and systems to ensure proper governance and continuous improvements;\nActively promote the services of the GDS to potential clients and respond to tenders throughout the financial year.\nPrepare and execute bi-annual brand audits of all CDC offices to ensure compliance and implement corrective measures;\nTo execute all filing of hard copies and electronic documents on ECM, as specified by the Design Studio Manager;\nActively develop and prepare marketing campaign concepts for the website and intranet including social media and the mobile app;\nAssist to develop monthly analytics reports for all online digital platforms including social media;\nLogging of design related jobs on the internal ticketing system;\nAnswering of the telephone courteously, taking messages, routing of telephone calls appropriately;\nEnsuring that the office / boardroom to be used for GDS meetings and stakeholder engagements is neat, presentable, and has the relevant equipment;\nCollecting visitors from reception and accompany them to meeting rooms;\nEnsuring that there is a constant supply of office consumables (e.g., stationery) and ensure documents are delivered on time to stakeholders;\nAttend to mail and correspondence and ensure effective Management;\nTimely processing of invoices on Oracle;\nAttend to travel bookings (for meetings and other activities);\nMaintain effective Diary management (i.e. arrange meetings, meeting registers, port form and make sure that there are no clashing activities);\nAttend meetings as and when required by the Design Studio Manager;\nProvide Secretariat services for team meetings and as and when required (i.e. to set up calendar meeting, provide minutes);\nUndertake other duties as required commensurate with the level of this post;\nAssist in planning and transporting of CDC branding material for events when required by the Marketing Department;\nHave some practical knowledge of design software; and\nDemonstrate knowledge and application of algorithms as well as use of Eigenvalues, Google analytics, Regression algorithms to analyze marketing campaigns, Bayesian algorithms to provide data insights, Principle component analysis, Data modeling and Predictive analytics, to name but a few.\n \n \nIf you meet the above requirements, please send the CV, academic record and ID copy to the internshiprecruitment@coega.co.za"
            ],
            "postedDate": "12/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/eastern-cape-parks-tourism-agency_orig.jpg",
            "href": "https://www.govpage.co.za/eastern-cape-parks-and-tourism-agency-ecpta-vacancies-blog/eastern-cape-parks-and-tourism-agency-ecpta-vacancies7510675",
            "title": "EASTERN CAPE PARKS AND TOURISM AGENCY (ECPTA) VACANCIES",
            "content": [
                " \nEASTERN CAPE PARKS AND TOURISM AGENCY (ECPTA)\n ",
                " \n \nRESERVE MANAGER\nCENTRE: TSOLWANA NATURE RESERVE\nLEVEL: C UPPER\n \nPurpose\nTo manage the biodiversity, heritage, protection, and infrastructure of the reserve through goal orientated management that is aligned with the conservation and tourism objectives of the protected area.\n \nRequirements\n3 (three) years tertiary qualification in Nature Conservation / Environmental Management\n5 (five) years’ experience in a junior management position.\nComputer literate with computer software and systems such as, GIS, Internet Software, and MS Office\nFire Arm Competency Certificate and EMI Level 2 is required\nA valid Driver’s Licence and Police Clearance\n \nKey Performance Areas\nFinancial Management: Provide input and manage in accordance of the Budget\nPeople Management: Ensure that performance of subordinate staff is managed, and reporting done\nInfrastructure / Asset Management: Ensure compliance with all Asset Management Policies of ECPTA\nBiodiversity and Heritage Management: Stay up to date with latest improvements and legislation and Manage Alien Species Programme.\nLaw Enforcement: Identify thresholds of potential concern and develop mitigation methods\nTourism Hospitality: Develop and implement a Tourism Development Plan\nStakeholder management: Develop liaison Forums to discuss management issues\nImplementation of Strategic Management plans: Review, update and implement the Strategic Management Plan\n \n ",
                "In line with the Employment Equity Policy of the Eastern Cape Parks & Tourism Agency, preference will be given to suitable candidates from the designated groups. (Where applicable).\n \nClosing Date: 20 October 2023\n \nPlease forward your application to:\nRecruitment1@ecpta.co.za, please specify the position you are applying for.\nPlease submit a comprehensive CV. Applications received after the closing date and/or those submitted to an address not listed above will not be considered.\nIf you do not receive a response within 30 days, please consider your application as unsuccessful.\n \nThe ECPTA reserves the right not to fill any advertised position."
            ],
            "postedDate": "12/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/ezemvelo-kzn-wildlife_orig.jpg",
            "href": "https://www.govpage.co.za/ezemvelo-kzn-wildlife-vacancies-blog/ezemvelo-kzn-wildlife-vacancies7335803",
            "title": "EZEMVELO KZN WILDLIFE VACANCIES",
            "content": [
                " \nEZEMVELO KZN WILDLIFE\n ",
                " \n \nASSET MANAGER (D2) \nFINANCIAL SERVICES-HEAD OFFICE \nPOST NUMBER: 610172 \nTOTAL REMUNERATION PACKAGE: R 779 749.73 p/a \n \nPURPOSE OF THE JOB: \nTo maintain and control the organizations fixed assets, and to coordinate the recording of capital work in progress, asset acquisitions, asset disposals, control and management of assets and recording thereby ensuring that accurate records are kept for fixed assets in compliance with the PFMA and GRAP. \n \nQUALIFICATIONS\n• B Com Degree in Accounting/Financial Management is essential \n• Honours Degree in Accounting/Financial Management is desired \n \nEXPERIENCE\n• 3-4 years in accounting/finance \n• 2 years’ experience in fixed asset administration \n• 2 years with an Enterprise Resourcing Planning system, SAP experience \n \nKEY PERFORMANCE AREAS \n• Use and maintain all organizational resources efficiently, effectively and economically \n• Ensure all asset purchases are captured at their correct values \n• Fixed Asset Disposal and Transfers \n• Station Visits \n• Coordinate the bi-annual physical verification of assets \n• Month/Year-end Procedures \n \nKEY COMPETENCIES REQUIRED \n• Financial accounting knowledge \n• Financial policies and procedures knowledge (Ezemvelo/PFMA/GRAP/Treasury Regulations) \n• BBBEE knowledge and ERP system preferably SAP \n• Reconciliation skills \n• Computer literacy \n• Communication and interpersonal skills \n• Administrative and Auditing skills \n• Decision making skills \n• Attention to detail \n• Management skills ",
                "DIRECTIONS TO APPLYING CANDIDATES: \nThe following mandatory documents must be submitted. \na) Please note that only a fully completed application form will be accepted, hence incomplete forms will not be considered. \nb) Certified copies of your qualifications and Identity Document (ID) are required. All submitted certified copied should not be older than three (3) months from date of submission. and should not be copies of certified copies. \n \nThe appointment to the post is subject to positive outcome obtained from all verifications in relation to the position advertised. \n \nApplicants are encouraged to apply for posts through the KZN online e-Recruitment system at www.kznonline.gov.za/kznjobs or submit their Ezemvelo application form directly to the following email address recruitments@kznwildlife.com.\n \nApplicants may also visit any KZN Department’s and Public Entity’s Designated Online Application Centres (DOACs) where staff will assist you with applying for jobs on the KZN online e-Recruitment system or receiving your hardcopy application. \n\n \nYou can find the list of Designated Online Application Centres (DOACS) at www.kznonline.gov.za/kznjobs.\n \nPlease note that applicants should only use one of the following methods when applying for a post: \n• either through the online e-Recruitment system, \n• emailing Ezemvelo application form directly to recruitments@kznwildlife.com  \n• submit a hardcopy application to one of the Designated Online Application Centres (DOACS) \n \nEZEMVELO DESIGNATED ONLINE APPLICATION CENTRES (DOACS): \n• INGWE ROOM EZEMVELO KZN Wildlife (Head Office); Queen Elizabeth Park; 1 Peter Brown Drive; Montrose, Pietermaritzburg 3201. \n• DURBAN OFFICE; 25 STELLAWOOD ROAD, UMBILO \n \nFor any queries relating to this job-application please contact the Recruitment Office on 033 845 1761 during office hours. \n \nClosing Date: 23 October 2023 \n \nApplications received after the closing date will not be considered. Applicants not contacted within 30 days of the advertisement closing date should consider their applications unsuccessful. \n \nSelection will be made in terms of the Organization’s Employment Equity Plan and Preference will be given to members of designated groups. Ezemvelo KZN Wildlife reserves the right not to make the appointment towards this post."
            ],
            "postedDate": "12/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/fort-cox_orig.png",
            "href": "https://www.govpage.co.za/fort-cox-agriculture-and-forestry-training-institute-vacancies-blog/fort-cox-agriculture-and-forestry-training-institute-vacancies2057469",
            "title": "FORT COX AGRICULTURE AND FORESTRY TRAINING INSTITUTE VACANCIES",
            "content": [],
            "postedDate": "12/10/2023",
            "iframe": "https://drive.google.com/file/d/1yvpsZl8Z_d_KeSknR1uPj2YrRcC8Zahy/preview"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/dut.png?1697164638",
            "href": "https://www.govpage.co.za/durban-university-of-technology-dut-vacancies-blog/durban-university-of-technology-dut-vacancies8670204",
            "title": "DURBAN UNIVERSITY OF TECHNOLOGY (DUT) VACANCIES",
            "content": [
                " \nDURBAN UNIVERSITY OF TECHNOLOGY (DUT)\n  \nDurban University of Technology (DUT) is located on the warm east coast of South Africa. It sprawls over seven (7) campuses in tropical and picturesque Durban, and in Pietermaritzburg, with its undulating hills that flow over from the Drakensberg Mountain. \n \nAccording to our ENVISION2030 strategy, DUT’s DNA has two strands, namely ‘people-centred and engaged’ and ‘innovative and entrepreneurial’. These are interwoven intrinsically by a number of double pairs consisting of ‘values and principles’ that bind our double-helix together. The extrinsic expression of our DNA is via The DUT-Way; which demonstrates our collective character and behaviour. \n \nThe University’s ultimate goal is to contribute towards improving the lives and livelihoods of all its people, both internal and external. DUT consistently strives towards excellence and greatness in teaching-learning and in research-innovation; something that has been recognized recently when The Times Higher Education’s World University Rankings placed DUT within the top 500 of universities in the world and within the top 5 universities in South Africa. The enactment of these internationally recognized strengths is demonstrated in our impactful engagement internally and externally in service of our localities, the region and the country at large. \n ",
                " \n \nREAL ESTATE MANAGEMENT \nPost – Space Coordinator \n(Ref: R264) \n \nMinimum Requirements: \n• Administrative/Technical Diploma or bachelor’s degree with an emphasis in property administration and information management or a related field. \n• 3 years’ experience working with database applications, running queries and spreadsheet applications. \n• Proficient knowledge of real estate industry, property management principles and relevant legislation. \n• Driver’s License \n \nKey Competencies: \n• Experience in property management and administration \n• maintaining a facilities and property database. \n• The ability to understand and manage database applications. \n• The ability to understand, interpret, and analyze data and effectively translate data to meet business process needs for end users. \n• The ability to read, understand, and interpret architectural floor plans of buildings. \n• Effective interpersonal, customer service and organizational skills. \n• The ability to manage multiple concurrent projects. \n• Effective verbal and written communication skills. \n• Experience working in higher education is preferred. \n \nDuties (but not limited to): \n• Coordinates with other stakeholders to resolve problems when necessary and helps to ensure the efficient use of university space by maintaining the flow of scheduling information between university systems. \n• Coordinates with ICT Services and the system vendor to resolve issues, test and implement regular updates, suggest improvements to the space management system, and serves as a liaison to Event and Meeting Services for administration of the space management system. \n• Develop and manage space data and conduct regular audits of university spaces and use. Arrange regular communications with stakeholders within real estate management. \n\n• Works with Planning, Design & Construction to support physical changes that are requested and provides data as requested to allow for a complete analytical review of requests to allow for proper management of both existing and new spaces. \n• Coordinate compliance audits and ensure that rentals and space use comply with policies and regulations. Identifies underutilized space, assesses underutilized annually to determine and address causes of underutilization, and recommends physical and technology enhancements to spaces to improve utilization. \n• Coordinates facilities’ resource planning and space management by analyzing administrative and academic space utilization and conducting an annual, system-wide, comprehensive facilities audit to ensure the accuracy of space data. \n• Communicate with internal and external stakeholders. \n• Provide monthly report on space utilization, space requests and consolidate information for budgetary use. \n• Support Real estate planning and real estate management with planning information, progress and feedback to various stakeholders. \n• Administration of space management meetings with various stakeholders and information flow. \n• Manages the system information and updates to ensure that the database is kept up to date.",
                "Salary: Market related \nContact Person: Miss ZJ Ngcobo \nStatus of Position: Permanent\n \n \nTo Apply: \nPreferably you may apply via Linkedin by sending a completed official application for employment form which can be found on DUT website. Please send form together with detailed CV, copies of ID, qualifications and a covering letter with the exact name and reference number of the post you are applying for OR you may email the above listed documents to HCSRecruitment@dut.ac.za.\nPlease note that you donot have to use more than one method of applying. \n \nKindly note: \nCommunication will be entered into with short-listed candidates only. Only applications made on our application for employment form would be considered. \n \nClosing date: 19th October 2023 @ 16:00pm\n \n“While DUT strives for equal opportunities, preference will be given to suitable candidates in terms of the University’s equity policy” The University reserves the right NOT to make an appointment."
            ],
            "postedDate": "12/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/sefako-makgathu-university_orig.png",
            "href": "https://www.govpage.co.za/sefako-makgatho-health-sciences-university-smu-vacancies-blog/sefako-makgatho-health-sciences-university-smu-vacancies6435638",
            "title": "SEFAKO MAKGATHO HEALTH SCIENCES UNIVERSITY (SMU) VACANCIES",
            "content": [
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                ""
            ],
            "postedDate": "12/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/published/tut-logo.jpg?1697164942",
            "href": "https://www.govpage.co.za/tshwane-university-of-technology-tut-vacancies-blog/tshwane-university-of-technology-tut-vacancies3688337",
            "title": "TSHWANE UNIVERSITY OF TECHNOLOGY (TUT) VACANCIES",
            "content": [
                " \nTSHWANE UNIVERSITY OF TECHNOLOGY (TUT)\n ",
                " \n \nGENERAL ASSISTANT\nTechnical Services\n01 November 2023 - 30 June 2024\nRef. 23/578\n \nThe Department of Technical Services has a Part time position for a General Assistant at eMalahleni Campus.\n \nMinimum Requirements:  \nA National Senior Certificate or equivalent (NQF Level 4) \nMust have a valid Drivers License\nRequired to work after hours.\n \nEXPERIENCE:\n1 Year working experience. \n         \nKey performance areas\nTo provide general assistance to the artisan.\nAssist the artisan in faults tracing and resolution.\nAssisting the artisan in identifying and rectifying repeat faults\nReasonable knowledge of relevant OHS act.\nRequired to do physical work.",
                "Send your CV to: SikoL@tut.ac.za\n \nEnquiries: Mr. M D Ngoma, Deputy Director \nTel: 012 382 4542\n \nClosing Date: 20 October 2023\n \n(Include copies of your academic transcript or certificates)\n \nINSTRUCTIONS: Applicants are required to submit together with the CVs, a standardized application form available from the university intranet as well as recently certified copies of qualifications and Identity Document. Failure to comply with this instruction will disqualify the candidate. Further note that candidates may be expected to make a presentation or undergo competency testing.\n\n \n If we have not responded within a Month from the closing date, you should regard your application as unsuccessful. Correspondence will only be entered into with short-listed candidates. The University reserves the right not to make an appointment.  Candidates will be required to undergo psychometric testing and other simulation interventions. Candidates are also required to complete the application form for employment. The application is available on the University’s website, share point and the University’s intranet."
            ],
            "postedDate": "12/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/university-of-limpopo_orig.jpg",
            "href": "https://www.govpage.co.za/university-of-limpopo-vacancies-blog/university-of-limpopo-vacancies2342213",
            "title": "UNIVERSITY OF LIMPOPO VACANCIES",
            "content": [
                " \nUNIVERSITY OF LIMPOPO\n ",
                " \n \nDEAN OF STUDENT AFFAIRS (Five Year Contract) \n \nPurpose:\nThe purpose of the job is to lead and manage student affairs in the university. \n \nRequirements:\nDoctoral qualification, ideally in humanities (social sciences/education/etc). \nA minimum of 10 years’ relevant experience, at least six of which have been in a senior management capacity. \nKnowledge of and experience in student funding and governance, etc. \nProven track record in facilitating constructive conflict resolution. \nKnowledge/understanding of student politics. \n \nCompetencies:\nStakeholder management. \nNegotiations.\nGood interpersonal skills. \nWritten and verbal communications skills. \nListening and problem-solving skills. \nDiplomacy.\n \nPerformance Area: \nStrategic planning for and oversight of operational management of student Affairs. \nEnsuring proper allocation of student residence. \nEnsuring good student governance. \nChampioning of student development and welfare. \nManagement of resources (staff, funds, etc.). \nStudent advocacy and management. \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nTyped applications which should contain comprehensive curriculum vitae, certified copies of all qualifications and contact details of three referees should be forwarded for the attention of Ms N.J Monyepao to the Chief Human Resources Officer, e-mail applications, to HR.Admin@ul.ac.za\nTelephonic enquiries regarding conditions of service: (015) 268 2399/2129 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference DEAN OF STUDENT AFFAIRS will be given to Male (Africans, Indians, and Coloureds) Female (Africans, Coloureds and Whites) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make an appointment.\n \n \n \n ",
                " \n \n \n \nDIRECTOR: STUDENT HEALTH AND WELLNESS CENTRE (FIVE YEAR CONTRACT) \n \nJob requirements and experience: \nA relevant master’s degree (Nursing). \nBe conversant with higher education environment. \nRegistration with the statutory body (SANC). \nFour (4) years’ experience in campus health. \nThree (3) years’ experience in managerial position. \nExperience in counselling, training and development. \nKnowledge and experience in Human Resources Management issues. \nKnowledge and experience in Financial Management. \nKnowledge and experience in Nursing Management. \nKnowledge and experience in adolescence and youth friendly services (AYFS). \nKnowledge and experience in Performance Management. \nAbility to deal with staff and students matters fairly and consistently. \nExperience in Project Management. \nGood interpersonal communication skills. \nComputer literacy (Microsoft office). \nExperience in the performing research, interpretation and use of data. \n \nJob description: \nThe incumbent should be able to: \nOrganize the Health Care Services. \nManage human resource and perform management functions. \nManage departmental Finances. \nEnsure Quality Assurance and work procedures. \nCollaborate and strengthen relationships with external partners to enhance the quality of the campus health services. \nEstablish strategic performance, planning and evaluation systems. \nConduct, review and enforce policies and procedures. \nImprove programmes and systems that coordinate student services. \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, Academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, e-mail applications to HR.Admin@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Ms N.J Monyepao (015) 268 2399/2129 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference: DIRECTOR: STUDENT HEALTH AND WELLNESS CENTRE will be given to Male (Africans. Indians and Coloureds) Female (Africans, Coloureds and Whites) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful.\n \nThe University reserve the right not to make appointment.\n \n \n \n ",
                " \n \n \n \n \nRESIDENCE ADMINISTRATORS POSITION: X2 \n \nRequirements:\nGrade 12 (Matric certificate) plus a minimum of three-year degree/diploma in the field of Public Administration and other related courses, Social Sciences and Education. \nAt least three (3) years of experience in Residence Administration/ Student Accommodation operations in High Education. \nProven knowledge and understanding of student life activities, development and recreation in residence administration/ student accommodation in institution of Higher Learning. \nSound working knowledge and experience in Ms Word, Excel, PowerPoint, Outlook, and Online platform. \nProven experience with students/young adults engagement will be an added advantage. \nGood interpersonal, communication, conflict resolution, and problem-solving skills. \nWillingness and ability to work flexible hours. \n \nDUTIES:\nAdministrative responsibilities \nCoordinate and manage online residence application, admission, and registration processes.\nCapture student’ data both electronically and manually. \nConduct routine physical checks in the residences and coordinate property inventory control processes. \nSubmit request for repairs, renovation, refurbishment, and fumigation of residences. \nContribute to the development and implementation of the Department Annual Performance plan. \nEnsure students adhere to the University residence rules and regulations and conduct disciplinary proceedings for non-compliance. \n \nStudent Welfare responsibilities: \nEnsure that proper standard of cleaning, and hygiene is maintained at all times. \nGive support to students with social, emotional, and personal problems and make the necessary referrals. (psychosocial support). \nEngage, collaborate, and participate in student support and developmental programmes. \nCoordinate and manage student satisfaction service delivery measures. \nEnsure compliance with Health and Safety standard. \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, Academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, e-mail applications to Recruitment1@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Ms DM Diale (015) 268 2800 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference: RESIDENCE ADMINISTRATORS will be given to Male (Africans. Indians and Coloureds) Female (Indians, Coloureds and Whites) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make appointment.\n \n \n \n \n ",
                " \n \n \n \n STUDENT AFFARS \nSPORT OFFICER\n \nJob Description: \nCreate, organize, administer, and supervise sport programmes. \nRecruitment of players and coaches. \nOrder equipment and uniforms and ensure training equipment is properly maintained and accounted for. \nSchedule games/practices as needed, etc. \nEvaluate available recreation/sport opportunities for students and conceive, and implement new programs and or classes to fill gaps. \nTeach recreational enrichment classes during after school as assigned by the programme Manager/ Director. \nManage the contract and register for coaches. \nPerform all necessary administrative responsibilities as assigned in the allocated operational areas. \nManage inventory of recreational and sports equipment, ensuring that the amount of equipment is sufficient for programme needs and that equipment is in good working condition. \nPlan, coordinate, schedule, promote, lead, and evaluate recreation programs and special events. \nAssist in the development and monitoring of Sports and Recreation activities. \nDesign and manage conditioning programmes for teams and create daily fitness activities. \nParticipate in the coordination and administration of gym activities. \nPerform other duties in the department as assigned. \nTravel with various sporting codes and ensure the standards set by the Department are kept at all times. \nThis job may require you to work over weekend and evenings. \nAbility to manage code budget/ funds. \nParticipate and organise in fundraising activities. \n \nRequirements and Qualifications: \nMinimum Bachelor’s degree in Physical Education/ Sport Science/ Kinesiology/Exercise Science/ Biokinetics or a related field. \nMinimum 2 years working in the field of sport in preferred. \nExperience in working with/assisting student athletes. \nAbility to prepare written reports. \nAbility to organize and priorities workload. \nAbility to effectively communicate verbally and in writing. \nAbility to work flexible hours, including evenings and weekends as needed. \nAbility to establish and maintain strong working relationships with participants and co-workers. \nKnowledge of planning, organising, promoting, and evaluating recreation programs. \nAbility to report to the line manager in professional manner. \n \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, Academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, e-mail applications in to Recruitment1@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Ms DM Diale (015) 268 2800 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference: SPORT OFFICER: will be given to Male (Africans. Indians and Coloureds) Female (Indians, Coloureds and Whites) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful.\n \nThe University reserve the right not to make appointment.\n \n \n \n \n ",
                " \n \n \n \nINFORMATION AND COMMUNICATION DEPARTMENT \nICT USER SUPPORT SERVICE \nDEPUTY DIRECTOR \n \nThe main purpose of this job is the management of the ICT Service Desk unit, which acts as a single point of contact between the University staff and service providers (internally and externally). The unit is responsible to manage all Operational Level Agreement (OLA) and Service Level Agreement (SLA) in line with the University policies and procedures. \nThe successful incumbent must have demonstrated skills and abilities in verbal and written communication, including presentations and report-writing, interpersonal skills (e.g. facilitation, team-work, networking and conflict resolution), training, research, project management, promote and empower others, coaching and delegation, analytical and strategically thinking, ability to work independently, flexibility and creativity and the ability to synthesise/integrate information. The incumbent will be expected to lead, manage, and direct the implementation of Information Technology Service Management (ITSM) within the University using the resources available.\n \nRequirements\nMinimum Qualifications: \nBachelor's degree in Bachelor's degree in Business/Information Technology, or equivalent experience – NQF Level 7 from a recognised and registered higher education institution \nITIL v4 Certification. \n \nRequired Experience: \nMinimum five (5) years managing a technical Service Desk team. \nMinimum four (4) years of experience managing IT projects. \nMinimum of two (2) to three (3) years of proven work experience in Change Management. \nExperience in managing multiple clients SLA’s. \nExperience in people and stakeholder management. \nExperience in managing and leading a diverse Service Desk team. \nDemonstrable experience of working in an IT Service Management (ITSM) capability. \nProven people management skills. \nProven ability to work independently and as a team member. \nAdvanced proficiency in MS Office suite. \nA valid driver’s license. \nGood organisational and interpersonal skills. \nAbility to work independently under intense pressure, meeting stringent deadlines. \nAbility to communicate and interact effectively with all stakeholders. \nAbility to maintain strict confidentiality. \nMeticulous attention to detail and commitment to high standard of work. \n \nAdvantages\nExperience in Project management \n \nDuties\nThe successful applicant will be required to render the following core functions: \nStrong interpersonal skills; ability to build strong relationships and collaboration across diverse and matrixed stakeholders and clients. \nAbility to lead and manage teams effectively through structured coaching and delivering by example. \nAbility to facilitate difficult discussions, prioritize competing interests, and manage both strategic and tactical interests. \nAbility to surface, prioritize and balance multiple stakeholder priorities. \nExperience with design thinking principles and client experience design. \nA high degree of empathy; an ability to align and relate to clients. \nAbility to juggle multiple priorities and make things happen in a fast-paced, dynamic environment. \nExcellent problem solving and analytical skills, including experience leveraging data to inform decision making and assist in solving engineering problems. \nExpertise in strategic thinking, forward-looking risk management and strong business acumen. \nDomain expertise in the applicable industry vertical business processes or industry applications (i.e. best practise, industry trends and customer services). \nStrong experience in researching and understanding both market and client needs. \nDemonstrated success in defining and building offerings. \nDemonstrated ability to communicate complex technical information in a condensed manner to various stakeholders verbally and in writing. \nStrong project management skills to manage multiple projects and deadlines simultaneously. \nFlexibility and demonstrated experience with change management practices and protocols. \nDemonstrated experience incubating and commercializing new ideas. \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, e-mail applications to Recruitment2@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Mr T.G Morokolo (015) 268 4794 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference DEPUTY DIRECTOR: ICT USER SUPPORT SERVICE will be given to Male (Africans, Indians and Coloureds) Female (Indians, Coloureds and Whites) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make appointment\n \n \n \n ",
                " \n \n \n \nINFORMATION AND COMMUNICATION TECHNOLOGY \nService Desk Consultant: User Support Services \n \nRequirements:\nMatric and a two (2) year Diploma in Information Technology or a National Certificate in IT with relevant extensive experience in desktop support environment. \nTwo (2) years’ experience in an IT environment supporting more than 300 users. \nKnowledge of customer service principles and practices. \nAbility to communicate effectively - verbally and in writing. \nWell-developed Interpersonal, organizational and planning skills. \nGood proficiency and navigation skills around a PC including the internet. \nGood telephone manners with a clear speaking voice. \nAn MCITP certificate will be a strong recommendation. \nITIL Foundation certification will be an added advantage. \nAbility to build rapport with the customer. \nAbility to work well in a team. \nA valid driver’s License. \n \nPrimary Responsibilities: \nPerforms basic problem solving and assistance on various software applications and hardware systems for department users and/or the university community. \nHandle customer inquiries both telephonically and by email. \nResearch required information using available resources, including the internet. \nManage and resolve customer complaints. \nProvide customers with product and service information. \nIdentify and escalate priority issues accordingly. \nFollow up customer incidents where necessary. \nDocument all Service Records information according to standard operating procedures. \nProvide Service Record reports when required. \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, e-mail applications to Recruitment2@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Mr T.G Morokolo (015)268-4794 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. SERVICE DESK CONSULTANT: USER SUPPORT SERVICES Preference will be given to Male (Africans, Indians, and Coloureds) Female (Indians, Coloureds and Whites) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful.\n \nThe University reserve the right not to make appointment.\n \n \n \n ",
                " \n \n \n \n \nFINANCE\nASSISTANT DIRECTOR: COST AND MANAGEMENT ACCOUNTING \nManagement of the activities involved in the budgeting, cost, and management accounting of the institution.\n \nRequirements:\nNQF Level 7 Accounting or finance related with cost and management accounting as a major subject. \nMinimum five (5) years’ experience in a cost and management accounting environment. \nMinimum three (3) years’ solid experience in a supervisory role. \nMust be competent in ITS reporting modules. \nKnowledge of Jasper will be an added advantage. \nExperience in higher education will be an added advantage. \nRegistration with relevant professional body will be an added advantage. \n \nKey performance areas: \n1. Preparation of monthly, quarterly and annual financial reports 2. Implementation of budgeting processes and forecasting methods \n3. Formulation of budget policies and procedure manuals \n4. Implementation of pricing decision techniques and costing methods for goods and services. \n5. Take ownership for learning and growth within the section. \n \nCompetencies and skills: \nSolid technical proficiency in budgeting and reporting principles. \nSolid proficiency for Analysis and Innovation. \nSound knowledge of cost and management accounting principles, processes, and procedures. \nAdvanced knowledge of Microsoft programs most importantly Excel and PowerPoint. \nResults oriented and quality focus. \nTime management and ability to work under pressure. \nAn analytical mind with strong attention to detail. \nOutstanding organizational and problem-solving skills. \nGood interpersonal and communication skills (both verbal and written) \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, Academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, e-mail applications to Recruitment2@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Mr T.G Morokolo (015) 268 4794 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference: ASSISTANT DIRECTOR: COST AND MANAGEMENT ACCOUNTING will be given to Male (Africans, Indians and Coloureds) Female (African and Coloured) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n\n \nThe University reserve the right not to make appointment.\n \n \n \n ",
                " \n \n \n \nFACULTY OF HEALTH SCIENCES \nOPTOMETRY\nLECTURER/SENIOR LECTURER/ASSOCIATE PROFESSOR \nThe University of Limpopo’s Optometry Department has opportunities for optometrists who have interest in academia and are amenable to discharging their clinical acumen to a host of undergraduate students within the department through horning their clinical and research skills in various settings on full-time basis. In view of the importance and specific requirements required for these opportunities, the Department would like to invite applications from suitably qualified and experienced candidates for appointment to the above-mentioned position with interest in binocular vision, contact lenses, paediatrics, low vision and diagnostic and management of ocular disease. Prospective candidates should meet the criteria as outlined hereunder: \n \nLecturer\nRequirements\nA Master’s degree in optometry. \nRegistration with the HPCSA with diagnostic and/or therapeutic privileges. \nExperience in teaching and clinical supervision of undergraduate students. \nAn interest in academia/research, proof of registration for a PhD degree will be an added advantage. \nA minimum three (3) years teaching experience at an institution of higher education. \nDeadline driven, ability to multi-task, organise, plan and work under pressure. \nCommunication and problem-solving skills. \n \nRequirements:\nSenior Lecturer \nA PhD degree in optometry. \nRegistration with the HPCSA with diagnostic and/or therapeutic privileges. \nExperience in teaching and clinical supervision of undergraduate students. \nA minimum 3-5 years teaching experience at an institution of higher education. • A record of publications in SAPSE accredited journals. \nDeadline driven, ability to multi-task, organise, plan and work under pressure. \nCommunication and problem-solving skills. \n \nDuties and responsibilities \nTeaching and clinical supervision of undergraduate optometry students. \nDevelopment of study materials and learner guides for optometry students. \nSupervision of undergraduate and post-graduate optometry research projects. \nEngage in own research, publish and present results at national and international conferences. \nPerform all administrative duties related to clinical teaching, learning and community engagement, as delegated by Head of Department \n \nRequirements:\nAssociate Professor \nA PhD degree in optometry/ relevant field. \nRegistration with the HPCSA with diagnostic and/or therapeutic privileges. • A proven record of excellence in teaching; demonstrated potential in establishing a successful research program; Publications in SAPSE. accredited journals; supervision of postgraduate and undergraduate students. \nA minimum 5-10 years teaching experience at an institution of higher education. \nDeadline driven, ability to multi-task, organise, plan and work under pressure. \nCommunication and problem-solving skills. \n \nDuties and responsibilities: \nTeaching and clinical supervision of undergraduate optometry students. \nSupervision of undergraduate and post-graduate optometry research projects. \nEngage in own research, grant applications, publishing, editorial activities and present results at national and international conferences. \n \n \nAll interested applicants may send their respective Curriculum Vitae (with certified copies of academic qualifications, identity document and other important documents including proof of current registration with the HPCSA, CPD activities, etc) to Ms Molobane Iwu at Molobane.iwu@ul.ac.za. Shortlisted candidates will be contacted within 30 days of submitting their applications. Therefore, should you not be contacted within this period, consider your application unsuccessful. \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, e-mail applications in to molobane.iwu@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Ms M.E Iwu (015)268-4795 \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference for (LECTURER) will be given to Male (Africans, Indians, and Coloureds) Female (Indians, Coloureds and Whites) and for SENIOR LECTURER/ ASSOCIATE will be given to Male (Africans, Indians and coloured) Female (Africans and coloured) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make appointment.\n \n \n \n \n ",
                " \n \n \n \n \nSCHOOL OF HEALTH CARE SCIENCES \nDEPARTMENT OF OPTOMETRY \nSENIOR LABORATORY TECHNICIAN\n \nThe University of Limpopo’s Department of Optometry has an opportunity for a Dispensing Optician who will operate within the laboratory space offering undergraduate tutelage on aspects of optical dispensing including but not limited to lens material, cutting and fitting of lenses, and frame selection. Applications are being sought from suitably qualified individuals as per specifications below: \n \nMinimum requirements \nNational Diploma in Optical Dispensing. \nRegistration with the Health Professions Council of South Africa as a Dispensing Optician. \nExperience in lens cutting and fitting, knowledge of ophthalmic lenses and frame maintenance. \nExperience in sales, patient management and administrative duties (invoicing, appointment bookings, etc.). \nExperience in teaching optical dispensing and ophthalmic optics will be an added advantage. \n \nDuties and responsibilities \nTeach and coordinate dispensing practicals. \nSupervision of optometry students for General Clinic Practice and Optical Dispensing sessions. \nAdvising patients on spectacle and frame selection. \nLiaising with relevant suppliers/stakeholders. \nControl of dispensed spectacles and management of stock. \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, e-mail applications to molobane.iwu@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Ms M.E Iwu (015)268-4795 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. SENIOR LABORATORY TECHNICIAN Preference will be given to Male (Africans, Indians, and Coloureds) Female (Indians, Coloureds and Whites) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make appointment.\n \n \n \n \n ",
                " \n \n \n \nDEPARTMENT OF PUBLIC HEALTH \nPROFESSOR IN PUBLIC HEALTH (Health Systems, Epidemiology or Environmental and Occupational Health) \n \nThe Department of Public Health at University of Limpopo is seeking a highly qualified Public Health Specialists who will lead the Health Systems, Epidemiology, Environmental and Occupational Health. The incumbents will provide strategic leadership, academic management, and operational direction to these programmes. The appointee will be tasked to ensure the academic integrity, and financial viability of the Masters and Postgraduate curricula and qualifications. Additionally, and amongst other key functions, he/she will be responsible for coaching, mentoring, and developing the capacity of students in the Department of Public Health and also assist in independent research. \n \nMINIMUM REQUIREMENTS: \nPossession of a doctoral degree (PhD) in Public Health or Equivalent. \nAt least 10 years’ teaching experience at a tertiary institution in either the field of Health Systems, Epidemiology, Environmental and Occupational Health. \nRelevant academic management experience coupled with a proven track record in teaching, research and community engagement. \nHigh academic and professional standing in the field of expertise, and high academic credibility amongst peers. \nQuantitative and qualitative research methods including statistical analysis. \nEvidence of recent conference papers (must include both local and international conferences), peer reviewed publications (a minimum of 10 published articles for Associate Professor and 15 published articles for Professor) \nEvidence of postgraduate supervision \nStrategic planning and implementation experience. \nHas the ability to mobilize and inspire others towards shared goals. \nKnowledge of and implementation of quality assurance. \nAdvanced computer skills (MS Office suite). \nTeaching, Supervision and Mentoring of postgraduate students. \nPublication of research articles in accredited journals. \nSupervision of students work and co-publication with students. \nParticipation in community engagement projects. \n \nGENERIC REQUIREMENTS \nAdvanced theoretical knowledge and insights into the field of Public Health. \nCompetence in communicating knowledge and facilitating teaching and learning in a lecture, seminar, tutorial and/or in assessment practices. \nThe ability to engage in curriculum design and development; and a demonstrated ability to conduct high-quality research. \nA thorough understanding of fundamental research methodology and competence in facilitating research tutorials/seminars and practical sessions; and/or undertaking research projects, production of research reports. \nA substantial number of conference papers, peer-reviewed publications or other acceptable research outputs. \nPeer-recognition as a specialist in the field of Public Health and potential to make a substantial contribution to the discipline or field. \nAbility to supervise research at postgraduate level and to develop research capacity. \nAn involvement in the wider academic community (e.g. editorships, review requests, participation in professional bodies). \nCapacity and willingness to undertake administrative responsibilities at departmental or institutional levels and to assume leadership positions, either in administration or in academic or professional activity. \nPromotion of and/or active participation in community engagement projects and/or leadership in establishing such projects. \nSound interpersonal skills, including a commitment to collegiality and equal opportunity. \nCompetence as an Associate Professor, demonstrating that the applicant has been recognised by the academic community for producing sound scholarship in either the teaching or research categories, but preferably in both. \nAbility to teach effectively at different academic levels, commensurate with the nature of the post to which the applicant was previously appointed. \nAn interest in and engagement with the theory of teaching and learning, the promotion of/active participation in teaching development programmes and the capacity to play a role in curriculum design and development; management of academic programmes; recognition for advanced teaching practice and/or evidence of mentoring. \nOngoing research activity and dissemination of research findings, including a reasonable record of publications in accredited and/or internationally-recognised research journals, commensurate with the applicant’s discipline and the nature of the post to which the applicant was previously appointed. \nA substantial record of high quality scholarship and research relative to others in the same field, evidenced by a record of high quality publications in appropriate academic journals. \nCapacity to initiate, manage and supervise research, including research at doctoral and postdoctoral level, to attract research students and/or research projects and funding, and to develop research capacity. \nProfessional and academic standing in the field of Public Health. \nThe ability and willingness to encourage the intellectual and career aspirations of staff and students. \nWhere appropriate, advanced research skills or capacity in the relevant discipline or field and participation in development programmes. Must have demonstrated strong research and academic leadership (e.g., by serving on university committees, professional and academic associations, acting as head of division or discipline), with competencies to serve as head of research division. \nService to the University either at departmental or institutional level. \nAbility to take on administrative responsibilities at departmental level. \nAcademic and/or professional participation at national and/or international level. \nCommunity engagement activity. \nA track record of service to the academic and wider community, either by contributing to teaching and learning or as a research leader in a particular discipline or field, nationally and internationally. \n \nOTHER REQUIREMENTS: \nSkills:\nTeaching skills at university level, especially teaching large classes. \nAn ability to design curricula in Health Systems, Epidemiology, Environmental and Occupational Health. \nCapability to stimulate and teach research and participation in departmental academic discussions. \nAbility to inspire a passion for pursuit of philosophy in students. \nOrganising and Planning Skills. \nComputer literacy. \nSound administration skills. \n \nKnowledge & Experience: \nKnowledge of Higher Education environment, HEQC, SAQA standards, programme accreditation and articulation requirements and processes. \n \nBehaviours:\nProfessionalism\nPlanning and organisation \nAttention to detail. \nPersonal learning and development \nEffective communication \nCollaboration / teamwork \nResults orientation \nAccountability\nCustomer or Service Focus \nInclusivity / diversity \nIntegrity\nReliability / dependability \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nTyped applications which should contain comprehensive curriculum vitae, certified copies of all qualifications and contact details of three referees should be forwarded for the attention of Ms P.M Raboshakga to the Chief Human Resources Officer, e-mail applications to maria.raboshakga@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: (015) 268 2794 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference PROFESSOR: HEALTH SYSTEMS, EPIDEMIOLOGY OR OCCUPATIONAL HEALTH will be given to Male (Africans, Indians, and Coloureds) Female (Africans, Coloureds and Africans) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make an appointment.\n \n \n \n \n ",
                " \n \n \n \n DEPARTMENT OF PUBLIC HEALTH \nPROFESSOR IN PUBLIC HEALTH (Health Promotion and Behavioural Studies) \n \nThe Department of Public Health at University of Limpopo is seeking a highly qualified Public Health Specialists who will lead the Health Promotion and Behavioural Studies. The incumbents will provide strategic leadership, academic management, and operational direction to these programmes. The appointee will be tasked to ensure the academic integrity, and financial viability of the Masters and Postgraduate curricula and qualifications. Additionally, and amongst other key functions, he/she will be responsible for coaching, mentoring, and developing the capacity of students in the Department of Public Health and also assist in independent research. \n \nMINIMUM REQUIREMENTS: \nPossession of a doctoral degree (PhD) in Public Health or Equivalent. \nAt least 10 years’ teaching experience at a tertiary institution in either the field of Health Promotion, Behavioural Studies and Health Systems. \nRelevant academic management experience coupled with a proven track record in teaching, research and community engagement. \nHigh academic and professional standing in the field of expertise, and high academic credibility amongst peers. \nQuantitative and qualitative research methods including statistical analysis. \nEvidence of recent conference papers (must include both local and international conferences), peer reviewed publications (a minimum of 10 published articles for Associate Professor and 15 published articles for Professor). \nEvidence of postgraduate supervision \nStrategic planning and implementation experience. \nHas the ability to mobilize and inspire others towards shared goals. \nKnowledge of and implementation of quality assurance. \nAdvanced computer skills (MS Office Suite). \nTeaching, Supervision and Mentoring of postgraduate students. \nPublication of research articles in accredited journals. \nSupervision of students work and co-publication with students. \nParticipation in community engagement projects. \n \nGENERIC REQUIREMENTS: \nAdvanced theoretical knowledge and insights into the field of Public Health. \nCompetence in communicating knowledge and facilitating teaching and learning in a lecture, seminar, tutorial and/or in assessment practices. \nThe ability to engage in curriculum design and development; and a demonstrated ability to conduct high-quality research. \nA thorough understanding of fundamental research methodology and competence in facilitating research tutorials/seminars and practical sessions; and/or undertaking research projects, production of research reports. \nA substantial number of conference papers, peer-reviewed publications or other acceptable research outputs. \nPeer-recognition as a specialist in the field of Public Health and potential to make a substantial contribution to the discipline or field. \nAbility to supervise research at postgraduate level and to develop research capacity. \nAn involvement in the wider academic community (e.g. editorships, review requests, participation in professional bodies). \nCapacity and willingness to undertake administrative responsibilities at departmental or institutional levels and to assume leadership positions, either in administration or in academic or professional activity. \nPromotion of and/or active participation in community engagement projects and/or leadership in establishing such projects. \nSound interpersonal skills, including a commitment to collegiality and equal opportunity. \nCompetence as an Associate Professor, demonstrating that the applicant has been recognised by the academic community for producing sound scholarship in either the teaching or research categories, but preferably in both. \nAbility to teach effectively at different academic levels, commensurate with the nature of the post to which the applicant was previously appointed. \nAn interest in and engagement with the theory of teaching and learning, the promotion of/active participation in teaching development programmes and the capacity to play a role in curriculum design and development; management of academic programmes; recognition for advanced teaching practice and/or evidence of mentoring. \nOngoing research activity and dissemination of research findings, including a reasonable record of publications in accredited and/or internationally recognised research journals, commensurate with the applicant’s discipline and the nature of the post to which the applicant was previously appointed. \nA substantial record of high quality scholarship and research relative to others in the same field, evidenced by a record of high quality publications in appropriate academic journals. \nCapacity to initiate, manage and supervise research, including research at doctoral and postdoctoral level, to attract research students and/or research projects and funding, and to develop research capacity. \nProfessional and academic standing in the field of Public Health. \nThe ability and willingness to encourage the intellectual and career aspirations of staff and students. \nWhere appropriate, advanced research skills or capacity in the relevant discipline or field and participation in development programmes. Must have demonstrated strong research and academic leadership (e.g., by serving on university committees, professional and academic associations, acting as head of division or discipline), with competencies to serve as head of research division. \nService to the University either at departmental or institutional level. \nAbility to take on administrative responsibilities at departmental level. \nAcademic and/or professional participation at national and/or international level. \nCommunity engagement activity. \nA track record of service to the academic and wider community, either by contributing to teaching and learning or as a research leader in a particular discipline or field, nationally and internationally. \n \nOTHER REQUIREMENTS \nSkills:\nTeaching skills at university level, especially teaching large classes. \nAn ability to design curricula in Health Promotion, Behavioural Studies and Health Systems. \nCapability to stimulate and teach research and participation in departmental academic discussions. \nAbility to inspire a passion for pursuit of philosophy in students. \nOrganising and Planning Skills. \nComputer literacy. \nSound administration skills. \n \nKnowledge & Experience: \nKnowledge of Higher Education environment, HEQC, SAQA standards, programme accreditation and articulation requirements and processes. \n \nBehaviours:\nProfessionalism\nPlanning and organisation \nAttention to detail. \nPersonal learning and development \nEffective communication \nCollaboration / teamwork \nResults orientation \nAccountability\nCustomer or Service Focus \nInclusivity / diversity \nIntegrity\nReliability / dependability \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, Academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, e-mail applications to maria.raboshakga@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Ms P.M Raboshakga (015) 268 2794 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference: PROFESSOR: HEALTH PROMOTION AND BEHAVIOURAL STUDIES will be given to Male (Africans. Indians and Coloureds) Female (Africans, Coloureds and Whites) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make appointment.\n \n \n \n \n ",
                " \n \n \n \n DEPARTMENT OF PUBLIC HEALTH \nSENIOR LECTURER – BIOSTATISTICS \n \nThe Department of Public Health at University of Limpopo is seeking a highly qualified Biostatistician. The incumbent will provide strategic leadership, academic management, and operational direction to these programmes. The appointee will be tasked to ensure the academic integrity, and financial viability of the Masters and Post Grad curricula and qualifications. Additionally, and amongst other key functions, he/she will be responsible for coaching, mentoring, and developing the capacity of students in the Department of Public Health and also assist in independent research. \n \nMINIMUM REQUIREMENTS: \nPossession of a doctoral degree (PhD) in Biostatistics or Statistics and Operational Research. \nAt least 5 years’ teaching experience at a tertiary institution. \nSound to Advanced (depending on the level), theoretical knowledge of any of the following fields: Biostatistics, \nResearch in Biostatistics and Public Health, \nPhilosophical and Ethical Foundations of Public Health \nQuantitative research methods and statistical analysis \nProbabilistic and statistical concepts \nMethods to describe and draw inferences from biomedical data. \nApply appropriate statistical methods to analyse data of different types and structures. \nPrepare report of methods, results, and interpretations from a simulation that investigates the properties of a statistical method. \nPerform power analysis and sample size calculations to determine the required number of subjects to carry out scientific studies. \nUse statistical software for data management, implementation of comprehensive statistical analysis, and presentation of results. \nWrite report of comprehensive and novel statistical analysis of public health data. \nTeaching, Supervision and Mentoring of postgraduate students. \nPublication of research articles in accredited journals. \nSupervision of students work and co-publication with students. \nParticipation in community engagement projects. \n \nGENERIC REQUIREMENTS: \nAdvanced theoretical knowledge and insights into the field of Biostatistics. \nCompetence in communicating knowledge and facilitating teaching and learning in a lecture, seminar, tutorial and/or in assessment practices. \nThe ability to engage in curriculum design and development; and a demonstrated ability to conduct high-quality research. \nA thorough understanding of fundamental research methodology and competence in facilitating research tutorials/seminars and practical sessions; and/or undertaking research projects, production of research reports. \nA substantial number of conference papers, peer-reviewed publications or other acceptable research outputs. \nPeer-recognition as a specialist in the field of Biostatistics and potential to make a substantial contribution to the discipline or field. \nAbility to supervise research at postgraduate level and to develop research capacity. \nAn involvement in the wider academic community (e.g. editorships, review requests, participation in professional bodies). \nCapacity and willingness to undertake administrative responsibilities at departmental or institutional levels and to assume leadership positions, either in administration or in academic or professional activity. \nPromotion of and/or active participation in community engagement projects and/or leadership in establishing such projects. \nSound interpersonal skills, including a commitment to collegiality and equal opportunity. Competence as an Associate Professor, demonstrating that the applicant has been recognised by the academic community for producing sound scholarship in either the teaching or research categories, but preferably in both. \nAbility to teach effectively at different academic levels, commensurate with the nature of the post to which the applicant was previously appointed. \nAn interest in and engagement with the theory of teaching and learning, the promotion of/active participation in teaching development programmes and the capacity to play a role in curriculum design and development; management of academic programmes; recognition for advanced teaching practice and/or evidence of mentoring. \nOngoing research activity and dissemination of research findings, including a reasonable record of publications in accredited and/or internationally-recognised research journals, commensurate with the applicant’s discipline and the nature of the post to which the applicant was previously appointed. \nA substantial record of high quality scholarship and research relative to others in the same field, evidenced by a record of high quality publications in appropriate academic journals. \nCapacity to initiate, manage and supervise research, including research at doctoral and postdoctoral level, to attract research students and/or research projects and funding, and to develop research capacity. \nProfessional and academic standing in the field of Biostatistics. \nThe ability and willingness to encourage the intellectual and career aspirations of staff and students. \nWhere appropriate, advanced research skills or capacity in the relevant discipline or field and participation in development programmes. Must have demonstrated strong research and academic leadership (e.g., by serving on university committees, professional and academic associations, acting as head of division or discipline), with competencies to serve as head of research division. \nService to the University either at departmental or institutional level. \nAbility to take on administrative responsibilities at departmental level. \nAcademic and/or professional participation at national and/or international level. \nA track record of service to the academic and wider community, either by contributing to teaching and learning or as a research leader in a particular discipline or field, nationally and internationally. \nA qualification in, or proof of studying towards, the assessment of learning at NQF Level 7/8, or an equivalent teaching qualification. \nA qualification in or proof of studying towards, postgraduate supervision at NQF Level 7/8, or an equivalent postgraduate supervision qualification. \n \nPREFERENCE:\nAn NRF rating would be an added advantage. \nInterest in Cultural Heritage \n \nOTHER REQUIREMENTS: \nSkills:\nTeaching skills at university level, especially teaching large classes. \nAn ability to design curricula in Philosophy. \nCapability to stimulate and teach research and participation in departmental academic discussions. \nAbility to inspire a passion for pursuit of philosophy in students. \nOrganising and Planning Skills. \nComputer literacy. \nSound administration skills. \n \nKnowledge & Experience: \nKnowledge of Higher Education environment, HEQC, SAQA standards, programme accreditation and articulation requirements and processes. \n \nBehaviours:\nProfessionalism\nPlanning and organisation \nAttention to detail. \nPersonal learning and development \nEffective communication \nCollaboration / teamwork \nResults orientation \nAccountability\nCustomer or Service Focus \nInclusivity / diversity \nIntegrity\nReliability / dependability \n \n \nCLOSING DATE: 27 OCTOBER 2023\n \nTyped applications which should contain comprehensive curriculum vitae, certified copies of all qualifications and contact details of three referees should be forwarded for the attention of Ms P.M Raboshakga to the Chief Human Resources Officer, e-mail applications to maria.raboshakga@ul.ac.za\nTelephonic enquiries regarding conditions of service: (015) 268 2794 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference SENIOR LECTURER: BIOSTATISTICS will be given to Male (Africans, Indians, and Coloureds) Female (Africans and Coloureds) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make an appointment.\n \n \n \n \n ",
                " \n \n \n \nDEPARTMENT OF PUBLIC HEALTH \nSENIOR LECTURER – HEALTH SYSTEMS AND HEALTH POLICY\n \nThe Department of Public Health at University of Limpopo is seeking a highly qualified Public Health Specialist who will lead the Health Systems and Policy. The incumbent will provide strategic leadership, academic management, and operational direction to these programmes. The appointee will be tasked to ensure the academic integrity, and financial viability of the Masters and Post Grad curricula and qualifications. Additionally, and amongst other key functions, he/she will be responsible for coaching, mentoring, and developing the capacity of students in the Department of Public Health and also assist in independent research. \n \nMINIMUM REQUIREMENTS: \nPossession of a doctoral degree (PhD) in Public Health or Health Systems and Policy. \nAt least 3 years’ teaching experience at a tertiary institution. \nSound to Advanced (depending on the level), theoretical knowledge of any of the following fields: \nHealth Policy and Systems \nUnderstanding the dynamics of health policy change and health system development \nGovernance and stewardship \nDynamics of policy implementation, and the role of the health system in enabling health equity and public value. \nPhilosophical and Ethical Foundations of Public Health \nQuantitative and qualitative research methods including statistical analysis. \nTeaching, Supervision and Mentoring of postgraduate students. \nPublication of research articles in accredited journals. \nSupervision of students work and co-publication with students. \nParticipation in community engagement projects. \n \nGENERIC REQUIREMENTS: \nAdvanced theoretical knowledge and insights into the field of Health Policy and Systems.\nCompetence in communicating knowledge and facilitating teaching and learning in a lecture, seminar, tutorial and/or in assessment practices. \nThe ability to engage in curriculum design and development; and a demonstrated ability to conduct high-quality research. \nA thorough understanding of fundamental research methodology and competence in facilitating research tutorials/seminars and practical sessions; and/or undertaking research projects, production of research reports. \nA substantial number of conference papers, peer-reviewed publications or other acceptable research outputs. \nPeer-recognition as a specialist in the field of Health Policy and Systems and potential to make a substantial contribution to the discipline or field. \nAbility to supervise research at postgraduate level and to develop research capacity. \nAn involvement in the wider academic community (e.g. editorships, review requests, participation in professional bodies). \nCapacity and willingness to undertake administrative responsibilities at departmental or institutional levels and to assume leadership positions, either in administration or in academic or professional activity. \nPromotion of and/or active participation in community engagement projects and/or leadership in establishing such projects. \nSound interpersonal skills, including a commitment to collegiality and equal opportunity. Competence as an Associate Professor, demonstrating that the applicant has been recognised by the academic community for producing sound scholarship in either the teaching or research categories, but preferably in both. \nAbility to teach effectively at different academic levels, commensurate with the nature of the post to which the applicant was previously appointed. \nAn interest in and engagement with the theory of teaching and learning, the promotion of/active participation in teaching development programmes and the capacity to play a role in curriculum design and development; management of academic programmes; recognition for advanced teaching practice and/or evidence of mentoring. \nOngoing research activity and dissemination of research findings, including a reasonable record of publications in accredited and/or internationally recognised research journals, commensurate with the applicant’s discipline and the nature of the post to which the applicant was previously appointed. \nA substantial record of high-quality scholarship and research relative to others in the same field, evidenced by a record of high quality publications in appropriate academic journals. \nCapacity to initiate, manage and supervise research, including research at doctoral and postdoctoral level, to attract research students and/or research projects and funding, and to develop research capacity. \nProfessional and academic standing in the field of Health Policy and Systems. \nThe ability and willingness to encourage the intellectual and career aspirations of staff and students. \nWhere appropriate, advanced research skills or capacity in the relevant discipline or field and participation in development programmes. Must have demonstrated strong research and academic leadership (e.g., by serving on university committees, professional and academic associations, acting as head of division or discipline), with competencies to serve as head of research division. \nService to the University either at departmental or institutional level. \nAbility to take on administrative responsibilities at departmental level. \nAcademic and/or professional participation at national and/or international level. \nCommunity engagement activity. \nA track record of service to the academic and wider community, either by contributing to teaching and learning or as a research leader in a particular discipline or field, nationally and internationally. \nA qualification in, or proof of studying towards, the assessment of learning at NQF Level 7/8, or an equivalent teaching qualification. \nA qualification in or proof of studying towards, postgraduate supervision at NQF Level 7/8, or an equivalent postgraduate supervision qualification. \n \nOTHER REQUIREMENTS: \nSkills\nTeaching skills at university level, especially teaching large classes. \nAn ability to design curricula in Philosophy. \nCapability to stimulate and teach research and participation in departmental academic discussions. \nAbility to inspire a passion for pursuit of philosophy in students. \nOrganising and Planning Skills. \nComputer literacy. \nSound administration skills. \n \nKnowledge & Experience: \nKnowledge of Higher Education environment, HEQC, SAQA standards, programme accreditation and articulation requirements and processes. \n \nBehaviours:\nProfessionalism\nPlanning and organisation \nAttention to detail. \nPersonal learning and development \nEffective communication \nCollaboration / teamwork \nResults orientation \nAccountability\nCustomer or Service Focus \nInclusivity / diversity \nIntegrity\nReliability / dependability \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nTyped applications which should contain comprehensive curriculum vitae, certified copies of all qualifications and contact details of three referees should be forwarded for the attention of Ms P.M Raboshakga to the Chief Human Resources Officer, e-mail applications to maria.raboshakga@ul.ac.za\nTelephonic enquiries regarding conditions of service: (015) 268 2794 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference SENIOR LECTURER-HEALTH SYSTEMS AND HEALTH POLICY will be given to Male (Africans, Indians, and Coloureds) Female (Africans, Coloureds and Africans) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make an appointment.\n \n \n \n \n ",
                " \n \n \n \n \nDEPARTMENT OF LINGUISTICS, TRANSLATION, AND INTERPRETING \nJUNIOR LECTURER (SENIOR LABORATORY ASSISTANT) X1 \nOne (1) vacancy exists for suitably qualified, experienced individual in the above-stated Department. The individual will form part of a dynamic team of academics, responsible for undergraduate and postgraduate teaching, research and community engagement in the Department. The Department is within the School of Languages and Communication Studies, Faculty of Humanities. \n \nRequirements\nHonours Degree in Linguistics/Translation/ and or Interpreting (Sign Language will be an advantage). \nKnowledge of recent software for interpreting. \nOne (1) year teaching experience at tertiary institution. \nDemonstration of the ability to prepare students for life beyond school. \nKnowledge of functional, adaptive, and social skills are an additional necessity. \nGood understanding of decision-making, problem solving skills as well as creative/ critical thinking. \nDemonstration of good communication, interpersonal skills, self-awareness, and empathy; resilience and equanimity. \nPotential to initiate research (projects) and contribute to joint research projects. \nGood understanding of collaborative, ethical, innovative, and effective leadership and commitment to higher education standards. \nUnderstanding the challenges facing the Higher Education sector. Teaching and Learning: Full involvement in teaching and curriculum development and review, updating material i.r.o. national and international trends, identify at risk students and facilitate \n \nDuties: \nManage the Laboratory on daily basis. Assist students with interpreting sessions. \nResearch: Supervise Honours and manage involvement in research processes and oversee and participate in project teams working on research projects, participation in conferences, publish articles/books/book chapters in DHET accredited journals. \nAcademic citizenship: Be involved in Community Engagement, take an active role in professional organisations. Governance: Prepare course outlines and study guides, organise course files, deliver to deadlines, record of all academic activities (such as students’ attendance records, marks and other required records), participate in Departmental, School and Faculty committees. \nPerformance appraisal: Undergo regular performance appraisal assessments. \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, Academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, email applications to Recruitment8@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Ms B. Olaniyan (015) 268 3252 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. JUNIOR LECTURER (SENIOR LABORATORY ASSISTANT) Preference: will be given to Male (Africans. Indians and Coloureds) Female (Indians, Coloureds and Whites) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make appointment.\n \n \n \n \n \n ",
                " \n \n \n \nDEPARTMENT OF LANGUAGES \nSENIOR LECTURER: PERFORMING ARTS \n \nRequirements:\nPhD in Performing and Dramatic Arts \nProven publication record of accomplishment in accredited journals (Minimum of at least 3 publications in DHET accredited journals). \nA minimum of 2 years experience in successful teaching at an institution of higher learning will be an added advantage. \nAbility to develop innovative and inclusive approach to the Performing Arts \nBroad-based community engagement expertise in Theatre Arts \nStrong understanding of collaborative, ethical, innovative and effective leadership style and commitment to higher education standards \nCommitted ability to promote the Departments mission and position to internal University constituencies and external stakeholders \nUnderstanding the challenges facing the Higher Education Sector \n \nDuties for Senior Lecturer: \nTeaching and Learning: Full involvement in all courses, design and curriculum development, updating material i.r.o. national and international trends, evaluations of lectures, lecturers and course material, maintains discussion class programmes, identifies at risk students and facilitates additional assistance, undertakes discipline related research. \nResearch: Participation in conferences, produce published articles/books/chapters in book (measurable research outputs in DHET accredited journals)\nAcademic citizenship: Involvement in community engagement, takes an active role in professional organisations. \nGovernance: Prepare course outlines and study guides, organise course files, deliver to deadlines, records of all academic activities, participate in departmental, school and faculty committees. \nPerformance appraisal: Undergo regular performance appraisal assessments. \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, e-mail applications to Recruitment8@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Ms B. Olaniyan (015)268-3252 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. SENIOR LECTURER PERFORMANCE ARTS Preference will be given to Male (Africans, Indians, and Coloureds) Female (Indians, Coloureds and Whites) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make appointment.\n \n \n \n \n ",
                "DEPARTMENT OF MERCANTILE AND LABOUR LAW \nASSOCIATE PROFESSOR \n \nRequirements:\nLLD/PhD in Mercantile and or Labour law fields. \nAt least ten (10) years of teaching experience in the legal field at a tertiary institution. \nEight (8) points (research output through journal articles and or conference proceedings) (published in DHET accredited journals/ platforms. \nSuccessful supervision record at postgraduate level and evidence of external examination of mini dissertation /dissertation/theses. \nCertified assessor and moderator in higher education will be an added advantage. \nEvidence of mentoring junior academics will be an added advantage. \nTrack record in pensions law will be an added advantage. \n \nDuties:\nThe incumbent will be required to: \nConduct lectures in LLB and LLM programmes in the School of Law. \nConduct assessments, mark assessments and provide timeous feedback to students. \nProvide supervision of research works of LLB, LLM and LLD students. \nAttend and participate in training workshops concerning assessment, moderation, teaching and learning, legal pedagogy, research and community engagement. \nProvide academic leadership through mentoring of junior academics. \nServe in various School and Faculty committees. \nCreatively develop innovative academic activities. \nPresent papers at conferences. \nPublish articles in accredited peer-reviewed journals. \nImprove the research output, postgraduate throughput and thus, the research standing of the School and the Faculty. \nContribute chapters in books. \nContribute papers in conference proceedings. \nParticipate in and perform designated community engagement duties, as well as branding and marketing of the department. \nParticipate in specific administrative and managerial duties as may be necessary, and per directive of the Head of Department. \nContinuously participate in research, teaching and learning and community engagement. \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, Academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, e-mail applications to Recruitment7@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Mr A.L Mafana (015) 268 2916\n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference: ASSOCIATE PROFESSOR: will be given to Male (Indians. and Coloureds) Female (Africans and Coloured). \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make appointment.",
                "DEPARTMENT OF JURIPRUDENCE, LEGAL PLURALISM, CRIMINAL LAW AND PROCEDURE \nPROFESSOR/ASSOCIATE PROFESSOR \n \nRequirements: Professor \nLLD/PhD in either jurisprudence/Legal pluralism/Customary Law/ Criminal law/ Procedural Law/ public Law. \nAt least ten (10) years of teaching experience in the legal field at a tertiary institution. \nProfessor- Fifteen (15) points (research output through articles & conference proceedings) (published) in the DHET accredited journals/ platforms. \nSuccessful supervision record at postgraduate level (including at least 2 at LLD/PhD levels) and evidence of external examination of mini-dissertations/dissertations/theses. \nCertified assessor and moderator in high education will be an added advantage. \nEvidence of mentorship of junior academics will be an added advantage. \n \nRequirements: Associate Professor \nLLD/PhD in jurisprudence/Legal Pluralism/ Customary Law/Criminal law/ Procedural law/ Public law. \nAt least ten (10) years teaching experience in the legal field at a tertiary institution. \nEight (8) points (research output through journal articles & or conference proceedings) published in the field of Jurisprudence/ Criminal law/ Procedural law in the DHET accredited journal/ platforms. \nSuccessful supervision record at postgraduate level and evidence of external examination of mini-dissertations/dissertations/ theses. \nCertified assessor and moderator in higher education will be an added advantage. \nEvidence of mentorship of junior academics will be an added advantage. \n \nDuties:\nThe incumbent will be required to: \nConduct lectures in LLB and LLM programmes in the School of Law. \nConduct assessments, mark assessments and provide timeous feedback to students. \nProvide supervision of research works of LLB, LLM and LLD students. \nAttend and participate in training workshops concerning assessment, moderation, teaching and learning, legal pedagogy, research and community engagement. \nProvide academic leadership through mentoring of junior academics. \nServe in various School and Faculty committees. \nDevelop creative academic activities. \nPresent papers at conferences. \nPublish articles in accredited peer-reviewed journals. \nImprove the research output, postgraduate throughput and thus, the research standing of the School and the Faculty. \nContribute chapters in books. \nContribute papers in conference proceedings. \nParticipate in and perform designated community engagement duties, as well as branding and marketing of the department. \nParticipate in specific administrative and managerial duties as may be necessary, and per directive of the Head of Department. \n \n \nCLOSING DATE: 27 OCTOBER 2023 \n \nPlease submit cover letter clearly indicating which post you are applying for a detailed CV with all your names, addresses, contact details and email address and include contact numbers of three (3) referees, certified copies of all qualifications including Matric/ Grade 12 Certificate, Academic transcripts and a South African ID/ Passport should be forwarded to Chief Human Resource Officer, e-mail applications to Recruitment7@ul.ac.za\n \nTelephonic enquiries regarding conditions of service: Mr A.L Mafana (015) 268 2916 \n \nIt is the applicant’s responsibility to have foreign obtained qualifications evaluated by the South African Qualifications Authority. Please note that failure to submit the requested documents/ information will result in your application not being considered. \n \nThe University of Limpopo is an Equal Opportunity Employer. All appointments will be made in accordance with the University’s Employment Equity Policy. Preference: PROFESSOR /ASSOIATE PROFESSOR: will be given to Male (Africans. Indians and Coloureds) Female (Africans, Coloureds and Whites) \n \nCorrespondence will be limited to short-listed candidates only. Applicants who have not been contacted within 30 days of the closing date must consider their applicants as unsuccessful. \n \nThe University reserve the right not to make appointment."
            ],
            "postedDate": "12/10/2023",
            "iframe": ""
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/unisa_orig.jpg",
            "href": "https://www.govpage.co.za/university-of-south-africa-unisa-vacancies-blog/university-of-south-africa-unisa-vacancies1580676",
            "title": "UNIVERSITY OF SOUTH AFRICA (UNISA) VACANCIES",
            "content": [],
            "postedDate": "12/10/2023",
            "iframe": "https://drive.google.com/file/d/1Nug1XQC4n29p6Bhtcty0M6qcTWoQlVtd/preview"
        },
        {
            "imgSrc": "https://www.govpage.co.za/uploads/2/4/0/5/24052997/vut_orig.png",
            "href": "https://www.govpage.co.za/vaal-university-of-technology-vut-vacancies-blog/vaal-university-of-technology-vut-vacancies1598359",
            "title": "VAAL UNIVERSITY OF TECHNOLOGY (VUT) VACANCIES",
            "content": [
                " \nVAAL UNIVERSITY OF TECHNOLOGY (VUT)\n ",
                " \n \nINTERNAL & EXTERNAL\n \nRE-ADVERTISEMENT\nDIVISION: STUDENT SUPPORT SERVICES \nDEPARTMENT: STUDENT ACCOMMODATION & CATERING\nPOST: MANAGER MAINTENANCE (GROUNDS & FACILITIES) \nPOST Nº: 5279 \nPEROMNES GRADE: 09 \n \nJOB DESCRIPTION:\nKey performance areas include but are not limited to:\n• Operational Technical Facilities Management\n• Development of Policy and Procedure (Administration)\n• Monitoring and Evaluation (Audit)\n• Budgeting\n• Resource Management\n• Strategy Development and Execution\n \nAPPLICATION CRITERIA:\nQualifications and Experience:\n• Bachelor’s degree (NQF 7) in facilities management\n• Five (5) years relevant experience\n• Three (3) years proven experience in middle management.\n \nSkills and Competencies:\n• Leadership and Organizing skills.\n• Excellent communication skills (verbal and written)\n• Excellent customer service\n• Computer literacy\n• Ability to prepare planning schedules with measurable goals.\n• Ability to develop emergency preparedness plans.\n \nCandidates who previously applied and do meet the minimum requirements are encouraged to re-apply. \n \n \nCLOSING DATE FOR APPLICATIONS: 25 OCTOBER 2023\n \nApplications should include:\n1. A fully completed prescribed application form which can be obtained from: https://www.vut.ac.za/wp-content/uploads/2023/08/Application-of-Employment-Form-updated.pdf\n2. A detailed curriculum vitae (explicitly stating experience or knowledge in the above-mentioned fields)\n3. Certified copies of all academic records and certificates/degrees\n4. Certified copy of ID\n5. Current contact information of referees\n6. Please email applications to recruitment1@vut.ac.za and quote the post reference and post description in the subject line.\n7. No manual applications will be accepted. Incomplete applications or applications without the application form and required documents will be disregarded.\n8. Only applications made on our application for employment form would be considered.\n9. Communication will be entered into with short-listed candidates only. If you don’t hear from VUT within 3 months deem your application as unsuccessful.\n \nPlease Note: Submission of such copies entitles Vaal University of Technology to authenticate the qualifications without any further consent from the applicant. Candidates with foreign qualifications must submit a SAQA certificate of evaluation. Vaal University of Technology is an equal opportunity and affirmative action employer, which is committed to the implementation of its employment equity plan. People from designated groups are encouraged to apply. Only shortlisted candidates will be contacted.\n \nVUT reserves the right not to make an appointment\n \nBy applying for this position, you give permission to share your information with the selection panel or the relevant people involved in the recruitment process.\n \n \n \n ",
                " \n \n \n \nINTERNAL & EXTERNAL\n \nDIVISION: STUDENT SUPPORT SERVICES \nDEPARTMENT: STUDENT ACCOMMODATION & CATERING\nPOST: MANAGER SERVICE & HOSPITALITY \nPOST Nº: 5049 \nPEROMNES GRADE: 07 \n \nJOB DESCRIPTION:\nKey performance areas include but are not limited to:\n• Development of Policy and Procedure (Administration)\n• Operational Management\n• Management of Budget and Financial Resources\n• Strategy Management Development and Execution\n• Monitoring and Evaluation (Audit)\n• Resource Management\n \nAPPLICATION CRITERIA:\nQualifications and Experience:\n• A relevant degree and a post-graduate qualification or a degree in Hospitality Management and a post graduate qualification.\n• Eight (8) year experience in operational management (people management, student governance, cleaning services, waste removal, transport and catering services)\n• Four (4) year experience in Student Affairs or Student Services in a University.\n \nSkills:\n• Leadership and Organizing skills\n• Excellent communication skills (verbal and written)\n• Excellent customer service\n• Computer literacy\n• Ability to prepare planning schedules with measurable goals\n• Ability to develop emergency preparedness plans\n \n \nCLOSING DATE FOR APPLICATIONS: 25 OCTOBER 2023\n \nApplications should include:\n1. A fully completed prescribed application form which can be obtained from: https://www.vut.ac.za/wp-content/uploads/2023/08/Application-of-Employment-Form-updated.pdf\n2. A detailed curriculum vitae (explicitly stating experience or knowledge in the above-mentioned fields)\n3. Certified copies of all academic records and certificates/degrees\n4. Certified copy of ID\n5. Current contact information of referees\n6. Please email applications to recruitment1@vut.ac.za and quote the post reference and post description in the subject line.\n7. No manual applications will be accepted. Incomplete applications or applications without the application form and required documents will be disregarded.\n8. Only applications made on our application for employment form would be considered.\n9. Communication will be entered into with short-listed candidates only. If you don’t hear from VUT within 3 months deem your application as unsuccessful.\n \nPlease Note: Submission of such copies entitles Vaal University of Technology to authenticate the qualifications without any further consent from the applicant. Candidates with foreign qualifications must submit a SAQA certificate of evaluation. Vaal University of Technology is an equal opportunity and affirmative action employer, which is committed to the implementation of its employment equity plan. People from designated groups are encouraged to apply. Only shortlisted candidates will be contacted.\n \nVUT reserves the right not to make an appointment\n \nBy applying for this position, you give permission to share your information with the selection panel or the relevant people involved in the recruitment process.\n \n \n \n \n ",
                " \n \n \n \nINTERNAL/ EXTERNAL\n \nDIVISION: REGISTRAR \nDEPARTMENT: SHARED SERVICES\nPOST: DEPUTY REGISTRAR: EXAMINATIONS AND GRADUATIONS \nPOST Nº: 5110 \nPEROMNES GRADE: 06 \n \nJOB DESCRIPTION:\nThe purpose of the job is to oversee and manage the VUT Examinations (50%), Invigilations, Graduations, Subjects Credits, Exemptions, and Certification processes.\n \nROLES AND RESPOSIBILITIES:\nThe primary role of the Deputy Registrar is to support the Senior Deputy Registrar in fulfilling the obligations placed on the Registrar by the Higher Education Act and the Statute of the Vaal University of Technology.\n \nKEY PERFORMANCE AREAS INCLUDE BUT ARE NOT LIMITED TO:\n• Oversee, guide, and optimize the delivery of services in the following Academic Administration sub-sections: Examinations, Moderators and Examiners, Remuneration, Credits/Exemptions, Graduations, and Certification.\n• Initiate, continuously develop, and deliver University Examinations, Moderators, and Examiners’ Remuneration, Credits/Exemptions, Graduations, and Certification policies and procedures to ensure legislative compliance and support of university strategic objectives.\n• Evaluating the existing systems and overseeing the switch from paper to Auto-Promotion/Graduation system.\n• Advise the Senior Deputy Registrar on the best practices of all the processes within the department.\n• Coordinate the question paper room with electronic question paper processes.\n• Oversee the Management of all the invigilation processes and work in conjunction/liaison with the timetabling office and the faculties.\n• Ensure safe keeping of all the certificates.\n• Manage audit processes within the department (human, budgetary, and capital resources) to ensure a high-quality, customer-focused, and continually improving service delivery to the University.\n• Develop, maintain, and implement service-level agreements with relevant departments and stakeholders with respect to the Examinations, Moderators, and Examiners’ Remuneration, Credits/Exemptions, Graduations, and Certification.\n• Contribute to the Graduation and Certification management profession and ensure that University approaches and practices remain current to influence professional development and enhance the University’s reputation. Coordinate all Graduation ceremonies of the University.\n• Work closely with the Senior Deputy Registrar in positioning the strategic management processes within the Department and contribute to the transformational agenda of VUT.\n• Develop, implement, and maintain an online exemption application system.\n• Develop and maintain progressive service delivery with the Institutional Planning Unit (IPU), particularly with HEMIS submissions.\n• Keep abreast with technological advancements within the Higher Education landscape.\n \nAPPLICATION CRITERIA:\nQualifications and Experience:\n• M+4 or equivalent qualification.\n• A Master’s degree will be an added advantage.\n• Computer Literacy and a high level of ITS system knowledge (Integrator 4).\n• Minimum 7 years of relevant experience in Higher Education Legislation, particularly in Examinations, Graduations, and Certification processes.\n \nSKILLS/KNOWLEDGE AND COMPETENCIES:\n• Knowledge of Higher Education legislation and regulatory requirements with implications for academic administration.\n• Appropriate experience in managing staff and working in a customer service environment.\n• Demonstrable ability to prioritize and coordinate the work of teams, learn and adhere to procedures, and commit to high-quality service delivery.\n• High proficiency in Microsoft Excel and PowerPoint.\n• Demonstrable knowledge of university academic rules and policies.\n• Sound report writing skills.\n• Excellent oral and written communication skills.\n• Exceptional presentation and negotiation skills.\n• Analytical skills with the ability to recognize problems, consider broader implications, and present supported conclusions.\n• Drive and ability to work as part of the team and be innovative.\n \nAPPLICATION CRITERIA:\nQualification and Experience:\n• A suitable post graduate qualification. Preferred degrees, listed in order of preference, include Language Practice, Linguistics, English, Communication, Journalism, Education (or an equivalent degree with a major in English).\n• Proven editing background and experience\n• Affiliation to a professional editing body will be an advantage.\n• Experience in policy editing will be an advantage.\n• Minimum 5 years’ experience in the field of editing, preferably in the field of corporate governance.\n• Advanced Computer Literacy.\n \nRequired Skills and Competencies:\n• Language Proficiency: Strong command of the English language, including grammar, syntax, punctuation, and spelling.\n• Editing and Proofreading: Proficient in editing and proofreading techniques to ensure clarity, coherence, and consistency in written content.\n• Attention to Detail: Meticulous attention to detail to catch errors, inconsistencies, and typos in written material.\n• Style Guides: Familiarity with and adherence to different style guides (e.g., APA, MLA, Chicago) and the ability to maintain a consistent style throughout documents.\n• Critical Thinking: Analytical and critical thinking skills to evaluate content for logical flow, coherence, and effectiveness.\n• Time Management: Ability to manage time effectively to meet deadlines for editing tasks.\n• Adaptability: Flexibility to adapt to different writing styles, tones, and subject matters.\n• Communication Skills: Clear communication skills, both written and verbal, to provide constructive feedback to writers.\n• Research Skills: Ability to conduct research when needed to ensure accuracy and completeness of content.\n• Collaboration: Effective collaboration with writers, other editors, and team members to enhance the overall quality of content.\n• Software Proficiency: Familiarity with editing tools and software, such as Microsoft Word's track changes, and proficiency in using technology to streamline editing processes.\n• Cultural Sensitivity: Awareness of and sensitivity to diverse linguistic and cultural nuances.\n• Consistency: Ensuring consistency in language usage, terminology, and formatting throughout documents.\n• Confidentiality: Understanding and maintaining confidentiality when dealing with sensitive or proprietary information.\n\n• Subject Matter Familiarity: Depending on the industry, having knowledge or a willingness to learn about specific subject matters to ensure accurate editing.\n• Continuous Learning: Willingness to stay updated on language trends, editing techniques, and industry-specific terminology.\n• Problem-Solving: Skill in identifying and resolving language-related challenges within written content.\n \n \nCLOSING DATE FOR APPLICATIONS: 25 OCTOBER 2023\n \nApplications should include:\n1. A fully completed prescribed application form which can be obtained from www.vut.ac.za\nhttps://www.vut.ac.za/wp-content/uploads/2023/03/VUT-Application-for-Employment-form-Final-002.pdf\n2. A detailed curriculum vitae (explicitly stating experience or knowledge in the above-mentioned fields)\n3. Certified copies of all academic records and certificates/degrees\n4. Certified copy of ID\n5. Current contact information of referees\n6. Please email applications to recruitment1@vut.ac.za and quote the post reference and post description in the subject line.\n7. No manual applications will be accepted. Incomplete applications or applications without the application form and required documents will be disregarded.\n8. Only applications made on our application for employment form would be considered.\n9. Communication will be entered into with short-listed candidates only. If you don’t hear from VUT within 3 months deem your application as unsuccessful.\n \nEnquiries may be directed to:\nHR Practitioner: Ms Carmen Titus Tjotjo, Tel 016 950 6848 / email address: carment@vut.ac.za\nHR Business Partner: Ms Ntediseng Motaung, Tel 016 950 9160 / email address: ntediseng@vut.ac.za\n \nPlease Note: Submission of such copies entitles Vaal University of Technology to authenticate the qualifications without any further consent from the applicant. Candidates with foreign qualifications must submit a SAQA certificate of evaluation. Vaal University of Technology is an equal opportunity and affirmative action employer, which is committed to the implementation of its employment equity plan. People from designated groups are encouraged to apply. Only shortlisted candidates will be contacted.\n \nVUT reserves the right not to make an appointment\n \nBy applying for this position, you give permission to share your information with the selection panel or the relevant people involved in the recruitment process.\n \n \n \n \n ",
                " \n \n \n \nINTERNAL/ EXTERNAL\n \nRE-ADVERTISEMENT\nDIVISION: REGISTRAR \nDEPARTMENT: GOVERNANCE\nADMINISTRATION\nPOST: LANGUAGE EDITOR \nPOST Nº: 2118\nPEROMNES GRADE: 8\n \nJOB DESCRIPTION:\nKey performance areas include but are not limited to:\n1. Document Editing\nEdit minutes, policies and operational documents in terms of:\n• Checking and correcting all indisputable grammatical and syntactical errors, as well as language usage\n• Checking adherence to style and register\n• Ensuring correctness of spelling, punctuation, numerals and numbering\n• Checking precision of word usage and refining of style and composition\n• Checking headings, sub-headings, capitalisation and use of italics\n• Checking completeness and correct formatting of any figures, tables, captions, labels, footnotes, page numbers, table of contents, glossaries, references and annexures.\n• Ensuring correct spelling of names, places and institutions\n• Checking final drafts of agendas, minutes, policies and operational documents to ensure they are free of errors.\n• Ensuring all written material is accurate and of a high quality and are Ensuring all correspondence is easy to read and fits the editorial style.\n2. Document Control\nEditorial functions include:\n• Ensure the correct use of templates, formats and document frameworks\n• Establish and enforce the document control policy\n• Maintain all document registers, with a specific focus on the institutional policy register\n• Ensure completeness of covering documentation, sign-off procedures and consultation notes.\n3. Office Administration\n• Assist the Registrar’s Office with general language editing and document control.\n• Maintaining, updating and ensuring use of Style Guide\n• Email Communication: Crafting and editing email communication to ensure clarity, correctness, and adherence to professional standards.\n4. Other Responsibilities\n• Adhere to quality standards in all areas of the job\n• Present a positive image of the University in all aspects of the job and maintain high levels of integrity.\n \nAPPLICATION CRITERIA:\nQualification and Experience:\n• A suitable post graduate qualification. Preferred degrees, listed in order of preference, include Language Practice, Linguistics, English, Communication, Journalism, Education (or an equivalent degree with a major in English).\n• Proven editing background and experience\n• Affiliation to a professional editing body will be an advantage.\n• Experience in policy editing will be an advantage.\n• Minimum 5 years’ experience in the field of editing, preferably in the field of corporate governance.\n• Advanced Computer Literacy.\n \nRequired Skills and Competencies:\n• Language Proficiency: Strong command of the English language, including grammar, syntax, punctuation, and spelling.\n• Editing and Proofreading: Proficient in editing and proofreading techniques to ensure clarity, coherence, and consistency in written content.\n• Attention to Detail: Meticulous attention to detail to catch errors, inconsistencies, and typos in written material.\n• Style Guides: Familiarity with and adherence to different style guides (e.g., APA, MLA, Chicago) and the ability to maintain a consistent style throughout documents.\n• Critical Thinking: Analytical and critical thinking skills to evaluate content for logical flow, coherence, and effectiveness.\n• Time Management: Ability to manage time effectively to meet deadlines for editing tasks.\n• Adaptability: Flexibility to adapt to different writing styles, tones, and subject matters.\n• Communication Skills: Clear communication skills, both written and verbal, to provide constructive feedback to writers.\n• Research Skills: Ability to conduct research when needed to ensure accuracy and completeness of content.\n• Collaboration: Effective collaboration with writers, other editors, and team members to enhance the overall quality of content.\n• Software Proficiency: Familiarity with editing tools and software, such as Microsoft Word's track changes, and proficiency in using technology to streamline editing processes.\n• Cultural Sensitivity: Awareness of and sensitivity to diverse linguistic and cultural nuances.\n• Consistency: Ensuring consistency in language usage, terminology, and formatting throughout documents.\n• Confidentiality: Understanding and maintaining confidentiality when dealing with sensitive or proprietary information.\n• Subject Matter Familiarity: Depending on the industry, having knowledge or a willingness to learn about specific subject matters to ensure accurate editing.\n• Continuous Learning: Willingness to stay updated on language trends, editing techniques, and industry-specific terminology.\n• Problem-Solving: Skill in identifying and resolving language-related challenges within written content.\n \n \nCLOSING DATE FOR APPLICATIONS: 25 OCTOBER 2023\n \nApplications should include:\n1. A fully completed prescribed application form which can be obtained from www.vut.ac.za\nhttps://www.vut.ac.za/wp-content/uploads/2023/03/VUT-Application-for-Employment-form-Final-002.pdf\n2. A detailed curriculum vitae (explicitly stating experience or knowledge in the above-mentioned fields)\n3. Certified copies of all academic records and certificates/degrees\n4. Certified copy of ID\n5. Current contact information of referees\n6. Please email applications to recruitment1@vut.ac.za and quote the post reference and post description in the subject line.\n7. No manual applications will be accepted. Incomplete applications or applications without the application form and required documents will be disregarded.\n8. Only applications made on our application for employment form would be considered.\n9. Communication will be entered into with short-listed candidates only. If you don’t hear from VUT within 3 months deem your application as unsuccessful.\n \nEnquiries may be directed to:\nHR Practitioner: Ms Carmen Titus Tjotjo, Tel 016 950 6848 / email address: carment@vut.ac.za\nHR Business Partner: Ms Ntediseng Motaung, Tel 016 950 9160 / email address: ntediseng@vut.ac.za\n \nPlease Note: Submission of such copies entitles Vaal University of Technology to authenticate the qualifications without any further consent from the applicant. Candidates with foreign qualifications must submit a SAQA certificate of evaluation. Vaal University of Technology is an equal opportunity and affirmative action employer, which is committed to the implementation of its employment equity plan. People from designated groups are encouraged to apply. Only shortlisted candidates will be contacted.\n \nVUT reserves the right not to make an appointment\n \nBy applying for this position, you give permission to share your information with the selection panel or the relevant people involved in the recruitment process.\n \n \n \n ",
                ""
            ],
            "postedDate": "12/10/2023",
            "iframe": ""
        }
    ],
    "departments": {
        "independent communications authority of south africa (icasa) vacancies": "https://www.govpage.co.za/independent-communications-authority-of-south-africa-icasa-vacancies-blog/independent-communications-authority-of-south-africa-icasa-vacancies6535425",
        "national agricultural marketing council (namc) vacancies": "https://www.govpage.co.za/national-agricultural-marketing-council-namc-vacancies-blog/national-agricultural-marketing-council-namc-vacancies5139922",
        "national credit regulator (ncr) vacancies": "https://www.govpage.co.za/national-credit-regulator-ncr-vacancies-blog/national-credit-regulator-ncr-vacancies8307159",
        "south african national aids council (sanac) vacancies": "https://www.govpage.co.za/south-african-national-aids-council-sanac-vacancies-blog/south-african-national-aids-council-sanac-vacancies4124025",
        "south african national parks (sanparks) vacancies": "https://www.govpage.co.za/south-african-national-parks-sanparks-vacancies-blog/south-african-national-parks-sanparks-vacancies7168920",
        "coega development corporation (cdc) vacancies": "https://www.govpage.co.za/coega-development-corporation-cdc-vacancies-blog/coega-development-corporation-cdc-vacancies4709992",
        "eastern cape parks and tourism agency (ecpta) vacancies": "https://www.govpage.co.za/eastern-cape-parks-and-tourism-agency-ecpta-vacancies-blog/eastern-cape-parks-and-tourism-agency-ecpta-vacancies7510675",
        "ezemvelo kzn wildlife vacancies": "https://www.govpage.co.za/ezemvelo-kzn-wildlife-vacancies-blog/ezemvelo-kzn-wildlife-vacancies7335803",
        "fort cox agriculture and forestry training institute vacancies": "https://www.govpage.co.za/fort-cox-agriculture-and-forestry-training-institute-vacancies-blog/fort-cox-agriculture-and-forestry-training-institute-vacancies2057469",
        "durban university of technology (dut) vacancies": "https://www.govpage.co.za/durban-university-of-technology-dut-vacancies-blog/durban-university-of-technology-dut-vacancies8670204",
        "sefako makgatho health sciences university (smu) vacancies": "https://www.govpage.co.za/sefako-makgatho-health-sciences-university-smu-vacancies-blog/sefako-makgatho-health-sciences-university-smu-vacancies6435638",
        "tshwane university of technology (tut) vacancies": "https://www.govpage.co.za/tshwane-university-of-technology-tut-vacancies-blog/tshwane-university-of-technology-tut-vacancies3688337",
        "university of limpopo vacancies": "https://www.govpage.co.za/university-of-limpopo-vacancies-blog/university-of-limpopo-vacancies2342213",
        "university of south africa (unisa) vacancies": "https://www.govpage.co.za/university-of-south-africa-unisa-vacancies-blog/university-of-south-africa-unisa-vacancies1580676",
        "vaal university of technology (vut) vacancies": "https://www.govpage.co.za/vaal-university-of-technology-vut-vacancies-blog/vaal-university-of-technology-vut-vacancies1598359"
    }
}