{
  "title": "propersonnel-jobs07 October 2023",
  "links": [
    {
      "jobTitle": "Safety Officer",
      "startDate": "2023-10-05 - 2023-11-06",
      "vacancyType": "Contractor",
      "jobSpecFields": "SHEQ",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "The candidate needs to have the following requirements:* ISO experience ESSENTIAL* Comsoc 1 &amp; 2* Mining &amp; Engineering experience essential* Candidate to start as soon as possible.* Valid drivers license",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002289-YDG"
    },
    {
      "jobTitle": "ADT Operator ( Articulated Dump Truck)",
      "startDate": "2023-10-05 - 2023-11-07",
      "vacancyType": "Contractor",
      "jobSpecFields": "Mining",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "The candidate must have previous working experience as a ADT operator valid certificates.",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002290-YDG"
    },
    {
      "jobTitle": "Portfolio Manager",
      "startDate": "2023-10-03 - 2023-11-02",
      "vacancyType": "Permanent",
      "jobSpecFields": "Admin, Office &amp; Support",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "The successful candidate must fulfill the following minimum requirements:&nbsp;Qualifications:\n\nGrade 12 with Math's or finance related experience&nbsp;\nNQF Level 4 Real Estate Qualification\n\nExperience, Skills, Knowledge&nbsp;\n\nExceptional computer literacy in Word, Excel, Email and Presentations&nbsp;\nHighly developed organizational and interpersonal skills as well as good professional communication skills&nbsp;\nAbility to multi task&nbsp;\nMature individual with strong independent initiative&nbsp;\nUnderstanding/knowledge of the Sectional Title Scheme Management Act&nbsp;\nExperience and knowledge of HOA and sectional Title Buildings&nbsp;\n",
      "contact": "Rene",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002286-R"
    },
    {
      "jobTitle": "Group CSI Officer",
      "startDate": "2023-09-21 - 2023-10-21",
      "vacancyType": "Permanent",
      "jobSpecFields": "FMCG",
      "location": {
        "city": ", JHB - Central",
        "region": "Gauteng"
      },
      "details": "Role looking after the community service initiatives for the business.Responsibilities:* Community driven projects are managed and also followed up, charity events, hospice clinic management and drive, managing the various charity organization donations and support functionsRequirements:* Person must have a suitable marketing qualification and or degree* Should be flexible and willing to travel* Must have a valid driver's license and own reliable transport.Reporting structure:* The role will be reporting to into the IT Directors as the function's leader within the Head Office function",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002279-YDG"
    },
    {
      "jobTitle": "Senior Payroll Administrator",
      "startDate": "2023-09-21 - 2023-10-21",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", JHB - Central",
        "region": "Gauteng"
      },
      "details": "Key responsibilities:* Understand the importance of revenue, productively, chargeability and the employees pay and ensuring accuracy in processing of the payrolls with HR administrators and financial support.* Supervise and execute routine admin activities (monthly) with accurate data and payroll capturing workflow leave management, benefit admin, and other payroll related duties.* Process monthly and yearly calendar of payroll processing* Computer hours worked* Process all changes to payroll* Ensure all payments are completed* Provide new employees with nessecary training on the payroll system&nbsp;Technical Expertise:* Liaise with tax authorities* Use specific software programs (payroll system)Team based Responsibilities.* Inputting payroll onto system* Support tax officer&nbsp;* Assists senior team membersRequirements:* Person who is willing to get involved at the Store Level* Experience leading and coordinate a payroll function withing the FMCG organization* Understand the BCEA and LRA in relation to the sectoral determination Act 9, wholesale and retail sector, COIDA and Unemployment Act* Minimum 5-10 years working experience on a payroll system related to Psiber or sages HR Premier System* Excel skills is required* Must have reliable transport",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002280-YDG"
    },
    {
      "jobTitle": "Procurement Superintendent – Commodities",
      "startDate": "2023-09-21 - 2023-10-21",
      "vacancyType": "Permanent",
      "jobSpecFields": "Mining",
      "location": {
        "city": ", Sandton",
        "region": "Gauteng"
      },
      "details": "Requirements:Minimum Qualifications:\n\nA degree or National Diploma in Commerce, Law, Engineering, or Supply Chain Management.\n\nExperience:\n\nA minimum of 6 years of relevant experience, with a preference for at least 2 years of managerial experience.\n\nResponsibilities:Safety, Health, Environment, and Quality (SHEQ):\n\nIdentify and assess risk exposures.\nApply risk mitigation and control measures.\nEnsure SHEQ compliance within the Section.\nUtilize the Integrated Management System (IMS) for SHEQ reporting.\n\nPeople Management:\n\nCultivate an enabling work culture.\nMaintain labor stability and minimize turnover.\nAlign labor complement with the budget.\nAchieve HDSA/Female targets.\nManage performance against targets and competencies.\nImplement Individual Development Plans (IDPs) linked to performance.\nConduct quarterly career discussions.\nEnforce discipline and address issues such as absenteeism and misconduct.\nProvide coaching and counseling to improve performance.\nConduct recruitment interviews.\n\nCustomer Relations:\n\nFoster and enhance relationships with key stakeholders.\nEnsure satisfaction among customers and suppliers.\nInteract with customers to understand operational concerns.\nEstablish and maintain effective communication channels between customers and suppliers.\nResolve customer queries and complaints.\n\nBusiness Processes:Category Management:\n\nManage all procurement-related activities within the assigned commodity category.\nImplement strategic sourcing initiatives to reduce Total Cost of Ownership.\nIdentify, implement, and maintain relevant commodity contracts.\nAchieve targeted cost savings through effective vendor negotiation.\nDevelop and maintain expert knowledge of supply markets, competitors, and innovations.\nFacilitate procurement change initiatives to enhance business performance.\n\nVendor Management:\n\nOversee vendor rationalization strategy within the assigned category.\nManage vendor selection, compliance, and performance.\n\nStakeholder Management:\n\nBuild strong relationships with both internal and external customers to enhance their experience.\n\nContract Management:\n\nManage all contracts within the assigned category throughout their lifecycle.\nHandle terminations, renewals, extensions, and re-assignments.\nIdentify and manage risks in collaboration with the cross-functional contracting team (Finance, Legal, Business Units, Maintenance Engineering).\n\nInnovation:\n\nIdentify innovative procurement solutions that drive efficiency within the organization.\n\nManagement Support:\n\nConduct procurement analyses and reporting to assist management in tracking and achieving departmental targets.\nProvide mentorship to Procurement Specialists and Contract Practitioners.\n\nGrowth:\n\nDrive continuous improvement through operational excellence.\nIdentify opportunities for improvements within the Procurement pipeline.\nIncrease BEE (Black Economic Empowerment) spend.\nInitiate Enterprise Development and Preferential Procurement opportunities.\n\nShareholder Value:\n\nManage the Section's costs.\nEnsure compliance with Financial Policies and Procedures.\nProtect company assets.\nReduce Total Cost of Ownership (TCO) and establish a competitive advantage through proactive procurement.\nDeliver auditable benefits.\n\nBehavioral Competencies:\n\nSafety Leadership\nInnovation\nLeadership\nPlanning, Organizing &amp; Control\nResults Orientation\nProblem Solving &amp; Decision Making\nAligning Performance for Success\nCommunication\nChange Leadership\nBuilding Strong Teams\nBusiness Acumen\n\nWorkplace Competencies:\n\nSkills: Proficiency in Microsoft programs and Systems like IMS, EBMS, SAP, COUPA, MES\nKnowledge: Understanding of legal contracts and Contract Management, market dynamics within the assigned commodity category, Supply Chain Management, Policies and Procedures, Systems Analysis, Mathematics, Mining Charter, B-BBEE Act, and the Code of Good Practice.\n",
      "contact": "Rene",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002281-R"
    },
    {
      "jobTitle": "Program Manager",
      "startDate": "2023-09-21 - 2023-10-21",
      "vacancyType": "Permanent",
      "jobSpecFields": "Mining",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "Required Qualifications:Relevant degree/diploma in Mechanical / Electrical Engineering/Technical/Construction discipline or equivalent.Project Management Qualification (i.e. PMP or similar).Working knowledge of Agile project management methodologies (such as Scrum, SAFe, Kanban, etc.) will be preferred.&nbsp;Experience and Knowledge:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10+ years’ experience in related field.5+ years’ experience in a Project Management Role.Minimum 5 years of experience in the following: Engineering / Production / Construction / Mining / Process Plant and related operations environment.Mining, Process Plant, Logistics, Infrastructure, Quantity Surveyor, Enterprise Project Management Systems, e.g. MS-Projects, Primavera P6, Prism, SAP.Communicate Effectively: Speak, listen and write in a clear, thorough and timely manner using appropriate and effective communication tools and techniques.Creativity/Innovation: Develop new and unique ways to improve operations of the organization and to create new opportunities.Foster Teamwork: Work cooperatively and effectively with others to set goals, resolve problem, and make decisions that enhance organizational effectiveness.The program manager must have strong practical experience in project management, which was gained through managing large and complex projects.Good knowledge and handling of project and program management methodology and techniques.&nbsp;Key Responsibilities:Daily program management throughout the program life cycle.Defining the program governance (controls).Planning the overall program and monitoring the progress.Managing the program’s budget.Managing risks and issues and taking corrective measurements.Coordinating the projects and their interdependencies.Managing and utilizing resources across projects.Managing stakeholders’ communication.Aligning the deliverables (outputs) to the program’s “outcome” with the aid of the business change manager.Managing the main program documentations such as the program initiation document.&nbsp;Competencies:&nbsp;Critical Thinking: Using logic and reasoning to identify the strengths and weaknesses of alternative solutions, conclusions or approaches to problemsActive Learning: Understanding the implications of new information for both current and future problem-solving and decision-makingBusiness knowledge: Good understanding of the organization and the business domain or sector within which it operatesComplex Problem Solving: Identifying complex problems and reviewing related information to develop and evaluate options and implement solutionsDeductive Reasoning: The ability to apply general rules to specific problems to produce answers that make senseInductive Reasoning: The ability to combine pieces of information to form general rules or conclusions (includes finding a relationship among seemingly unrelated events)Excellent communication skills: Ability to engage with high-level stakeholders, both verbal and non-verbalFlexibility and adaptability (crucial to consulting environment)Organizational and leadership abilitiesInfluencing and motivatingDecision makingBuilding trust and long-term relationships with stakeholders",
      "contact": "Rene",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002282-R"
    },
    {
      "jobTitle": "Project Engineer",
      "startDate": "2023-09-21 - 2023-10-21",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Krugersdorp",
        "region": "Gauteng"
      },
      "details": "Position: Project Engineer (Registered Candidate Engineer) Location: Various Project Sites (Flexibility to travel/work away from home)Availability: Immediatetly&nbsp;Key Responsibilities:\n\nProject Planning: Develop comprehensive project plans, timelines, and budgets.\nStructural Design: Oversee the structural design and engineering aspects of Tailings Storage Facilities.\nResource Management: Efficiently allocate resources, including labor and equipment.\nProject Management: Lead all project phases from initiation to completion.\nProcurement: Manage procurement processes and vendor relationships.\nReporting: Generate detailed project reports for stakeholders and management.\nSite Establishment: Ensure the effective setup and organization of project sites.\nClient Liaison: Act as the primary point of contact for clients, maintaining strong relationships.\nDirector and Service Provider Interaction: Collaborate with directors and service providers to meet project goals.\n\nRequirements:\n\nGraduate or Diplomat Engineer with relevant qualifications.\nRegistration as a Candidate Engineer with ECSA is essential.\nProficiency in Microsoft Office Suite.\nFamiliarity with Civil 3D, AutoCAD, and other relevant engineering software.\nStrong project management skills and experience.\nExcellent communication and interpersonal skills.\nWillingness to relocate to various project sites as required.\n\nMUST BE ABLE TO START EMPLOYMENT ON THE 01st of Oct 02023",
      "contact": "Rene",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002283-R"
    },
    {
      "jobTitle": "Cook",
      "startDate": "2023-09-20 - 2023-10-20",
      "vacancyType": "Contractor",
      "jobSpecFields": "Food and Beverage",
      "location": {
        "city": ", All Areas",
        "region": "All Areas"
      },
      "details": "In order to apply for this position please make sure you meet all the requirements:Qualifications:* NQF 2 - Grade 10 National Vocational Certificate Level 2* At least 1 year experience withing a kitchen, catering environment* Must be medically fit to work in the specific business area* Clear security screening record* Clear credit record* Valid driver's license* Be computer literacy in MS Office &amp; Simplexity* Be able to work in a teamOngoing accountabilities:* Catering* Financial Management* Building a value based organizational culture* ESG Compliance* SHE Compliance* Focus on safe production &amp; operational excellence* People management",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002278-YDG"
    },
    {
      "jobTitle": "Sales Rep",
      "startDate": "2023-09-19 - 2023-10-31",
      "vacancyType": "Permanent",
      "jobSpecFields": "Sales",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "The ideal candidate needs to have the following requirements in order to apply for this position:* Valid driver's license* Own reliable transport* Previous sales experience* Grade 12 certificate* Must know the Rustenburg and mining areas very well.",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002276-YDG"
    },
    {
      "jobTitle": "Financial Advisor Assistant",
      "startDate": "2023-09-15 - 2023-10-15",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Potchefstroom",
        "region": "North West"
      },
      "details": "Job description:Your role as Financial Advisor Assistant will be to assist our financial advisors with all administrative functions necessary to perform their duties, including the preparation of various long term insurance and investment product quotations, liaison with clients and corresponding with various product providers.Responsibilities:(The responsibilities include, but are not limited to the following)New Business Processing:\n\nResponsible for the preparation of all new business quotations.\nEnsure that the new business application forms are completed accurately and processed successfully.\nFollow-up outstanding requirements with clients and sales support assist and ensure outstanding requirements are received timeously.\nCapture notes on client management system and scan all relevant documentation onto the system for record keeping purposes.\n\nCustomer Services:\n\nCoordination of all life insurance claims correspondence and follow-up of claims progress.\nRecord all client information on the customer management system.\nEnsure all changes to customer details are communicated to and implemented by the appropriate fund managers.\nContribute towards the maintenance of existing customer relationships with the company.\nGather Policy information.\nEnsure FAIS Compliance.\n\nQualifications:Minimum requirements:\n\nMatric\n5 years experience in the Long-Term Insurance and Unit Trust (Investment) Industry.\nAdequate knowledge of Long-Term Insurance, Retirement Funds and Unit Trust Investment products.\n\nRequired skills/competencies:\n\nVery good administrative skills.\nProficient in both spoken and written Afrikaans and English.\nComputer literacy (MS Office).\nCustomer Service.\nCommunication skills (verbal and written).\nHard worker with integrity.\nAble to work under pressure.\nProblem-solver.\nAttention to detail.\nTeam player.\n",
      "contact": "Dianne",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002274-D"
    },
    {
      "jobTitle": "Tele Sales Administrator - Support Office Based",
      "startDate": "2023-09-14 - 2023-10-14",
      "vacancyType": "Permanent",
      "jobSpecFields": "Sales",
      "location": {
        "city": ", JHB - Central",
        "region": "Gauteng"
      },
      "details": "In order to apply for the position kindly note that you need to have the following requirements and experience:Job Purpose:* To assist in driving sales and administration within the department responsible for the business pointy of sale system.* Be able and willing to do database administration and also drive sales telephonically* Sourcing new sales opportunities* Processing of salesKey Job Responsibilities:* Faciliate orders on deal between national buyer and stores* Assist in looking at buy in opportunities for price increase suppliers* Verify stock levels on system* Loading of store specific deals&nbsp;* drive specific promtion through stores to ensure that all stores have placed sufficient quanitiesJob Requirements:* Must be able to work in a team environment and to support the team* Great communication skills, must be able to talk to stores daily* Must be computer literate in MS word, MS Excel.* Must be energeticBasic Interact Character Requirements:* Self starter* Must be reslilient and manage the situations* well spoken in Afrikaans / Africa language for the area",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002272-YDG"
    },
    {
      "jobTitle": "Receptionist / Admin Lady",
      "startDate": "2023-09-13 - 2023-10-22",
      "vacancyType": "Permanent",
      "jobSpecFields": "Admin, Office &amp; Support",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "The ideal candidate needs to have the following in order to apply for the position:* Must have at least 5-7 years working experience as a receptionist with a stable track record.* Previous working references essential.* Must have a valid grade 12 certificate* Computer literacy essential.* Valid driver's license with own reliable transport* Be willing to start immediately.",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002271-YDG"
    },
    {
      "jobTitle": "Admin Manager",
      "startDate": "2023-09-13 - 2023-10-13",
      "vacancyType": "Permanent",
      "jobSpecFields": "Admin, Office &amp; Support",
      "location": {
        "city": ", Burgersfort",
        "region": "Mpumalanga"
      },
      "details": "Qualification:\n\nB.Com with articles + managerial experience/qualification\n\nComputer Literacy:\n\nEmail\nMS Word and MS Excel\n\nExperience:\n\nManagement of staff\nAdministrative experience with a focus on systems and controls\nMinimum of three years accounting and/or auditing experience\nTechnical and mining industry exposure (Manufacturing a plus)\nIT proficiency, especially in automated systems and management reporting\nStrong problem-solving and communication skills\nAbility to prioritize and plan workloads with high attention to detail\n\nDuties:\n\nOversee all administrative functions in Steelpoort, Lydenburg, and Palabora areas with a team of 4\nTravel and potential overnight stays required\nAccounting processing and reconciliation of control accounts\nIdentify and implement areas for process improvement\nDesign and prepare ad hoc reports for management\nManage risk through process reviews and control implementation\nMonitor control environment for effectiveness and efficiency\n\nTransportation:\n\nLicense Code Required: 08\nOwn Transport Required: No\n\nWorking Hours:\n\nMonday to Friday\n07:00 to 16:00\n\nSalary:\n\nBasic Salary: Negotiable&nbsp;\nBenefits: Provident Fund, Medical, Group Life\n",
      "contact": "Rene",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002270-R"
    },
    {
      "jobTitle": "Accountant",
      "startDate": "2023-09-11 - 2023-10-31",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "The ideal candidate needs to have the following:* At least 5 - 10 years working experience as an Accountant* Must have a Financial Degree with SAIPA with completed articles.* Specifications:&nbsp;- Data processing up to trial balance- Preparing financial statements- SARS admissions* Computer knowledge in:- Pastel, Excel, Word and Draftworx",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002251-YDG"
    },
    {
      "jobTitle": "Bookkeeper",
      "startDate": "2023-09-11 - 2023-10-31",
      "vacancyType": "Permanent",
      "jobSpecFields": "Finance",
      "location": {
        "city": ", Brits",
        "region": "North West"
      },
      "details": "Qualifications required:* Matric with Mathematics, C Symbol or higherExperience required:* 2-5 years related working experience.Computer Literacy:* MS Office - Excel advanced (will be tested on Excel)Responsibilities:* Process bank statements on a daily basis and update new sales, full payments and delivered sets on a stock sheet.* Prepare reports for management and sales department* Process invoices and ensure timely payments* Various reconciliations including VAT, bank, creditors* Preparing general journals and passing them* Communication with the bank* Loading of payments* Prepare documentation for foreign payments and sending it to the bank* General bookkeeping duties - preparing invoices, capturing the bank and invoices etc.* Intercompany transactions and reconciling intercompany loan accountsAttend to customer e-mails and queries",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002269-YDG"
    },
    {
      "jobTitle": "Site Admininstrator",
      "startDate": "2023-09-10 - 2023-10-10",
      "vacancyType": "Permanent",
      "jobSpecFields": "Mining",
      "location": {
        "city": ", Burgersfort",
        "region": "Mpumalanga"
      },
      "details": "Key Responsibilities:\n\nTimesheet Management: Accurately collect and process employee timesheets, ensuring all records are up-to-date and compliant with company policies.\nInvoices Sign Off: Collaborate with various departments to review and approve invoices, ensuring accuracy and compliance with budgetary guidelines.\nOrder Parts: Facilitate the procurement of necessary parts and materials for site operations, maintaining optimal inventory levels.\nGeneral Administration: Handle various administrative tasks, such as filing, data entry, and record keeping to support efficient site operations.\n\nQualifications:\n\nPrevious experience in a similar administrative role is preferred.\nProficiency in Microsoft Office Suite (Word, Excel, and Outlook).\nStrong organizational and time management skills.\nExcellent communication skills, both written and verbal.\nAttention to detail and a high level of accuracy.\n",
      "contact": "Rene",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002268-R"
    },
    {
      "jobTitle": "Sales Rep",
      "startDate": "2023-09-06 - 2023-10-27",
      "vacancyType": "Permanent",
      "jobSpecFields": "Sales",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "The suitable candidate must have the following experience:* Valid driver's license.* Previous sales experience as a sales rep on the mines and surrounding areas* Must know the mining sites in and around the Rustenburg areas very well&nbsp;* No criminal recordMust be medically fit.",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002063-YDG"
    },
    {
      "jobTitle": "Generator Service / Technical Sales",
      "startDate": "2023-09-06 - 2023-10-21",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Lanseria",
        "region": "Gauteng"
      },
      "details": "The position is based both in the Lanseria and Brits area.The following is needed to apply for the position:Qualifications required:* Matric with Mathematics C Symbol or Higher a MUST HAVE (must send through with CV)Experience Required:* 0-5 years related working experience within the field.* Solar, electrical, mechanical or technical interestComputer Literacy:* MS Office - EXCEL ADVANCED A MUST (will be tested)Responsibilities &amp; Duties:* Present and sell products using solid arguments to prospective and existing customers* Supplying customer with support when necessary* Establish, develop and maintain positive business and customer relationshipsPerform cost benefit and needs analysis of new existing customers* Develop strategies for more effective sales and products* Supply management with reports on customer needs, problems, interests, competitive activities and potential for new products and servicesMeet or exceed monthly sales targets.",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002240-YDG"
    },
    {
      "jobTitle": "Sales Excecutive",
      "startDate": "2023-09-06 - 2023-10-12",
      "vacancyType": "Permanent",
      "jobSpecFields": "Sales",
      "location": {
        "city": ", Lanseria",
        "region": "Gauteng"
      },
      "details": "Qualifications required:* Matric with Mathematics C Symbol or Higher, A MUST HAVE, to be accompanied with CV.Experience Required:* 0-5 years related working experience within the field* Solar, electrical, mechanical or technical interestComputer Literacy:* MS Office - EXCEL A MUST (WILL BE TESTED)Responsibilities &amp; Duties:* Present and sell products* Develop strategies for more effective sales and products* Meet or exceed monthly sales targets/goals* High IQ and EQ* Hard working with good work ethic* Fluent in Both English &amp; Afrikaans* Excellent numeracy skills",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002241-YDG"
    },
    {
      "jobTitle": "Senior Call Out Technician",
      "startDate": "2023-09-05 - 2023-10-31",
      "vacancyType": "Permanent",
      "jobSpecFields": "Information Technology",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "The suitable candidates must have the following:Qualifications / Certificates:* A+ Certificate* N+ Certificate* MCSE CertificateWorking experience:* At least 5 years working experience within the IT industry.* Previous knowledge and working experience within networking, installation of CCVT, cameras networks etc.Salary:* R 20 - 25 000.00 (Including comm, AA rates, medical aid &amp; Bonus)",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002117-YDG"
    },
    {
      "jobTitle": "Management Trainee",
      "startDate": "2023-09-05 - 2023-10-31",
      "vacancyType": "Permanent",
      "jobSpecFields": "Engineering &amp; Technical",
      "location": {
        "city": ", Lanseria",
        "region": "Gauteng"
      },
      "details": "Qualifications Required:* Matric with Mathematics C symbol or higherExperience required:* 0-5 years working experienceComputer Literacy:* MS Office* MS Excel (WILL BE TESTED IN EXCEL)",
      "contact": "Yolanda Day-Garden",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002246-YDG"
    },
    {
      "jobTitle": "Shaft Timberman",
      "startDate": "2023-08-25 - 2023-10-31",
      "vacancyType": "Permanent",
      "jobSpecFields": "Mining",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "A local Platinum Mine around Rustenburg in the Northwest Province, is looking for a Shaft Timberman to join their team.&nbsp;Requirements:- Blasting Certificate- Onsetter/Banksman Certificate- Medically fitKindly send CV and Certificates to:lizelle@infopersonnel.co.za",
      "contact": "Welma Helberg Nel",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002056-WHN"
    },
    {
      "jobTitle": "Shaft Timberman",
      "startDate": "2023-08-25 - 2023-10-31",
      "vacancyType": "Permanent",
      "jobSpecFields": "Mining",
      "location": {
        "city": ", Rustenburg",
        "region": "North West"
      },
      "details": "A local Platinum Mine around Rustenburg in the Northwest Province, is looking for a Shaft Timberman to join their team.&nbsp;Requirements:- Blasting Certificate- Onsetter/Banksman Certificate- Medically fitKindly send CV and Certificates to:lizelle@infopersonnel.co.za",
      "contact": "Welma Helberg Nel",
      "apply": "https://webapp.placementpartner.com/wi/application_form.php?id=propersonnel&amp;vacancy_ref=RTB002261-WHN"
    }
  ]
}
